{"title":"Ethics in Ancient Israel[MyeBookShelf]","uid":11483415,"size":1692312,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:002f57e6fc5a9df22957434defbb6cfa634e81e0&amp;dn=Ethics+in+Ancient+Israel%5BMyeBookShelf%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MyeBookShelf","files":-1,"time":1416199134,"description":"Ethics in Ancient Israel[MyeBookShelf]\nEnglish | 2015 | ISBN: 0199660433 | 308 pages | PDF | 1,6 MB\nEthics in Ancient Israel is a study of ethical thinking in ancient Israel from around the eighth to the second century BC. The evidence for this consists primarily of the Old Testament/Hebrew Bible and Apocrypha, but also other ancient Jewish writings such as the Dead Sea Scrolls and various anonymous and pseudonymous texts from shortly before the New Testament period.\n\nProfessor John Barton argues that there were several models for thinking about ethics, including a 'divine command' theory, something approximating to natural law, a virtue ethic, and a belief in human custom and convention. Moreover, he examines ideas of reward and punishment, purity and impurity, the status of moral agents and patients, imitation of God, and the image of God in humanity.\n\nBarton maintains that ethical thinking can be found not only in laws but also in the wisdom literature, in the Psalms, and in narrative texts. There is much interaction with recent scholarship in both English and German. The book features discussion of comparative material from other ancient Near Eastern cultures and a chapter on short summaries of moral teaching, such as the Ten Commandments. This innovative work should be of interest to those concerned with the interpretation of the Old Testament but also to students of ethics","torrent":{"xt":"urn:btih:002f57e6fc5a9df22957434defbb6cfa634e81e0","amp;dn":"Ethics+in+Ancient+Israel%5BMyeBookShelf%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"002f57e6fc5a9df22957434defbb6cfa634e81e0","infoHashBuffer":{"type":"Buffer","data":[0,47,87,230,252,90,157,242,41,87,67,77,239,187,108,250,99,78,129,224]},"announce":[],"urlList":[]}}