{"title":"JavaScript Application Design - A Build First Approach - 1st Ed","uid":12521244,"size":10399756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:012a5aceef646d37aed17c7c6298cc77fa62e63d&amp;dn=JavaScript+Application+Design+-+A+Build+First+Approach+-+1st+Ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1443880296,"description":"Publisher: Manning Publications; 1 edition (February 16, 2015)\r\nLanguage: English\r\nISBN-10: 1617291951\r\nISBN-13: 978-1617291951\r\n\r\nSummary\r\n\r\nJavaScript Application Design: A Build First Approach introduces JavaScript developers to techniques that will improve the quality of their software as well as their web development workflow. You'll begin by learning how to establish build processes that are appropriate for JavaScript-driven development. Then, you'll walk through best practices for productive day-to-day development, like running tasks when your code changes, deploying applications with a single command, and monitoring the state of your application once it's in production.\r\n\r\nPurchase of the print book includes a free eBook in PDF, Kindle, and ePub formats from Manning Publications.\r\n\r\nAbout the Book\r\n\r\nThe fate of most applications is often sealed before a single line of code has been written. How is that possible? Simply, bad design assures bad results. Good design and effective processes are the foundation on which maintainable applications are built, scaled, and improved. For JavaScript developers, this means discovering the tooling, modern libraries, and architectural patterns that enable those improvements.\r\n\r\nJavaScript Application Design: A Build First Approach introduces techniques to improve software quality and development workflow. You'll begin by learning how to establish processes designed to optimize the quality of your work. You'll execute tasks whenever your code changes, run tests on every commit, and deploy in an automated fashion. Then you'll focus on designing modular components and composing them together to build robust applications.\r\n\r\nThis book assumes readers understand the basics of JavaScript.\r\n\r\nWhat's Inside\r\n\r\nAutomated development, testing, and deployment processes\r\nJavaScript fundamentals and modularity best practices\r\nModular, maintainable, and well-tested applications\r\nMaster asynchronous flows, embrace MVC, and design a REST API\r\nAbout the Author\r\n\r\nNicolas Bevacqua is a freelance developer with a focus on modular JavaScript, build processes, and sharp design. He maintains a blog at ponyfoo.com.\r\n\r\nTable of Contents\r\n\r\nPART 1 BUILD PROCESSES\r\nIntroduction to Build First\r\nComposing build tasks and flows\r\nMastering environments and the development workflow\r\nRelease, deployment, and monitoring\r\nPART 2 MANAGING COMPLEXITY\r\nEmbracing modularity and dependency management\r\nUnderstanding asynchronous flow control methods in JavaScript\r\nLeveraging the Model-View-Controller\r\nTesting JavaScript components\r\nREST API design and layered service architectures","torrent":{"xt":"urn:btih:012a5aceef646d37aed17c7c6298cc77fa62e63d","amp;dn":"JavaScript+Application+Design+-+A+Build+First+Approach+-+1st+Ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"012a5aceef646d37aed17c7c6298cc77fa62e63d","infoHashBuffer":{"type":"Buffer","data":[1,42,90,206,239,100,109,55,174,209,124,124,98,152,204,119,250,98,230,61]},"announce":[],"urlList":[]}}