{"title":"The_Witcher_2_Assassins_Of_Kings_Enhanced_Edition_Linux-Razor191","uid":10233112,"size":17175646016,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:01e6b30be74606fdaacd604a733708a0d4a9369b&amp;dn=The_Witcher_2_Assassins_Of_Kings_Enhanced_Edition_Linux-Razor191&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mr.Stifmeister","files":2,"time":1401154183,"description":"\n                                                       1 9 1 1         \n\n\n                          Razor 1911 proudly presents:\n           The Witcher 2 Assassins Of Kings Enhanced Edition Linux\n                              (C)  CD Projekt RED\n\n  Date: 2014-05-27                      Game Type : RPG\n  Size: 1 Disc                          Protection: Steam\n\n\nGame Notes\n~~~~~~~~~~\nThe player is Geralt of Rivia, a professional monster slayer, a witcher.\nEntangled in the political turmoil that engulfed Temeria, Geralt helped quell\nthe rebellion of the Order of the Flaming Rose. Soon after, he saved King\nFoltests life when the monarch was attacked by a witcher-like assassin.\nHe continues to protect the king, serving as his bodyguard as Foltest\nstrives to bring peace to his kingdom. The Orders last bastions have\nyielded to the royal army, yet one more task remains - the Baroness La\nValette announced her secession from the realm, and her fortress must\nbe taken. A month after the attempted assassination, Foltests armies\nstand at the gates of La Valette Castle, preparing for a final assault.\nStill at Foltests side, Geralt is among them, unable to begin his personal\nquest to discover the mysterious assassins origin and identity.\nThanks to the new, ultra-modern REDengine, The Witcher 2: Assassins of Kings\nfeatures both beautiful graphics and sophisticated in-game mechanics, drawing\nplayers into the most lively and believable world ever created in a video game.\nDefining new standards for realistic, non-linear game narration, The Witcher 2\nspins a mature, thought-provoking tale to produce one of the most complex and\nunique RPGs ever released on consoles. In addition to its epic story, the game\nfeatures a complex combat system that uniquely combines dynamic action and\ntactical depth.\n\n\nInstall Notes\n~~~~~~~~~~~~~\n1. Extract RARs\n2. Unpack the archive file\n3. Copy crack to install folder and replace the existing file\n4. Start the game with ./launcher\n5. Have fun!\n\nThis game works on Ubuntu 12.04 LTS with nvidia gfx card.\nSDL-2.0.0 must be installed.\n\n\nRazor 1911 Greetings\n~~~~~~~~~~~~~~~~~~~~\nRazor 1911 slices out greets to our friends and competitors around the world!\n\n\n                                     /\n                       Razor 1911   /__   Since 1985\n                                   /  /\n                                  /__/__\n\n             SUPPORT THE COMPANIES THAT PRODUCE QUALITY SOFTWARE!\n    IF YOU ENJOYED THIS PRODUCT, BUY IT!  SOFTWARE AUTHORS DESERVE SUPPORT!!\n","torrent":{"xt":"urn:btih:01e6b30be74606fdaacd604a733708a0d4a9369b","amp;dn":"The_Witcher_2_Assassins_Of_Kings_Enhanced_Edition_Linux-Razor191","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01e6b30be74606fdaacd604a733708a0d4a9369b","infoHashBuffer":{"type":"Buffer","data":[1,230,179,11,231,70,6,253,170,205,96,74,115,55,8,160,212,169,54,155]},"announce":[],"urlList":[]}}