{"title":"The Himalayans (Pre Counting Crows) - She Likes The Weather","uid":3514651,"size":66417291,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:01f1327c580d6f453c5f73f4fcd0d99f2339d2b3&amp;dn=The+Himalayans+%28Pre+Counting+Crows%29+-+She+Likes+The+Weather&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KillTeam","files":18,"time":1156137547,"description":"The Himalayans are a Bay Area-based band featuring the vocals and lyrics of a pre-Counting Crows era Adam Duritz set to the energetic music of Dave Janusko (guitar), Dan Jewett (lead guitar), Marty Jones (yeah THAT Marty Jones of &quot;MR. JONES&quot; fame) (bass) and Chris Roldan (drums). This compact disc features 17 gems composed by the band, three of them produced by Crows guitarist David Bryson, including the Himalayans emotional masterpiece, ?Round Here.?\n\n  Live interview clips augment the disc and highlight the sense of humor and camaraderie enjoyed by the band members as they composed their music and circled the bay performing these creations to eager and ever-more enthusiastic audiences. It was a magic time for local bands when audiences stayed all night because they wanted to, bands practiced until they were forced not to and musicians hung out with their bandmates because they liked to.\n\n  The music realized on this disc is a reflection of these last days when ?ones? and ?zeros? were amp settings not attempts by computers to mimic the infinite variety in human musical expression. Somehow, the precious moments the Himalayans spent gathered around Mi Mazatlan?s large wooden tables with endless supplies of chips and green sauce were as important as those in the studio and the band took advantage of every one of them. These moments provide the emotional peaks and valleys that defined their landscape, be it bathed in sun or, moments later, covered in cloud, and served as engines of change giving shape and form to the stories that fill this disc give it its title: She Likes the Weather.\n\n  She Likes the Weather is a professionally designed and packaged compact disc release pressed from a glass master for increased durability and sonic quality. This release is complete featuring the entire 17 song catalogue as well as the original version of ?Round Here? and the popular radio interview segments. The newly designed 4-color artwork pays homage to the conquering of Mt. Everest while the cover folds out to reveal the Himalayans story in detail and the disc itself doubles as a map of Tibet (very useful) and emergency snow shovel (more useful). This very popular world-wide seller is shrink wrapped for your protection and safety tested here at Himalayans headquarters.\n\n\nTrack List:\n\n1.  Jaded\n2.  River Shannon\n3.  Way Home\n4.  She Likes The Weather\n5.  Babies\n6.  Diamonds And Babies And Cars\n7.  Round Here (Original Version)\n8.  Save My Life\n9.  Floating Over You\n10. Ordinary Superman\n11. Angels In America\n12. A Little Discipline\n13. Someone Elses Chapstick\n14. Wishing Well\n15. 99 Days\n16. Sailor Song\n17. Nothing But A Child\n\nEnjoy!","torrent":{"xt":"urn:btih:01f1327c580d6f453c5f73f4fcd0d99f2339d2b3","amp;dn":"The+Himalayans+%28Pre+Counting+Crows%29+-+She+Likes+The+Weather","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01f1327c580d6f453c5f73f4fcd0d99f2339d2b3","infoHashBuffer":{"type":"Buffer","data":[1,241,50,124,88,13,111,69,60,95,115,244,252,208,217,159,35,57,210,179]},"announce":[],"urlList":[]}}