{"title":"Grace-Guide to Masonic Handshakes in Movies(over 194 films)(2001","uid":4586261,"size":221701,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:034c0144748c7be1de0dc9fd22ed14e783f1403b&amp;dn=Grace-Guide+to+Masonic+Handshakes+in+Movies%28over+194+films%29%282001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1229633224,"description":"This is Dean Grace's mindboggling booklet Guide to Masonic Handshakes in the Movies (2001) which is a list of films containing one or more of the three most common masonic handshakes used by certain world political leaders and certain motion picture actors and actresses. Members of various masonic fraternities usually shake their hands with eachother in an unusual way by pressing the thumb of the right hand over the knuckle joints or between the knuckle joints on the other hand. The author patiently viewed a myriad of movies and used slow motion and freeze-frame control to have a closer look at moments where movie actors shake their hands. This might seem as a ludicrous thing to do but actually provides us with revealation of who exactly is running the show in Hollywod (and elsewhere). The list of films is arranged in ascending chronological order according to the year in which each film was made with time measured from the beginning of the feature presentation to the first masonic handshake in the film. With every movie mentioned, a short explanation is provided that together builds a mosaic on masonic ritual, practice and history. Starting with 1915 movie feature &quot;The Birth of a Nation&quot;, prepare yourself for a tour-de-force of exposure of masonic movie propaganda that millions have been watching for almost a century. Also includes a list of movies where no masonic handshakes appear. Find out what kind of hidden masonic symbology lies behind your favourite movie. 35 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:034c0144748c7be1de0dc9fd22ed14e783f1403b","amp;dn":"Grace-Guide+to+Masonic+Handshakes+in+Movies%28over+194+films%29%282001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"034c0144748c7be1de0dc9fd22ed14e783f1403b","infoHashBuffer":{"type":"Buffer","data":[3,76,1,68,116,140,123,225,222,13,201,253,34,237,20,231,131,241,64,59]},"announce":[],"urlList":[]}}