{"title":"Psychedelic Science by Bill Eagles","uid":3214357,"size":628942848,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:037ed16928a9528ac035059c9c525c5607cbc6d3&amp;dn=Psychedelic+Science+by+Bill+Eagles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"egolost","files":1,"time":1083763624,"description":"Psychedelic Science\n\n                   By Bill Eagles\n\n                 -------------------\n\n      Psychedelic Science was broadcast on     [programme notes]\n      27th February 1997.\n\n             --------------------------------------------------\n\n                          Programme Notes                       [Image]\n\n     In the late 1960s, human experiments with psychedelic drugs were\n     brought to a halt. Government reacted to the anarchy of the hippy\n     counter-culture. The drug-crazed Charles Manson slayings came to\n     symbolise public fear of the street use of LSD. Funding ceased,\n     and the few researchers who battled on were ostracised. But lost\n     in the blanket ban were remarkable research projects in the field\n     of psychiatry that held out new hope for the treatment of\n     schizophrenia and alcoholism. Bill Eagles' extraordinary film\n     tells the story of a handful of dedicated scientists who have\n     struggled to make psychedelic research respectable again.\n\n     In the USA, psychiatrists Rick Strassman and Charles Grob, and\n     neuroscientist Deborah Mash each quietly began investigations with\n     unknown psychedelic compounds, to avoid the alarm bells of LSD.\n     Strassman pursued the Federal Drug Administration for permission\n     to do safety trials of DMT. Mash works on treating cocaine\n     addicts, achieving success with Ibogaine, a psychedelic derived\n     from a West African plant. Their success hinges on the patient\n     having a 'peak' experience, entering the realm of the mystical or\n     religious. The early researchers had spotted this. Now it was\n     dramatically reinforced by unique new evidence from Brazil.\n\n     Unable to work in the USA, Grob visited Brazil to track down the\n     ritual use of Ayahuasca, a leaf rich in the powerful DMT. For\n     centuries it has been used amongst the shamans of the Amazon. But\n     today, in urban Brazil, tens of thousands of men, women and\n     children are taking the drug as part of an ecstatic Christian cult\n     experience. The Brazillian Government asked Grob to look at\n     long-term damaging effects of the drug. Instead, he found no\n     evidence of toxicity or brain damage, and also that long-term\n     users functioned better in their community. In 1992 Brazil\n     legalised ritual use of Ayahuasca. The FDA took careful note.\n\n     Then in the early 1990s, leading lights of the US computer\n     industry began admitting that many breakthroughs in Silicon Valley\n     in the 70s and 80s had been inspired by regular psychedelic drug\n     use. Nobel Prizewinner Kary Mullis, and founding father of\n     Microsoft, Bob Wallace, reveal on camera the psychedelic influence\n     on their creativity. This anecdotal evidence raised support for\n     the psychedelic researchers. Now Strassman has received approval\n     from the FDA for research into LSD itself.\n\n     But it is a delicate moment for the new psychedelic science. Its\n     power to treat some of the worst ailments of society has now been\n     recognised. Yet fears of the excesses of the 1960s are still\n     strong. In Japan the Aum Shinrikyo cult is believed to have used\n     psychedelics to brainwash its members before the Tokyo subway gas\n     attack. Among high-school leavers, use of psychedelics is rapidly\n     increasing - and strange new drugs are appearing on thestreets.\n     The scientists and drug regulators know there is a knife-edge\n     between hope for new treatments and unleashing a whirlwind.","torrent":{"xt":"urn:btih:037ed16928a9528ac035059c9c525c5607cbc6d3","amp;dn":"Psychedelic+Science+by+Bill+Eagles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"037ed16928a9528ac035059c9c525c5607cbc6d3","infoHashBuffer":{"type":"Buffer","data":[3,126,209,105,40,169,82,138,192,53,5,156,156,82,92,86,7,203,198,211]},"announce":[],"urlList":[]}}