{"title":"Terence Hill and Bud Spencer Collection (NL SUBS) 4-9 vlinder TB","uid":6120980,"size":4461335560,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:044f137a670e32c159835b973f7409eccc078375&amp;dn=Terence+Hill+and+Bud+Spencer+Collection+%28NL+SUBS%29+4-9+vlinder+TB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Vlinder2","files":-1,"time":1295739171,"description":"Terence Hill &amp; Bud Spencer - The Ultimate Collection - DVD 4 van 9 \n\nNegen dvd's met circa 30 uur aan actie en humor! Laat je vermaken door de avonturen van Terence Hill &amp; Bud Spencer.\n\n\n\nInhoud:\nNinja Shadow &amp; Lord of the Sun \nIndians &amp; Gonzales Revenge \nDiamonds &amp; Condor Mission \nMidsummer in Daisy Town &amp; Ma Dalton &amp; Ghost Train &amp; Who is Mr. Joseph's \nGrand Delusions &amp; Lucky's Fiancee &amp; Nobody's Fool &amp; CafÃƒÂ© OlÃƒÂ© \nDaisy Town \nA Policy for Hell &amp; The False Entruscan \nLet the Buried Lie &amp; Another Falling Star \nBoomerang &amp; An Unusual Insurance \n      \n   \n \nDVD 4\n\nMidsummer in Daisy Town \n\nLotta Legs is nog steeds verliefd op Luke, die niet hetzelfde voor haar lijkt te voelen. Een zigeuner verschijnt in Daisy Town, die een mysterieuze 'liefdesdrank' verkoopt, dat ervoor zorgt dat degene die het drinkt verliefd wordt op de eerste de beste die hij ziet. Dat is precies wat Lotta nodig heeft! Maar alles gaat mis: Joe Dalton wordt verliefd op de zigeuner, Jack wordt verliefd op Lotta en Averill wordt verliefd op Jolly Jumper, het paard! Nadat het liefdesdrankje is uitgewerkt, verklaart Luke zijn liefde voor Lotta, maar die is in een diepe slaap....\n\nMa Dalton \n\nDe moeder van de Dalton broers heeft een oogje op Lucky Luke, waardoor haar zoon Joe jaloers wordt. Hierdoor ontstaat het plan om met zijn broers uit de gevangenis te ontsnappen. Om de aandacht van hun moeder te krijgen, zijn de 4 broers van plan om alle banken in de regio te gaan beroven, verkleed als Ma Dalton. Want wie schiet er nou op een oude dame? In Daisy Town, hoort Luke over het plan......\n\nGhost Train \n\nAxel, een oude dronken goud zoeker, vertelt mysterieuze verhalen aan de mensen van Daisy Town - verhalen van de oude spooktrein. Niemand gelooft de sprookjes, behalve de jonge journalist Becky. Zelfs Lotta en Luke geloven de sprookjes niet, tot op een dag, Axel verdwijnt en terwijl Luke probeert om Lotta te overtuigen dat geesten niet bestaan, verdwijnt ze letterlijk voor zijn ogen. Becky heeft een nieuw mysterie om te ontrafelen..........\n\nWho is Mr. Joseph's \n\nHet land rondom Daisy Town is verdeeld tussen boeren en veehouders. Luke maakt zich er niet zo druk over totdat een bepaalde Mr. Josephs een ton buskruid wil verkopen. Geholpen door Laura, een jonge boerin, ontdekt Luke dat Mr. Josephs eigelijk Joe Dalton is ....... Luke en Laura worden gevangen gezet in een oude mijn en de Daltons starten hun Vendetta.\n\n\nEnglish\nMidsummer in Daisy Town\nLotta Legs is still in love with Luke, who does not seem to have the same feelings. A gypsy appears in Daisy Town, selling a mysterious 'love potion', that makes the one that drinks it fall in love with the first person he sets sight on. That's just what Lotta needs! But everything goes wrong: Joe Dalton falls in love with the gypsy, Jack falls in love with Lotta and Averill falls for Jolly Jumper, the horse! After the love potion wears off, Luke confesses his love to Lotta while she is fast asleep... \n\n\nMa Dalton\nActors:  Terence Hill\n\nWith the infamous Dalton Brothers behind bars, Luke plans on getting a little rest. On returning to Daisy Town, Luke finds out that the outlaw's sweet white-haired mother Ma Dalton has been robbing all the shopkeepers in the local towns. They have been letting her get away with her crimes because they know she is too proud to beg for charity. Luke and Ma Dalton become friends, causing a furious Joe Dalton to break out of prison with his brothers, while chained to Bushwack, the dumbest guard dog in the West\n\nWho is Mr. Joseph's \n\nSynopsis: Lucky Luke gets caught between settlers and the ranchers in a land feud that threatens to tear Daisy Town apart... When Luke discovers that the mysterious Mr. Joseph is at the feuds center, offering to sell a secret weapon of 'defense' to both sides, Luke investigates. Luke discovers that Mr Jospeh is none other than the dreaded outlaw Joe Dalton.\n\n\n\nTaal: Engels!\nOndertitels : Nederlands (instelbaar)\nDe Cover en Label : Ja!\nSpotinformatie \nBeeldformaat  : 4:3\nFormaat : DVD5 \nBron : Retail\n \n\n \nGenre : Actie\nAvontuur\n\nTBS\n\nBlack-Sam\n","torrent":{"xt":"urn:btih:044f137a670e32c159835b973f7409eccc078375","amp;dn":"Terence+Hill+and+Bud+Spencer+Collection+%28NL+SUBS%29+4-9+vlinder+TB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"044f137a670e32c159835b973f7409eccc078375","infoHashBuffer":{"type":"Buffer","data":[4,79,19,122,103,14,50,193,89,131,91,151,63,116,9,236,204,7,131,117]},"announce":[],"urlList":[]}}