{"title":"Sleeper - The It Girl [1996]","uid":9420314,"size":334363834,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:04cea2d2b2d35aba03481bddad9dcbbdbaebb073&amp;dn=Sleeper+-+The+It+Girl+%5B1996%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1388571895,"description":"Although it lacks a standout track on the level of Smart's &quot;Inbetweener,&quot; Sleeper's second album, The It Girl, is a stronger effort, suggesting that lead singer/songwriter Louise Wener could develop into a distinctive talent. Certainly, her melodies and hooks are uniformly better this time around, ranging from the bouncy &quot;Sale of the Century&quot; to the sighing melancholy of &quot;What Do I Do Now?&quot; Wener's lyrics continue to be underdeveloped and simplisitic, but her hooks usually make that tendency easy to ignore. What would have made The It Girl an even stronger album is a clearer, more focused production. Although the sound of the album changes subtlely throughout the course of the record, the overall effect is numbingly similar. The rhythm section lacks drive and the guitars lack balls -- they blend together into one dull grind. Out of all of Stephen Street's productions, this is the most undistinguished. Occasionally, the song is strong enough to compensate for the flat production, but Sleeper albums will not only improve according to the development of Louise Wener's songwriting, but also as the band finds the right producer. (4.5/5)","torrent":{"xt":"urn:btih:04cea2d2b2d35aba03481bddad9dcbbdbaebb073","amp;dn":"Sleeper+-+The+It+Girl+%5B1996%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04cea2d2b2d35aba03481bddad9dcbbdbaebb073","infoHashBuffer":{"type":"Buffer","data":[4,206,162,210,178,211,90,186,3,72,27,221,173,157,203,189,186,235,176,115]},"announce":[],"urlList":[]}}