{"title":"Arma.3.Repack-R.G.Mechanics.[v 1.14]","uid":9812504,"size":8738208291,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0661cba39babb32d790e6e34fa6d491bb45e6571&amp;dn=Arma.3.Repack-R.G.Mechanics.%5Bv+1.14%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Taker009","files":24,"time":1395563423,"description":"Arma.3.Repack-R.G.Mechanics.[v 1.14]\n\n\n\nIn the original: Arma 3 [v 1.14] \nGenre: Action, 3D, 1st Person, 3rd Person \nYear: 2013 \nPublication Type: RePack [Repack] \nTablet: enclosing RELOADED \nVersion: v 1.14 \nLanguage: ENG | MULTI9 \nVoice set Language: ENG \n\nDescription: \n\nARMA 3 - a new milestone in the genre of tactical military simulation from \nindependent studio Bohemia Interactive, creators of the acclaimed Operation \nFlashpoint. ARMA 3 absorbed all the best from the previous games in the series \nand has introduced many innovations. New physics engine allows the player to \ncontrol the unprecedented realism fighting. The new model of behavior technology, \nthe broadest range of weapons, from the already become classic M16 and \nAK74 before prototypes are not yet enrolled in a wide use, as well as the \nlong-awaited series of fans the opportunity to swim under water. \nAfter several years of exhausting war, Europe has become the last \nrefuge of the battles weakened NATO. Stratis island captured by \nthe enemy on the Middle East and it will gain guaranteed superiority \nof NATO in the region. Operation has begun, &quot;Magnitude&quot;: a small \ngroup of specially trained soldiers with scientists undercover sent \nto the island in the Mediterranean Sea. Mission in danger of collapse! \nThe team is almost completely destroyed, and the main character, \nCaptain Scott Miller washed ashore enemy island. Complete the operation \nin his power, but his way there all the dangers of modern warfare, ruthless \nenvironment and numerical superiority of the enemy. Ponder will have every step! \n\nSystem requirements: \n\nOperating system: Windows Vista / 7/8 \nProcessor: Intel Dual Core processor with a clock speed of 2.4 GHz \nMemory: 2 GB \nHard drive: 15 GB \nSound device: compatible with DirectX 9.0c \nVideo Card: 512 MB VRAM (NVIDIA GeForce 8800 GT / ATI Radeon HD 3830) \n\n\nFeatures:\n\n- New game engine allows you to control the fighting with unprecedented realism. \n- Now you can dive under the water! \n- Variety of weapons - from the &quot;classic&quot; AK-74 and M-16 and not yet released into production prototypes. \n- Combining all the positive qualities predecessors, with a new engine and evolutionary features, ARMA 3 provides the player with nothing comparable experience tactical combat. \n- Create your own game scenarios using a simple and intuitive mission editor.\n\n\n\nRepack  Features :\n\nDo not cut / recoded \nVersion of the game - v 1.14 \nRePack by RG Mechanics\n\n\n\nInstallation\n\nStart the installation file setup.exe; \nInstall according to the instructions of the installer; \nPlay \nDuring the installation, it is desirable to disable antivirus program!","torrent":{"xt":"urn:btih:0661cba39babb32d790e6e34fa6d491bb45e6571","amp;dn":"Arma.3.Repack-R.G.Mechanics.%5Bv+1.14%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0661cba39babb32d790e6e34fa6d491bb45e6571","infoHashBuffer":{"type":"Buffer","data":[6,97,203,163,155,171,179,45,121,14,110,52,250,109,73,27,180,94,101,113]},"announce":[],"urlList":[]}}