{"title":"La storia in giallo 137 - Pier Paolo Pasolini [Mp3 Ita] [TNTvill","uid":6606616,"size":69464943,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:06bd564f3719b143a6028aa57addc4d6c3c47809&amp;dn=La+storia+in+giallo+137+-+Pier+Paolo+Pasolini+%5BMp3+Ita%5D+%5BTNTvill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"darayava","files":1,"time":1313423367,"description":"La storia in giallo 137 - Pier Paolo Pasolini [Mp3 Ita] [TNTvillage]\n\nLA STORIA IN GIALLO\n\nLa Storia in giallo  ÃƒÂ¨ un programma in onda su radio3 scritto e condotto da Antonella Ferrera, con la regia di Francesco Pannofino, regia del dibattito di Manuel de Lucia, musiche originali di Alessandro Molinari, assistenza tecnica di Fiore Liborio, cura di Diana Vinci.\nRedazione: Carlo Dellonte e Roberto Ritondale Paola Veneto\nDa poco ha subito il mutamento nel nome diventando: Cuore di Tenebra\n\n\nLa storia e le storie di personaggi celebri, le vicende tragiche o misteriose che hanno segnato I loro destini e a volte quelli di molti altri. Uomini della politica o del malaffare, uomini di fede o vissuti nel peccato, personalitÃƒÂ  borderline, mitomani o geni maledetti. Le devianze e I turbamenti di grandi artisti di tutti I tempi che hanno riversato nella loro opera la fatica o la follia del vivere.\nLa Storia in Giallo li racconta come in un film, attraverso le voci dei migliori doppiatori italiani. Dopo lo sceneggiato che catapulta l'ascoltatore al centro di una storia, segue l'intervista ad un personaggio della cultura che ne spiega e racconta dinamiche, curiositÃƒÂ  e risvolti inediti.\n\nLa storia in giallo - in onda il 29/10/2005\n\nPIER PAOLO PASOLINI\n\n\nÃƒË† la notte del primo Novembre 1975, quando sul lungomare di Ostia due agenti fermano un giovane che sfreccia a tutta velocitÃƒÂ  al volante di un'Alfa grigia. Il ragazzo si chiama Giuseppe Pelosi, meglio noto negli ambienti di borgata come &quot;Pino la rana&quot;. Dice di aver rubato l'auto e di non sapere che il suo proprietario ÃƒÂ¨ Pier Paolo Pasolini. Il caso sembra chiuso, ma la mattina seguente il regista e scrittore viene ritrovato cadavere in un campetto dell'idroscalo. Pino la rana confessa, ma in molti si convincono che ad agire non puÃƒÂ² essere stata una sola persona. Si apre una lunga inchiesta, che perÃƒÂ² non riesce a provare molto e a distanza di trent'anni il giallo sulla morte di Pasolini non ÃƒÂ¨ stato ancora risolto.\nL'ultimo capitolo lo ha scritto qualche mese fa proprio Giuseppe Pelosi, durante un'intervista-confessione alla giornalista Franca Leosini, ospite quest'oggi di Antonella Ferrera. \nLa voce di Pier Paolo Pasolini ÃƒÂ¨ quella di Francesco Meoni.\n\nFile Details\n========================================\nName..........: 2005 - Pier Paolo Pasolini.mp3\nFilesize......: 66Mb\n\nAudio Bitrate.: 192Kbps\nAudio Freq....: 44KHz\nAudio Channels: Mono\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:06bd564f3719b143a6028aa57addc4d6c3c47809","amp;dn":"La+storia+in+giallo+137+-+Pier+Paolo+Pasolini+%5BMp3+Ita%5D+%5BTNTvill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06bd564f3719b143a6028aa57addc4d6c3c47809","infoHashBuffer":{"type":"Buffer","data":[6,189,86,79,55,25,177,67,166,2,138,165,122,221,196,214,195,196,120,9]},"announce":[],"urlList":[]}}