{"title":"The Muggs-Born Ugly-2011-SDR","uid":6520603,"size":100365509,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0796928c6e7bb0c6b30936e4a81611059889b812&amp;dn=The+Muggs-Born+Ugly-2011-SDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"soupucia","files":-1,"time":1309975523,"description":"ARTIST: the muggs\nTITLE: born ugly\nLABEL: Just For Kicks\nGENRE: Rock\nSOURCE: CD\nBITRATE: 268 kbps avg\nPLAYTIME: 49:03\nRELEASE DATE: 2011-04-29\nRIP DATE: 2011-06-28\nENCODER: LAME 32bits version 3.98.4 (http://www.mp3dev.org/) -V0\n\nTrack List\n\n1.  born ugly                        4:21\n2.  blood meridian                   3:53\n3.  home free                        4:19\n4.  clean break blues                4:20\n5.  notes from underground           2:05\n6.  dear theo                        3:25\n7.  losing end blues                 3:44\n8.  6 to midnight                    5:10\n9.  sturm und drang                  3:29\n10. hats off to mr. beardsley        3:42\n11. world around                     2:24\n12. kitchen sink blues               4:11\n13. last words                       4:00\n\nRelease Notes:\n\nIt's 1972 and I've got my Plymouth Road Runner ready, she's packing a 440 CID\nengine with a 4-barrel carburetor under her hood, she's gassed up and ready to\ngo.  We've booked a special appointment with an old friend.  Let her fuckin'\nrip, she burns her tires down the roadway, the streetlights are a blur to my\neyes, everything I see just flashes by, asphalt tearing up behind me.  Can't\nkeep my old friend waiting. Turn right, I head south, way down Washington Blvd,\nwhere my old friend lives tonight... Look for number 1, Cobo Hall.  Ladies &amp;\nGentleman, we are proud to present, in support of their new release, Born Ugly,\nThe Muggs.........\n\nBorn Ugly begins, fuckin' groove slays, the crowd has already risen off their\nasses, already feeling electric, wired, if there was a perfect song to start an\nalbum off with then, this is it.  We slide right into Blood Meridian, another\nguitar heavy groove, like Humble Pie of old, the Muggs, have the head nodding in\nall directions.  I see the crowd move in unison, heads banging, smoke filled\nair, that sweet smell.....  Numb the body has become, my ears slaves to the\nmusic filling up the hall, can I say it's knocking me out cold.\n\nWe hit Home Free, a more melodic song, all three instruments take you down this\npath to enlightment, slower, relaxes the mind...then it hits you with this sweet\nsoaring guitar solo...that just brings me back in my seat, crowd air guitaring,\nhands contorted in odd movements.. Spastic motions...almost beautiful like, then\nit just falls into that trance that melodic sweet sense again.  This show, so\nfar, is above and beyond what we expected...the crowd just mesmerized.  We feel\nlike we are right up there with them, the band, the Muggs.\n\nClean Break Blues up next, slide guitar frantic, infectious, this romp is\nanother burner, although this time they throw in some sweet melody interplays\nbetween the band.  It's a slide workout which gives this song something of a\ntwist over the first three...then right into Notes From The Underground, a real\nhard rock stomper, short yet sweet, the we  segue into Dear Theo , with another\nbeautiful slide workout.  These trilogies of songs complement each other so\nwell, you would could easily think of it as one long great song.  It certainly\nkept the crowd outta their seats.\n\nLosing End Blues is a simple melodic number, with yet another stunning guitar\nline.  The melody on this number shines once again. Certainly the Muggs have\nthis formula down pat.  It adds a nice dimension to the songs. It certainly has\nthe feeling of some of the great 70's bands; LEB would not look out of place as\na song on any one of the &quot;classic rock&quot; bands we grew up listening to. 6 To\nMidnite is another rocker. Great interplay between the drums and the guitar, the\njam in the middle is like foreplay, just before the action begins again, climax.\nYou can see, feel the crowds adoration for the band tonight.  The Muggs are\nputting on a display of retro rock, done the right way.\n\nAfter a brief second to compose myself, we are introduced to Sturm Und Drang,\nwhich starts as a by the numbers rocker. Which isn't all bad, but up until this\npoint the songs have been stronger, however the song quickly segues into Hats Of\nMr. Beardsley, which has a riff to rock, its dark, and it gets the crowd up on\ntheir feet again, it's a killer, and the audience has bought in.\n\nAll eyes on the stage, an acoustic number sets off on song number 11.  World\nAround is the most beautiful song on this album, in this show, to my ears. The\nmusicians are top notch on this song, the background melodies are outstanding.\nThis is a real keeper.  After this short number, the Muggs get the crowd moving\nagain, with another hard stomper, Kitchen Sink Blues.  I can't but feel like I'm\nhearing some older Humble Pie influences (the Pie being one of the greatest\nboogie/rock bands around).  Kitchen Sink Blues does not let up, the perfect\nfollow up from World Around.  Stamping my feet, the ground shakes, the all walls\nfeel like they are ready to crumble.\n\nWe have now reached the end, you can feel the disappointment.  Last Words ends\nthe album off on a high note.  Just a riveting song with a stupendous guitar\nworkout.  Hard to see how anyone will leave here disappointed.  Sold out show,\nsold me out, solid solid stuff.\n\nThe Muggs (Born Ugly) is without a doubt one of the best retro hard rock\nreleases I have heard in a very long time.  If you like the first two releases\nby them (S/T &amp; On With The Show), then you will not be disappointed at all.  I\nfound this to be there strongest album yet. It is a pleasure to the ears, to any\nfan of hard rock with a retro twist.  If you like the Pie, James Gang etc...\nthen you will absolutely need this for your collection.\n\nMy only question is, how is this band not signed to a record label?  Especially\nwhen there is one in their hometown that the Muggs would easily fit on their\nroster.  It's a shame, a band with talent like this, goes unnoticed and does not\nget the recognition they deserve. Do yourself and the band a favor and buy this\nrelease.\n\nEasily in my top 5 releases of the year if not the top right now.\nby William Bissonette / Planet Fuzz","torrent":{"xt":"urn:btih:0796928c6e7bb0c6b30936e4a81611059889b812","amp;dn":"The+Muggs-Born+Ugly-2011-SDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0796928c6e7bb0c6b30936e4a81611059889b812","infoHashBuffer":{"type":"Buffer","data":[7,150,146,140,110,123,176,198,179,9,54,228,168,22,17,5,152,137,184,18]},"announce":[],"urlList":[]}}