{"title":"Munin (2014)(2-click run)(Registered)","uid":10357784,"size":328986267,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:093020d686f0c856a76310c8fe47dc125d7fc896&amp;dn=Munin+%282014%29%282-click+run%29%28Registered%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"The_Duck1","files":-1,"time":1402766316,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a 'Easy Run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDESCRIPTION:\nImagine that you are able to literally move mountains! Use realistic physics, northern runes, rotating platforms and their resourcefulness to help Munin, Odin's messenger, to regain strength in his 2D-journey through the worlds of Yggdrasil. Munin Raven, faithful messenger of Odin, Loki's machinations have been deprived of wings and faces the death girl. Wingless, but full of determination, it will overcome the nine worlds of Yggdrasil to regain their feathers and return to Asgard. Using rotating elements environment to help overcome obstacles and solve puzzles game Munin expands traditional notions of side-scrollers. Acting on different objects, you can create bridges of the pillars, turn wall on the floor and open new roads. Other gameplay elements, such as switches and moving objects obey the laws of physics, do puzzles even more interesting elements of the environment can be rotated, and the stones and debris rolling down with a crash and fall. Liquids such as water or lava flow properly and northern runes show the way to the lost feathers. Munin includes do with amazing worlds, 81 levels of thrilling and exciting about 7 hours of gameplay.\n\nInstallation instructions:\n1. Execute the .exe file.\n2. Follow the instructions.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:093020d686f0c856a76310c8fe47dc125d7fc896","amp;dn":"Munin+%282014%29%282-click+run%29%28Registered%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"093020d686f0c856a76310c8fe47dc125d7fc896","infoHashBuffer":{"type":"Buffer","data":[9,48,32,214,134,240,200,86,167,99,16,200,254,71,220,18,93,127,200,150]},"announce":[],"urlList":[]}}