{"title":"A Fool`s Walkthrough Enlightened Bullshit (Rev 5)","uid":6811160,"size":293926,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:098d9f27845ec6521f9faec78fba1b7493d14693&amp;dn=A+Fool%60s+Walkthrough+Enlightened+Bullshit+%28Rev+5%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":2,"time":1321041516,"description":"A Fool`s Walkthrough Enlightened Bullshit\n\nRevision 5\n\n*Note: there is a separate section with whats new.\n\n\nINFO:\n\nRevision/Edition : 5\nAuthor/Publisher : Anonymous\nOfficial Release : 11 November 2011\nLanguage : English\nLicense : Public - Free\nCover : Does not have - at all (You are welcome to make one and send it)\nFormat: PDF\nCategory : Social\nPlot/About : A log of one`s learning the ways to dissolve any manner of bullshit.\n\n\nUPLOADER`s Comment:\nA refreshing take on social matters in about 30 pages. If you are a person with the stomach to deal with your failures - this is likely to amuse you nicely. Otherwise you can call it a clever way to go about bullshit and you`d hate it for shedding light on your own BS.\n\nINTRO : A few non spoiler quotes:\n\n&quot;The increasing number of &quot;enlightening&quot; materials floating about is seriously stinking lately, even if conspiracy is not in your vocabulary. I figured I might as well publicize a take on social matters in a way that will give conspiracists, neutrals and anti-conspiracists identically unnerving rectal sensations.&quot;\n\n&quot;This isn`t some humane generous act of revelation, or any other type of &quot;sweetened&quot; candy giveaway, the least of which is some supposedly profound truth presented to you with the claim that it`s relevant and/or valuable information that you need to believe.&quot;\n\n&quot;The shit in here isn`t tucked under the rug. If you don`t want it on you - do mind your step.&quot;\n\n&quot;Everything I`ve said in here is my way of outgrowing the loop of bullshit - and it works for me.&quot;\n\n&quot;Reality is what we perceive - it is our limited understanding of what is actively happening.&quot;\n\n&quot;It`s a simple exercise - imagine now you worked you entire life to expand your financial &quot;security&quot; and secure as much authority as you can. Now some lunatics shouting &quot;death to the new world order&quot; say they have this brilliant peace idea for you to share all your privileges with them (you know - the product of all that life long, dynasty long - tediously intricate backstabbing). Not only that but they offer to reward you by impaling you on a cactus if they found you morally or otherwise guilty about anything. So, if you handed them the power - can you imagine they would find something upsetting about your past - you know in the time you, lied, cheated, stole, bribed, murdered and so on to secure or protect your privileges, yeah - mostly from these same people... How exactly do you see yourself relinquishing resources and power so the misguided that didn`t bother to burden their brain cells and believed your lies can benefit?&quot;","torrent":{"xt":"urn:btih:098d9f27845ec6521f9faec78fba1b7493d14693","amp;dn":"A+Fool%60s+Walkthrough+Enlightened+Bullshit+%28Rev+5%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"098d9f27845ec6521f9faec78fba1b7493d14693","infoHashBuffer":{"type":"Buffer","data":[9,141,159,39,132,94,198,82,31,159,174,199,143,186,27,116,147,209,70,147]},"announce":[],"urlList":[]}}