{"title":"Pediatric Practice - Endocrinology, 1st Edition{BBS}","uid":6725148,"size":38803812,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09f66ef611469af2fb97f006b58761b5c0abe18e&amp;dn=Pediatric+Practice+-+Endocrinology%2C+1st+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317915910,"description":"Complete how-to-guidance on the evaluation and treatment of endocrine disorders in children\n\n&quot;Edited and written by eminent pediatric endocrinologists, this is at present the best book for fellows in training and pediatricians in practice. It comprises in 11 chapters a concise treatise of pediatric endocrine diseases, well written, easy readable, helped by titles and headings in color. Highly illustrated in color and with up-to-date references, it is highly recommended.&quot;--Pediatric Endocrinology Reviews\n\n4 STAR DOODY'S REVIEW!\n&quot;This is a truly useful book for all physicians who care for young patients with endocrine disorders....In creating a how-to guide while breaking down the molecular mechanisms of endocrine diseases, it fills a gap in currently available pediatric endocrinology literature....This excellent book makes it possible for busy first-year endocrinology fellows to gain a broad understanding of the pertinent topics in this field.&quot;--Doody's Review Service\n\nPediatric Practice: Endocrinology is an outstanding clinical analysis and decision-making tool for those treating endocrine problems in children. Featuring an innovative problem-oriented approach, this well-illustrated, full-color guide skillfully integrates pathophysiology with clinical management. Numerous figures illustrate the principles of normal and abnormal physiology and treatment rationale and effects.\n\nNo other resource offers this concise yet comprehensive review of current knowledge, links these concepts with analysis of clinical situations, and provides such practical recommendations for rational and efficient evaluation and treatment of children with endocrine disorders.\n\nPediatric Practice: Endocrinology opens with an introductory chapter that clarifies the link between genetics, cell biology, and physiology with pathophysiology to provide a clear overview of the endocrine system. Subsequent chapters cover disorders of growth, water metabolism, thyroid and adrenal glands, bone and mineral metabolism, puberty, sex development, obesity, diabetes, and hypoglycemia. Throughout the book emphasis is placed on care of the patient, with the goal of optimizing care and improving the medical management and outcomes for these patients. More than 300 full-color images, figures, and tables enhance the presentation.\n\nFeatures of the Pediatric Practice Series:\n\n    * Tips that tell you what you must know--and what you must do--at every stage of care\n    * Diagnostic and treatment algorithms\n    * &quot;When to Refer&quot; boxes examine all the relevant clinical considerations\n    * Diagnostic Tests--with a realistic emphasis on the right tests to order\n    * Medical Treatment coverage that includes drugs, dosages, and administration in an easy-to-read tabular format\n    * Convenient icons and a consistent chapter design\n    * Numerous clinical color photos and didactic diagrams\n\nAbout the Author\n\nMichael S. Kappy, MD, PhD, Professor of Pediatrics, Section Head, Endocrinology, University of Colorado Health Sciences Center, Division of Endocrinology, The Children's Hospital, Denver, Denver CO.\n\nDavid B. Allen, MD, Professor of Pediatrics, University of Wisconsin School of Medicine and Public Health, Head of Endocrinology, Director of Endocrinology and Diabetes Fellowship Training Program, UW American Family Children's Hospital, Madison, WI.\n\nMitchell E. Geffner, MD, Professor of Pediatrics and Director of Fellowship Training, Division of Endocrinology, Diabetes, and Metabolism; Keck School of Medicine, University of Southern California, Division of Endocrinology and Metabolism, Children's Hospital Los Angeles, Los Angeles, CA.\nProduct Details\n\n    * Hardcover: 432 pages\n    * Publisher: McGraw-Hill Professional; 1 edition (October 9, 2009)\n    * Language: English\n    * ISBN-10: 0071605916\n    * ISBN-13: 978-0071605915","torrent":{"xt":"urn:btih:09f66ef611469af2fb97f006b58761b5c0abe18e","amp;dn":"Pediatric+Practice+-+Endocrinology%2C+1st+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09f66ef611469af2fb97f006b58761b5c0abe18e","infoHashBuffer":{"type":"Buffer","data":[9,246,110,246,17,70,154,242,251,151,240,6,181,135,97,181,192,171,225,142]},"announce":[],"urlList":[]}}