{"title":"Cytus v9.0.0 (Unlocked) apk + data","uid":12961301,"size":1018161938,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:09ff294464adfab614ac6a2a02bcf4bac0d59618&amp;dn=Cytus+v9.0.0+%28Unlocked%29+apk+%2B+data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":2,"time":1449852417,"description":"â–â–Welcome to the Musical World of Cytus v9.0.0 (Unlocked)â–â–\r\n\r\nâ–FEATURESâ–\r\n- 200 songs and 400 variations, including many from famous composers around the world\r\n- Beautiful hand-drawn art style (as illustrated in the screenshots)\r\n- Easy, intuitive Active Scan Line system and 3 types of notes\r\n- Different display modes allow player-friendly previewing of notes\r\n- Strong beat and rhythms provide satisfying feedback for taps\r\n- More than 9 difficulty levels for more fun and challenges\r\n- Various music genres: POP, JAZZ, TRANCE, HARDCORE, DRUM 'N BASS and many more\r\n- Connect toand show off your Cytus skills\r\n\r\nâ–HOW TO PLAYâ–\r\n- Follow along the Active Scan Line\r\n- Tap each note as the line passes through\r\n- Time your taps as the line is at the center of the note for a higher score!\r\n\r\nâ–STORYâ–\r\nIn the distant future, the only sentient beings in the world are robots. They are the last remnant of the human spirit. However, mankind is not dead. Technology exists that is capable of transferring memories to these robots. But with limited space, new memories will gradually overwrite the old.\r\n\r\nTo prevent the emotions in human memories from fading away, the robots resorted to converting the emotions to music, and storing them in a place called Cytus. The robots use these songs to experience human emotion and dream that souls exists in each of them... \r\n\r\nâ–WHAT'S NEWâ–\r\n-Chapter L\r\nStory written from ã€ŠLã€‹ by Ice, rearranged and recorded by gaQdan (also written music for Implosion), Chapter L provides you a whole new page in the music game history, with 10 narrative orchestral pieces.\r\n-Chapter Deemo\r\n10 selected pieces from Deemo, giving you a completely different but exciting gaming experience.\r\n-Kamcord recording function is removed from Cytus as the service update has permanently suspended.\r\n\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play.\r\nRequirements: Android  2.3+","torrent":{"xt":"urn:btih:09ff294464adfab614ac6a2a02bcf4bac0d59618","amp;dn":"Cytus+v9.0.0+%28Unlocked%29+apk+%2B+data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09ff294464adfab614ac6a2a02bcf4bac0d59618","infoHashBuffer":{"type":"Buffer","data":[9,255,41,68,100,173,250,182,20,172,106,42,2,188,244,186,192,213,150,24]},"announce":[],"urlList":[]}}