{"title":"Practical Statecharts in C/C++: Quantum Programming for Embedded","uid":4723989,"size":2448825,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b49b2269d2ce42009e4ee89390fff1928c8fbfb&amp;dn=Practical+Statecharts+in+C%2FC%2B%2B%3A+Quantum+Programming+for+Embedded&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VasiaZozulia","files":1,"time":1234649377,"description":"* Model reactive systems with UML statecharts\n* Efficiently code statecharts directly in C/C++\n* Rapidly build embedded software with statechart-based frameworks\nModel your reactive systems without heavyweight, expensive CASE tools. The author's Quantum Programming is a new paradigm that treats statecharts as a way of design rather than the use of a particular tool. It includes a complete software infrastructure for executing statecharts tailored for multithreaded embedded applications. Flexible, efficient, portable, scalable, and maintainable, this lightweight Quantum Framework permits you to quickly hand-code working real-time systems in C or C++ directly from UML statecharts.\nThe Quantum Framework is a complete implementation environment - an active-object framework carefully designed to work with nearly any RTOS. It supports rapid prototyping, easy modification of states and transitions at any stage of development, and the choice of implementation language (C or C++) to match the resource constraints of the target system. Best of all, it is compact, with complete QF code typically requiring less than 5KB of code and data.\nIn Part I of this book, you get a clear, articulate description of the relevant concepts including traditional finite state machines, statecharts, and several statechart-based design patterns in the form of executable code examples. Learn how state nesting leads to behavioral inheritance and how it enables reuse through programming-by-difference. Part II fully describes the implementation of the Quantum Framework and explains how you can use it in your applications and port it to an RTOS of your choice.","torrent":{"xt":"urn:btih:0b49b2269d2ce42009e4ee89390fff1928c8fbfb","amp;dn":"Practical+Statecharts+in+C%2FC%2B%2B%3A+Quantum+Programming+for+Embedded","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b49b2269d2ce42009e4ee89390fff1928c8fbfb","infoHashBuffer":{"type":"Buffer","data":[11,73,178,38,157,44,228,32,9,228,238,137,57,15,255,25,40,200,251,251]},"announce":[],"urlList":[]}}