{"title":"Challenge Of The Unknown {1950 One-Shot - Golden Age}","uid":9899033,"size":12337615,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:0baaab4638d90a076737e5b49195800ee190fd9a&amp;dn=Challenge+Of+The+Unknown+%7B1950+One-Shot+-+Golden+Age%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nasty_llama","files":-1,"time":1396744655,"description":"Issue from September 1950, put out by Ace Magazines.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Ace_Magazines&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Ace_Magazines&lt;/a&gt;\n\n\nHigh Priestess of the Snake People: Michael Corning is in a tobacco shop run by a very old woman. Her daughter is young and beautiful, of course, and convinces the guy to go to the woman's hometown. The daughter basically controls his mind. She's part of a group of snake worshipers that changes people into snappers. He gets bit but an old man helps him deal with the snake people. True Tales of the Supernatural: A guy marries a woman. His family has a legend of hearing drums when someone in the family dies. He hears the drums in London and finds out his wife died in Scotland. \n\nThe Ghost in the Portrait: A story about a guy who tells another not to open a trunk in the house and, of course, he does, finding a portrait that is evil. A ghost from the portrait is of a man that killed his wife. The ghost disturbs the graves of the twelve people who condemned him to be hung. The ghost wants the young man to kill his wife. \n\nTrue Tales of the Supernatural: A story about a jail cell in New Orleans where a number of people had hung themselves. The ghost of a woman who had died in the cell was causing the people in the cell to kill themselves. \n\nVilla of the Vampire: Two women buy a villa and are warned that a vampire is there and takes victims every so many years. The mother is greedy and falls victim to the vampire. The evil influence of the mother causes the daughter to reject her husband, yet he saves her from the same vampire. \n\nUnburied Dead: (text story) A gruesome story about hypnotism gone very, very bad. No Grave to Hold Him: An interesting story about a major scientist who dies and his brain ends up in the body of a thug that had been killed, and then what happens afterward.","torrent":{"xt":"urn:btih:0baaab4638d90a076737e5b49195800ee190fd9a","amp;dn":"Challenge+Of+The+Unknown+%7B1950+One-Shot+-+Golden+Age%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0baaab4638d90a076737e5b49195800ee190fd9a","infoHashBuffer":{"type":"Buffer","data":[11,170,171,70,56,217,10,7,103,55,229,180,145,149,128,14,225,144,253,154]},"announce":[],"urlList":[]}}