{"title":"Artificial Defense v1.0.2.0","uid":15447579,"size":144385320,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0c1b13d066b18e23906cddc5d34c078be9f05549&amp;dn=Artificial+Defense+v1.0.2.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1469907319,"description":"Firing off miniguns, launching Hellfire missiles, dropping incinerating Hades-Bombs and colossal asteroids, deploying mighty railgun and acid towers and spawning your own Intrusion Counter Measures (ICMs) to reconquer corrupted databases and firewalls are just some of the actions you can take while fending off the creeps. Earn RAM and upgrade your arsenal and hardware-level. Start as an analog punch-tape system and evolve into a quantum A.I. mainframe.\r\nOffense - Orbital Shooter\r\nThere are 21 offensive weapons available, reaching from outdated flintlocks, over maverick-missiles to devastating meteors and neutron-bombs. You can switch between three pre-loaded weapon categories and launch the installed weapons every few seconds. Each round you fire costs you RAM and each weapon type has its own unique cooldown so you must choose wisely and adapt quickly to different situations. But beware, aiming requires some skill. Creeps are moving targets and your projectiles need some flight time before impact. You can unlock and install new weapons in the uplab.[/b]\r\nDefense - Tower Defense\r\nThere are 21 defense towers available, reaching from pistol-sentry-towers, over incinerating flame-throwers to powerful long-range railgun towers. In addition there are 7 production towers which produce your main resource: RAM (Random Access Memory). Yes, building up a small RAM economy is very important, in order to keep your system routines running. Towers must be deployed by an expensive capsule drop and you have to find the sweet spot between the right amount of resource production towers and the performance of your defense perimeter. You can unlock and install new tower versions in the uplab.\r\nConquer - Real Time Strategy\r\nSpawn Intrusion Counter Measures (ICMs) in order to conquer corrupted system-structures like databases, honeypots and firewalls. Databases e.g. spawn datablips, which carry valuable data and head for your backup-devices. Every datablip successfully arriving at its destination releases a certain amount of RAM, so you should do your best to protect those important but vulnerable convoys","torrent":{"xt":"urn:btih:0c1b13d066b18e23906cddc5d34c078be9f05549","amp;dn":"Artificial+Defense+v1.0.2.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c1b13d066b18e23906cddc5d34c078be9f05549","infoHashBuffer":{"type":"Buffer","data":[12,27,19,208,102,177,142,35,144,108,221,197,211,76,7,139,233,240,85,73]},"announce":[],"urlList":[]}}