{"title":"Akira (1988) p, eng.","uid":14347794,"size":22688334959,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0d0817d8df8028521d55c3cc0aa0cb56c37326c2&amp;dn=Akira+%281988%29+p%2C+eng.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"l2e6","files":1,"time":1460998314,"description":"Akira is a 1988 Japanese animated science fiction action film directed by Katsuhiro Otomo. It was written by Otomo and Izo Hashimoto and based on Otomo's manga of the same name, focusing mainly on the first half of the story. The film depicts a dystopian version of Tokyo in the year 2019, with cyberpunk tones. The plot focuses on teenage biker Tetsuo Shima and his psychic powers, and the leader of his biker gang, Shotaro Kaneda. Several parties, including Kaneda, resistance terrorist Kei, Colonel Shikishima of the JSDF and a trio of espers, attempt to prevent Tetsuo from releasing the imprisoned psychic Akira. While most of the character designs and settings were adapted from the original manga, the restructured plot of the movie differs considerably from the print version, pruning much of the last half of the manga.\r\n\r\nThe film has garnered a large following as a cult film since its theatrical release, and is widely considered to be a landmark in Japanese animation. It is considered by many critics to be one of the greatest animated and science fiction movies of all time","torrent":{"xt":"urn:btih:0d0817d8df8028521d55c3cc0aa0cb56c37326c2","amp;dn":"Akira+%281988%29+p%2C+eng.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d0817d8df8028521d55c3cc0aa0cb56c37326c2","infoHashBuffer":{"type":"Buffer","data":[13,8,23,216,223,128,40,82,29,85,195,204,10,160,203,86,195,115,38,194]},"announce":[],"urlList":[]}}