{"title":"David Wilcox...Reverie(2010)[FLAC]","uid":6871063,"size":249310448,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0d4f1013dc8f55e73e84cb7febad0a02d6c2c9ab&amp;dn=David+Wilcox...Reverie%282010%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":19,"time":1323276657,"description":"[img]http://ecx.images-amazon.com/images/I/51GTgjQNUDL._SL500_AA300_.jpg[/img]\n[color=Green]Reverie [2010]What Are Records? / 60107[/color]\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1\t End of the World (Again)\t 2:23\n2\t Shark Man\t 3:03\n3\t Cast Off\t 2:56\n4\t Dynamite in the Distance\t 4:23\n5\t One Way to Find Out\t 3:58\n6\t Little Fish\t 2:40\n7\t Ireland\t 4:25\n8\t Reverie\t 2:03\n9\t Buster\t 2:54\n10\t Stones of Jerusalem\t 3:14\n11\t Piece of Me\t 2:22\n12\t We Call It Freedom\t 3:07\n13\t Let the Wave Say\t 2:44\n14\t Angeline\t 4:51\n\nWilcox has been making records and touring for a long, long time. This is his 17th solo album, and all the qualities that make him a cult favorite are on display here: hushed, intimate vocals, subtle but impressive guitar work in a solid folk/blues/pop mode, and songs full of telling details presented with masterful wordplay that never calls attention to itself. Why he hasn't got a higher profile is one of those unfathomable mysteries of the music business in the early 21st century. He sounds a bit like James Taylor, but the lyrics are deeper and his persona is more serious. Although it's a collection of new songs, Reverie was cut live, a risky proposition, but the audience is attentive and if there were any moments of wild applause, they've been edited out so nothing comes between you and Wilcox's music. Like 2008's Airstream, this album is just Wilcox and his acoustic guitar, but with songs as strong as these, he doesn't need anything else to make a lasting impact. As usual, he moves easily between melancholy musings on love and loss, and tunes full of acidic humor like &quot;Little Fish,&quot; which examines the mindset of a driver in a car adorned with that familiar Christian silver fish decal. He captures the smug superiority of a certain segment of the population with unerring accuracy, but he deals with the problems of religion more seriously on &quot;Stone of Jerusalem,&quot; a history of the holy city that references all the struggles that have taken place over that small tract of land led by Crusaders, Muslims, Greeks, Persians, and Kurds. &quot;Ireland&quot; is a beautiful tribute to singers and songwriters, featuring his chiming guitar and a poignant, heartfelt lyric. The love songs here span the polar opposites of the heart. &quot;Shark Man&quot; is a creepy portrait of a guy who gets off on hurting the women he loves, while &quot;One Way to Find Out&quot; likens romance to a bridge over a bottomless chasm. It's exhilarating and dangerous to make the crossing, but the reward on the other side makes the risk worthwhile.\n\ncd ripped by EAC\n\nplease seed\n\n[url]http://dickthespic.org/2011/12/07/david-wilcox/[/url]","torrent":{"xt":"urn:btih:0d4f1013dc8f55e73e84cb7febad0a02d6c2c9ab","amp;dn":"David+Wilcox...Reverie%282010%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d4f1013dc8f55e73e84cb7febad0a02d6c2c9ab","infoHashBuffer":{"type":"Buffer","data":[13,79,16,19,220,143,85,231,62,132,203,127,235,173,10,2,214,194,201,171]},"announce":[],"urlList":[]}}