{"title":"Taner Edis - An Illusion of Harmony [Science/Islam] (mobi, pub)","uid":6955284,"size":4934761,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0d947c9b4953357e0e81e9d405587ed14ecb2a6c&amp;dn=Taner+Edis+-+An+Illusion+of+Harmony+%5BScience%2FIslam%5D+%28mobi%2C+pub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":2,"time":1326555768,"description":"An Illusion of Harmony: Science and Religion in Islam\n\nCurrent discussions in the West on the relation of science and religion focus mainly on science's uneasy relationship with the traditional Judeo-Christian view of life. But a parallel controversy exists in the Muslim world regarding ways to integrate science with Islam. As physicist Taner Edis shows in this fascinating glimpse into contemporary Muslim culture, a good deal of popular writing in Muslim societies attempts to address such perplexing questions as: Is Islam a &quot;scientific religion&quot;? Were the discoveries of modern science foreshadowed in the Quran? Are intelligent design conjectures more appealing to the Muslim perspective than Darwinian explanations? Edis examines the range of Muslim thinking about science and Islam, from blatantly pseudoscientific fantasies to comparatively sophisticated efforts to &quot;Islamize science.&quot; From the world's strongest creationist movements to bizarre science-in-the-Quran apologetics, popular Muslim approaches promote a view of natural science as a mere fact-collecting activity that coexists in near-perfect harmony with literal-minded faith. Since Muslims are keenly aware that science and technology have been the keys to Western success, they are eager to harness technology to achieve a Muslim version of modernity. Yet at the same time, they are reluctant to allow science to become independent of religion and are suspicious of Western secularisation. Edis examines all of these conflicting trends, revealing the difficulties facing Muslim societies trying to adapt to the modern technological world. His discussions of both the parallels and the differences between Western and Muslim attempts to harmonise science and religion make for a unique and intriguing contribution to this continuing debate.\n\nAuthor: Taner Edis\nPublisher: Prometheus Books\nPublication Date: February 27, 2007\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:0d947c9b4953357e0e81e9d405587ed14ecb2a6c","amp;dn":"Taner+Edis+-+An+Illusion+of+Harmony+%5BScience%2FIslam%5D+%28mobi%2C+pub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d947c9b4953357e0e81e9d405587ed14ecb2a6c","infoHashBuffer":{"type":"Buffer","data":[13,148,124,155,73,83,53,126,14,129,233,212,5,88,126,209,78,203,42,108]},"announce":[],"urlList":[]}}