{"title":"The Simpsons - Season 7 Complete [DVDRIP VP7 KEGGERMAN]","uid":3835927,"size":4758061989,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0d9858372656e9b3431f43c070fee54ba190ae14&amp;dn=The+Simpsons+-+Season+7+Complete+%5BDVDRIP+VP7+KEGGERMAN%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KEGGERMAN","files":29,"time":1191968849,"description":"SHOW........[ The Simpsons - Season 7 ]\nRIPPER......[ KEGGERMAN ]\nAUDIO.......[ MP3 48000Hz 128kb/s CBR (2 Channel) ]\nLANGUAGE....[ English ]\nCODEC.......[ VP7 ]\nRESOLUTION..[ 576 x 384 ]\nFRAME RATE..[ 23.976 FPS ]\nSUB TITLES..[ NONE ]\nSOURCE......[ NTSC DVD ]\nEPISODES....[ 26 ]\n\n\nNOTES.......[ VP7 CODEC CAN BE DOWNLOADED HERE: ]\n             &lt;a href=&quot; http://www.on2.com/cms-data/downloads/on2_vp7_personal_edition.exe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.on2.com/cms-data/downloads/on2_vp7_personal_edition.exe&lt;/a&gt;\nPLEASE VISIT[ 66Trader.com ]\n \n\n\n\nSPECIAL 0\nTITLE.......[ Springfield&amp;#039;s Most Wanted ]\nRUNTIME.....[ 21:13 ]\nFIRST AIRED.[ 9/17/95 ]\nDATA RATE...[ 140 kbps ]\nDESCRIPTION.[ This special was aired before the premier of the 7th season opener;\nhosted by John Walsh (from the FOX series &quot;Americas Most Wanted&quot;) it offered up\nall sorts of theories and insights into who might have shot Montgomery Burns. ]\n\n\n\nEPISODE 1\nTITLE.......[ Who Shot Mr. Burns? (Part Two) ]\nRUNTIME.....[ 23:21 ]\nFIRST AIRED.[ 9/17/95 ]\nDATA RATE...[ 127 kbps ]\nDESCRIPTION.[ In the conclusion of the cliff-hanger which ended season six, \neveryone learns the identity of Mr. Burns&amp;#039; mysterious assailant. The culprit \nturns out to be the sweetest little suspect of all. ]\n\n\n\nEPISODE 2\nTITLE.......[ Radioactive Man ]\nRUNTIME.....[ 22:52 ]\nFIRST AIRED.[ 9/24/95 ]\nDATA RATE...[ 128 kbps ]\nDESCRIPTION.[ A movie based on comic book character Radioactive Man is filmed in\nSpringfield. Much to Bart&amp;#039;s chagrin, the coveted part of the hero&amp;#039;s sidekick, \nFallout Boy, goes to not him, but to Milhouse. ]\n\n\n\nEPISODE 3\nTITLE.......[ Home Sweet Homediddly-Dum-Doodily ]\nRUNTIME.....[ 22:52 ]\nFIRST AIRED.[ 10/1/95 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ After a series of misadventures, the Simpson children are put in \nthe custody of Ned and Maude Flanders. Learning that none of the children have\nbeen baptized, Ned sets up a baptism - which Homer and Marge thwart just in \ntime. ]\n\n\n\nEPISODE 4\nTITLE.......[ Bart Sells His Soul ]\nRUNTIME.....[ 22:47 ]\nFIRST AIRED.[ 10/8/95 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ After perpetrating a prank on the First Church of Springfield, \nBart sells his soul to Milhouse for five dollars. Bart comes to regret his \ndecision, and goes on a desperate quest to regain his soul. In the end, he gets \nit back with the help of an unexpected source. ]\n\n\n\nEPISODE 5\nTITLE.......[ Lisa the Vegetarian ]\nRUNTIME.....[ 22:52 ]\nFIRST AIRED.[ 10/15/95 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ After a trip to a petting zoo, Lisa is unable to eat lamb. This \nexposes her to ridicule and resentment from her father and friends. But with \nhelp from Apu, Paul McCartney, and Linda McCartney, she stays true to her new \npath of vegetarianism. ]\n\n\n\nEPISODE 6\nTITLE.......[ Treehouse of Horror VI ]\nRUNTIME.....[ 22:49 ]\nFIRST AIRED.[ 10/29/95 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ ATTACK OF THE 50 FOOT EYESORES: Strange atmospheric conditions \nbring giant advertising statues to life. The Lard Lad is furious at Homer for \ntaking his doughnut, so he, along with all the others, begin destroying the town \nof Springfield. \nNIGHTMARE ON EVERGREEN TERRACE: Willy&amp;#039;s death, due to disinterested parents, \ncauses him to come back into the dreams of their children, where he kills them, \nresulting in their deaths in reality. \nHOMER3: Homer finds a strange area in the house behind the bookcase. When he \nsteps through, Homer becomes trapped in a three-dimensional universe. ]\n\n\n\nEPISODE 7\nTITLE.......[ King-Size Homer ]\nRUNTIME.....[ 22:51 ]\nFIRST AIRED.[ 11/5/95 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ Homer tries everything to get out of the plant&amp;#039;s new exercise \nprogram and discovers that being on disability would do just that. With Bart&amp;#039;s \nhelp, Homer starts eating everything he can, even playdough. ]\n\n\n\nEPISODE 8\nTITLE.......[ Mother Simpson ]\nRUNTIME.....[ 22:50 ]\nFIRST AIRED.[ 11/19/95 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ Homer buys a dummy and fakes his death to get out of work. Since \nhe has died, the power company turns off the power to his home. When Homer goes\nto get it turned on again he discovers that his mother is still alive. He brings\nher home to meet his family and he discovers why he has not seen her for 27 \nyears. She is a former hippie on the run from the law. Her old nemesis, Mr. \nBurns, spots her at the post office and tells the cops from Dragnet. They look \nfor her, but she escapes again and has a tear-filled goodbye with Homer before \nshe leaves for good. ]\n\n\n\nEPISODE 9\nTITLE.......[ Sideshow Bob&amp;#039;s Last Gleaming ]\nRUNTIME.....[ 22:50 ]\nFIRST AIRED.[ 11/26/95 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ Sideshow Bob hates television. As a prisoner, his fellow convicts\n(including Rupert Murdoch) watch it constantly. When Vanessa Redgrave gets her \nown tasteless sitcom on FOX, it is the last straw. He escapes custody, steals a\nbomb, and hides out in a blimp. When he threatens to detonate a bomb, the town\ngives in to his only demand and ceases production of all television shows. The\nSimpsons just happen to be at the airshow, close to the blimp. The airshow \nevacuates, but Bart and Lisa stay in the military base. They find Sideshow Bob\nand tip off the cops as to his whereabouts. Krusty manages to get back on \ntelevision by broadcasting from a shack, and Sideshow Bob detonates the bomb. \nThe bomb is a dud. He escapes in the Wright brothers plane with Bart as his \nhostage, heading toward Krusty&amp;#039;s shack on a kamikaze mission. Fortunately \ntelevision is saved when this plan fails. ]\n\n\n\nEPISODE 10\nTITLE.......[ The Simpsons 138th Episode Spectacular ]\nRUNTIME.....[ 22:50 ]\nFIRST AIRED.[ 12/3/95 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ The show opens with a montage of openings. Then Troy McClure \nanswers viewer mail while hosting a show that features vintage clips from The \nTracey Ullman Show, some outtakes and highlights from some of the previous 137\nepisodes. The show then closes with a montage of &quot;hardcore nudity.&quot; ]\n\n\n\nEPISODE 11\nTITLE.......[ Marge Be Not Proud ]\nRUNTIME.....[ 22:52 ]\nFIRST AIRED.[ 12/17/95 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ Bart sees a commercial for a new but violent video game. Marge does\nnot want to get it for him because he is too young. Bart tries to rent it and \ntries to play it at Milhouse&amp;#039;s. He goes to the store and tries to steal a copy\nof it. The security guard catches him. He leaves a message on the Simpsons&amp;#039; \nanswering machine, in which he mentions that Bart is banned from the store for\nlife. Back at home, Bart manages to gets rid of the message. Marge wants the \nfamily to go to that store to have a family portrait taken; only Bart sees the\njeopardy in his returning to the store. The security guard spots him and he tells\nHomer and Marge that Bart is a shoplifter. Bart ruins yet another family picture.\nLater Homer yells at him, but Marge just refuses to talk to him. She thinks it \nis her fault for mothering him too much. Missing his own mother, Bart tries to \nhang around with Milhouse&amp;#039;s mom. He decides to return to the store and have a \npicture taken of himself. He gives it to Marge and she is ecstatic. She lets him\nopen his present early, a golf video game. The end credits show Bart playing his\nnew game. ]\n\n\n\nEPISODE 12\nTITLE.......[ Team Homer ]\nRUNTIME.....[ 23:36 ]\nFIRST AIRED.[ 1/7/96 ]\nDATA RATE...[ 124 kbps ]\nDESCRIPTION.[ Bart gets a T-shirt iron-on in &quot;Mad&quot; magazine that says &quot;down with\nhomework.&quot; Homer goes bowling with Moe and meets up with Apu. They, along with \nOtto, decide to start a bowling team when they can&amp;#039;t get a lane on league night.\nThey need $500 to get started, so Homer tricks Mr. Burns into giving him the \nmoney and he forms the &quot;Pin Pals.&quot; Bart gets in trouble with his new T-shirt, so\nthe students have to start wearing uniforms. The &quot;Pin Pals&quot; start to climb the \nleague rankings and Mr. Burns realizes that Homer has tricked him. He goes to \nconfront the &quot;Pin Pals&quot;, but when Mr. Burns sees how good they are, he decides\nto join the team. Homer lets him join and gives Otto the boot. Back at \nSpringfield Elementary the uniformed kids at the school begin losing their \nindividuality and creativity. When it starts raining, their uniforms change \ncolor and bring a surge of rebellion. Mr. Burns is a horrible bowler, so the \n&quot;Pin Pals&quot; begin losing games. When the championship game arrives, they manage\nto win the trophy, which Mr. Burns takes home with him. ]\n\n\n\nEPISODE 13\nTITLE.......[ Two Bad Neighbors ]\nRUNTIME.....[ 22:50 ]\nFIRST AIRED.[ 1/14/96 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ The Simpsons have a garage sale one boring weekend and here we \nfirst meet Disco Stu. Right when the sale gets moving, George Bush upstages Homer\nby moving in across the street. Homer starts holding a grudge against Bush; \nmeanwhile, Bart takes on the role of &quot;Dennis the Menace&quot; to George Bush&amp;#039;s &quot;Mr.\nWilson&quot;. After George gives Bart the spanking he deserves, Homer starts a prank\nwar, which escalates into a one-on-one confrontation. This results in the Bushes\nleaving and Gerald Ford moving in, becoming Homer&amp;#039;s good friend. ]\n\n\n\nEPISODE 14\nTITLE.......[ Scenes From the Class Struggle in Springfield ]\nRUNTIME.....[ 22:51 ]\nFIRST AIRED.[ 2/4/96 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ Marge gets an expensive &quot;new&quot; dress at the outlet mall. While \nwearing it she meets a former schoolmate who invites her and the family to the \ncountry club. Marge becomes obsessed with trying to fit in. Homer takes up golf\nat the club and Mr. Burns challenges him to a game. After Homer catches him \ncheating, Mr. Burns agrees to help Homer&amp;#039;s family become members of the country \nclub if he doesn&amp;#039;t tell anyone. In the end, Marge decides she doesn&amp;#039;t want to \nbecome a member after all. ]\n\n\n\nEPISODE 15\nTITLE.......[ Bart the Fink ]\nRUNTIME.....[ 22:51 ]\nFIRST AIRED.[ 2/11/96 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ The Simpsons each inherit $100 and Bart gets his own checkbook. He\ngets the idea on how he can get Krusty&amp;#039;s autograph by using an endorsed check. \nThe endorsement is an offshore holding corporation, so Bart goes to the bank. \nThe banker calls up the IRS and they discover that that Krusty has been doing a\nlot of tax-cheating. The IRS gets Krusty to pay them 90% of his salary, so he \nhas to make cutbacks on the show. The IRS auctions off all of Krusty&amp;#039;s \npossessions and they even get Krusty Burger. Bart begins feeling really guilty.\nThe town notices a plane flying around one night; the pilot is Krusty, who is \nflying it very recklessly. He crashes and Chief Wiggum declares him dead. The \nSimpson family goes to the funeral, where Bob Newhart speaks on Krusty&amp;#039;s behalf.\nBart is heartbroken and he keeps thinking that he sees Krusty in public. Bart and\nLisa try to find him down at the marina. When they do, Krusty reveals that he \nhas faked his death and he is now living as Rory Bellows. They talk him into \ncoming back, so he fakes his death as Rory Bellows, gets a large insurance \nsettlement and returns. ]\n\n\n\nEPISODE 16\nTITLE.......[ Lisa the Iconoclast ]\nRUNTIME.....[ 22:51 ]\nFIRST AIRED.[ 2/18/96 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ Bart watches a film on town hero, Jebediah Springfield. As the \ntown&amp;#039;s bicentennial parade approaches, Homer wants to be the town crier and he \nsoon wins the job. Lisa visits a museum full of Jebediah memorabilia, and meets\nthe curator, Hollis Hurlbutt. She finds a secret confession by Jebediah in a \nflute. The confession reveals that he was a murderous pirate and a fraud, with a\nsilver tongue. Lisa sets out to expose him and while Marge does not believe her,\nHomer does. He helps her tell the town, but no one believes her except him. The\ntown&amp;#039;s Jubilation Committee brings them in for disciplinary action. When she \npleads with them, they agree to dig up his grave and look for the tongue. The \ntongue is not there, so they strip Homer of his bell and hat. Lisa refuses to \ngive up after a dream and she finds out that Hollis Hurlbutt has the tongue. He\nand Lisa stop the parade to tell everyone about their false hero. Lisa chickens\nout and tells everyone that he was a great man. So Homer is able to resume his\nrole as town crier. ]\n\n\n\nEPISODE 17\nTITLE.......[ Homer the Smithers ]\nRUNTIME.....[ 22:50 ]\nFIRST AIRED.[ 2/25/96 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ Mr. Burns takes the plant to an auto racing track and Smithers \ncaters to his every need, but screws up just once. A drunken Lenny scares the \nhell out of Burns after the event and Smithers tries to make it up to him, but \nfails. Mr. Burns orders him to take a vacation and Smithers chooses Homer to \nreplace him, because Homer is so incompetent that it should make Smithers look\ngood. Homer tries his best, but Mr. Burns will not tolerate the typical Homer \nSimpson idiocy. Mr. Burns abuses Homer, so Homer hauls off and decks him. Homer\ntries to apologize, but Mr. Burns fears him so much that he does all the basic\njobs of Homer. Mr. Burns learns to do things for himself and enjoys it. When \nSmithers returns home, Mr. Burns fires him and Homer returns to his old job. \nSmithers cannot seem to find a job. Homer gives him a pep talk and formulates \na plan to get Smithers back his job. Homer screws it up, and Smithers gets into\na brawl with him. In the fray, Mr. Burns falls out his office window. Now in a\nfull-body cast, Smithers takes care of Mr. Burns him as before. For his efforts,\nHomer gets a fruit basket from the newly employed Smithers. ]\n\n\n\nEPISODE 18\nTITLE.......[ The Day the Violence Died ]\nRUNTIME.....[ 22:51 ]\nFIRST AIRED.[ 3/17/96 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ Bart and Lisa watch an &quot;Itchy and Scratchy&quot; marathon and the next \nday there is an &amp;#039;Itchy and Scratchy&amp;#039; parade. Homer and the kids stake out spots\non the sidewalk, but Bart gets away from them and meets up with a bum, Chester\nJ. Lampwick, who claims to have created Itchy. Bart believes him and they watch\nhis old film, but it burns up after the viewing, leaving no proof. Bart vows to\nget the bum the celebrity status that he deserves, so first Bart brings him home\nwith him. Then Bart and the bum go to Roger Myers and ask for all the money he\nis owed, $800,000,000. They are kicked out of the office and Homer and Marge \nagree to help them out by paying for a lawyer, Lionel Hutz. The case is not \ngoing well, so Bart gets a drawing from the comic book store to prove that the\nbum is the creator. The court finds in his favor due to plagiarism, so every \ncent &quot;Itchy and Scratchy&quot; makes now goes to the bum. Unfortunately because of\nthis ruling the &quot;Itchy and Scratchy&quot; studios have to close for good. Bart feels\nbadly about what he did, especially since now a stupid educational cartoon has\nreplaced it. Bart has to come up with a plan; after all, he and Lisa had done it\nso many times before. When they figure out how to do it, they discover that \nLester and Eliza have already solved the problem. It looks like Bart and Lisa\nhave a little competition. ]\n\n\n\nEPISODE 19\nTITLE.......[ A Fish Called Selma ]\nRUNTIME.....[ 22:51 ]\nFIRST AIRED.[ 3/24/96 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ Troy McClure takes Selma out on a date in return for passing his \neye test at the DMV. After the date he stops for a photo opportunity, the \nresulting publicity of being seen with a &quot;woman&quot; gives his career a much-needed\n&quot;shot in the arm.&quot; But living with Selma is too much for him, so they eventually\nget a divorce. After the divorce, Troy signs on to direct his very own film. ]\n\n\n\nEPISODE 20\nTITLE.......[ Bart on the Road ]\nRUNTIME.....[ 22:49 ]\nFIRST AIRED.[ 3/31/96 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ Skinner decides to promote a take-your-kids-to-work-day on the \nFriday before spring break. Bart goes to the DMV with Patty and Selma. Lisa goes\nto the power plant with Homer. Milhouse discovers the exciting world of crackers.\nMartin makes money in the stock market. At the DMV Bart makes himself a fake \ndriver&amp;#039;s license. He, Nelson, and Milhouse look for a way to use it, so they \ndecide to use Martin&amp;#039;s money to rent a car. The four of them tell their parents \nthat they are going to the National Grammar Rodeo. Instead they go out joyriding,\nbut where should they go? Finding an old brochure they decide to go to the \nWorld&amp;#039;s Fair in Knoxville, Tennessee. But first Nelson makes them stop in \nBranson, Missouri, where he can see his hero, Andy Williams. Back in Springfield,\nHomer asks if Lisa would like to come spend her spring break at work with him \nand she enjoys herself there; meanwhile, Marge becomes bored at home. Finding \nout that the World&amp;#039;s Fair was over years ago, Bart and company do not find \nKnoxville that exciting, especially when they wreck the car. They are stranded,\nbut they cannot tell their parents. Bart tells Lisa the truth, and she tells him\nto become a courier. He does and is able to go to Hong Kong free of charge with\nhis friends. Bart tells Lisa that she needs to have somebody ship something large\nto Springfield. Lisa tells Homer, who is very upset, but orders the plant a new\nnuclear console. Bart and company return home, and everyone knows about the trip\nexcept Marge. ]\n\n\n\nEPISODE 21\nTITLE.......[ 22 Short Films About Springfield ]\nRUNTIME.....[ 22:53 ]\nFIRST AIRED.[ 4/14/96 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ Small slices of life in Springfield are shown, such as: Bart carves\nsugar; Apu in &quot;The Jolly Bengali&quot;; Lisa with gum in her hair; Smithers and the \nbee sting; Dr. Nick saves the day; Moe gets robbed; &quot;Skinner and the \nSuperintendent&quot;; Homer, Maggie and the newspaper; McDonald&amp;#039;s Quarter Pounders \nvs. Krusty burgers; the Bee Man at home; Chief Wiggum, the hood and the \nstorekeeper; Reverend Lovejoy and his dog; Lisa and the gum (part 2); Cletus the\nSlack-Jawed Yokel; Milhouse has to use the bathroom; Chief Wiggum, the hood and\nthe storekeeper (part 2); Lisa and the gum (part 3); Nelson gets his comeuppance;\nBart and Milhouse find the truth; The Tomfoolery of Professor John Frink is \nalmost seen. ]\n\n\n\nEPISODE 22\nTITLE.......[ Raging Abe Simpson and his Grumbling Grandson in &quot;The Curse of the Flying Hellfish&quot; ]\nRUNTIME.....[ 22:52 ]\nFIRST AIRED.[ 4/28/96 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ Bart brings Abe to school in a special day for grandparents and he\nproceeds to embarrass Bart by lying. Abe gets a piece of mail saying that the \nseventh Hellfish is dead; this leaves only two of the Flying Hellfish left alive.\nWhen one is left, he will get to claim the legacy of art treasures they kept \nfrom the WWII. Who is the other Hellfish who hasn&amp;#039;t died? Why it&amp;#039;s Mr. Burns. \nAbe doesn&amp;#039;t trust Mr. Burns, who is scheming on how to steal the treasure. Mr.\nBurns hires a world-famous assassin to take care of Abe, but none of the attempts\nwork. When Abe goes to tell Homer and the family his tale, they do not believe \nhim. Abe stays in Bart&amp;#039;s room until the coast is clear. Abe tells Bart the story\nof the Hellfish, where he used to be ranked above Mr. Burns. Bart is highly \nskeptical. Mr. Burns comes in the night to steal Abe&amp;#039;s key. When Bart sees this,\nhe decides to help Abe stop Mr. Burns from taking the treasure. They take the \nFlanders&amp;#039; boat and go diving for it. After Bart brings it up onto the boat, Mr.\nBurns takes it from them and the he tries unsuccessfully to drown Bart. Abe and\nMr. Burns have a scuffle on the shore and Abe wins. Just as Abe gets set to take\nthe treasure, the authorities come to take the treasure back its rightful owner,\na rich German. ]\n\n      \n                 \nEPISODE 23\nTITLE.......[ Much Apu About Nothing ]\nRUNTIME.....[ 22:51 ]\nFIRST AIRED.[ 5/5/96 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ A bear &quot;terrorizes&quot; the neighborhood; the new bear patrol causes\ntaxes to be raised. Mayor Quimby decides to blame the immigrants, who will all\nbe deported, depending on the outcome of the proposition 24. Apu turns to Fat\nTony and then the Simpson family. Apu slowly wins the Simpsons&amp;#039; support. He \ndecides to take a citizenship test after Lisa discovers he qualifies. He is short\non time though, so Homer helps him cram like he has never crammed before. Homer \nfills his head with historical &quot;facts&quot; (remember that Homer is really stupid).\nThe vote on Prop 24 approaches. The town votes to deport all illegal \nimmigrants... except Apu, the Bee Guy, Dr. Nick, and Moe, who&amp;#039;ve all passed \ntheir citizenship tests. ]\n                       \n\n\nEPISODE 24\nTITLE.......[ Homerpalooza ]\nRUNTIME.....[ 22:56 ]\nFIRST AIRED.[ 5/19/96 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ Otto wrecks the school bus, so Homer organizes a car pool and \nbegins driving the neighborhood kids to school. He horrifies Bart and Lisa with\nhis choice of classic rock music, so he decides to try to get into the current\nmusic scene. He brings Bart and Lisa to a music festival that features Cypress\nHill, Peter Frampton, The Smashing Pumpkins and Sonic Youth. While there, Homer\ndiscovers a new talent. He can take a shot to the gut really well. The festival\nasks him to travel with them and continue getting hit by cannonballs. Naturally,\nhe agrees and becomes a hit. He looks forward to performing for Springfield, but\njust before they get there, he discovers that cannonballs have wreaked havoc on\nhis internal organs. The vet tells him to quit before he dies, but he refuses.\nAt the last moment, he chickens out and decides to retire from the freak \nbusiness. ]\n                       \n\n\nEPISODE 25\nTITLE.......[ Summer of 4 Ft. 2 ]\nRUNTIME.....[ 22:52 ]\nFIRST AIRED.[ 5/19/96 ]\nDATA RATE...[ 130 kbps ]\nDESCRIPTION.[ It is the last day of school and Lisa has no one to sign her \nyearbook; Bart on the other hand is quite popular. Flanders offers Homer his \nLittle Pwagmattasquarmsettport beach house for a few days, since he has jury \nduty and won&amp;#039;t be able to use it. Lisa worries about not having a friend to \nbring. Bart brings Milhouse, making Lisa feel depressed. Lisa decides not to \nbring any of her dorky things so that she can redefine her identity. She gets \nnew clothes and searches for kids with whom to play. She finds a bunch of local\nkids that seem to like her for whom she is. To make her feel even more special,\nthey reject Bart in favor of her, making Bart jealous. Meanwhile, Homer sets out\nto buy illegal fireworks. Lisa is acting exactly like Bart when she hangs out, \ninfuriating Bart and he decides to sabotage her friendships. He shows them a \nyearbook, revealing her as a nerd. She is humiliated and angry with him. He \nfeels bad, so he tries to win back her friends. Even though they&amp;#039;ve found out \nshe is a nerd, it turns out that they don&amp;#039;t mind and they all sign her yearbook.]\n\n                       \n","torrent":{"xt":"urn:btih:0d9858372656e9b3431f43c070fee54ba190ae14","amp;dn":"The+Simpsons+-+Season+7+Complete+%5BDVDRIP+VP7+KEGGERMAN%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d9858372656e9b3431f43c070fee54ba190ae14","infoHashBuffer":{"type":"Buffer","data":[13,152,88,55,38,86,233,179,67,31,67,192,112,254,229,75,161,144,174,20]},"announce":[],"urlList":[]}}