{"title":"DJ Fatal Presents Tupac - The Unheard, The Scrapped and The Remi","uid":10120723,"size":195059381,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0dbc7e330f8068602d4f067e6f44753c4104877f&amp;dn=DJ+Fatal+Presents+Tupac+-+The+Unheard%2C+The+Scrapped+and+The+Remi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LilProphet","files":-1,"time":1399670782,"description":"CD1 - The Remixes:\n01. DJ Fatal &amp; 2Pac - 1 Nation Intro\n02. 2Pac - Until The End Of Time (DJ Fatal Remix)\n03. 2Pac ft. Bone Thugs-n-Harmony - Thug Luv (DJ Fatal Remix)\n04. 2Pac - Fuck All Yall (DJ Fatal Remix)\n05. 2Pac ft. Nuttso - Ghetto Star (DJ Fatal Remix)\n06. Nuttso &amp; Lil' Big - Don't Sleep (DJ Fatal Remix)\n07. 2Pac ft. Kurupt and Daz Dillinger - Don't Go 2 Sleep (DJ Fatal Extended Female Remix)\n08. 2Pac ft. Patti Labelle - Can U Get Away (DJ Fatal Remix)\n09. 2Pac ft. Foster The People - Nothing To Lose (DJ Fatal Remix)\n10. 2Pac - Pain (DJ Fatal Remix)\n11. 2Pac ft. Sara Bareilles and Ingrid Michaelson - Hold On Be Strong (DJ Fatal Remix)\n12. 2Pac ft. Jodeci - Thug In Me (DJ Fatal Switch Up Remix)\n13. 2Pac - War Games (DJ Fatal Remix)\n14. 2Pac ft. Big L and The Notorious B.I.G. - Deadly Combination (DJ Fatal Remix)\n15. Royce Da 5'9 ft. 2Pac, The Notorious B.I.G. and Eminem - Airplanes (DJ Fatal Remix)\n16. 2Pac ft. Brian McKnight - Don't U Trust Me (DJ Fatal Remix) (From Jan '07 Remixes)\n17. Usher ft. Alicia Keys and 2Pac - My Boo (DJ Fatal Remix) (Mix From Alicia Keys Tape)\n18. 2Pac - Fuck All Yall (DJ Fatal Remix) (From Fall '08 Mixtape)\n19. Utada ft. Nas, 2Pac and Notorious B.I.G. - Exodus 04 (DJ Fatal Remix) (From Feb '05 Remixes)\n20. 2Pac ft. Kadafi - Who Do You Believe In (DJ Fatal Remix) (From Black Angel of Death)\n21. 2Pac - Thug 4 Life (DJ Fatal Remix) (Rise Of A Panther Bonus)\n\nCD2 - The Scrapped:\n01. 2Pac ft. Dave Hollister - Don't You Trust Me (DJ Fatal Remix)\n02. 2Pac ft. Nuttso and Outlawz - Don't Sleep (DJ Fatal Remix) (Alt. Scrapped Full Mix)\n03. 2Pac ft. Snoop Dogg &amp; Diana Ross - If There's A Cure (DJ Fatal Remix)\n04. 2Pac ft. Fugees - Happy Home (DJ Fatal Remix)\n05. 2Pac ft. Debra Laws - Can U Get Away (DJ Fatal Remix)\n06. 2Pac ft. Kurupt - One Day At A Time (DJ Fatal Remix)\n07. 2Pac ft. Nas and Tresa - Happy Home (DJ Fatal Remix) (Original First Take Scrapped Mix)\n08. 2Pac ft. Ne-Yo - So Sick (DJ Fatal Remix) (Short Alt. Scrapped Mix)\n\nCD3 - The Unheard:\n01. 2Pac ft. Left Eye - If You Really Want It (DJ Fatal Remix)\n02. 2Pac ft. Alicia Keys and Jon B - Are You Still Down (DJ Fatal Remix)\n03. 2Pac ft. Kurupt and Daz - Dont Go To Sleep (DJ Fatal Remix Alternate Version I)\n04. 2Pac ft. Outlawz and Tyrese - Worldwide (DJ Fatal Remix)\n05. 2Pac ft. Kurupt and Daz - Dont Go To Sleep (DJ Fatal Remix Alternate Version II)\n06. 2Pac ft. Nas - One Day (DJ Fatal Remix)\n07. 2Pac ft. Marques Houston - That Girl (DJ Fatal Remix)","torrent":{"xt":"urn:btih:0dbc7e330f8068602d4f067e6f44753c4104877f","amp;dn":"DJ+Fatal+Presents+Tupac+-+The+Unheard%2C+The+Scrapped+and+The+Remi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dbc7e330f8068602d4f067e6f44753c4104877f","infoHashBuffer":{"type":"Buffer","data":[13,188,126,51,15,128,104,96,45,79,6,126,111,68,117,60,65,4,135,127]},"announce":[],"urlList":[]}}