{"title":"Wer wenn nicht wir (If Not Us, Who)-DVDRip-Xvid-2011.avi","uid":7594774,"size":1237470366,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0e46cf4acd247e9c04361fbfad5c79f110acdd9a&amp;dn=Wer+wenn+nicht+wir+%28If+Not+Us%2C+Who%29-DVDRip-Xvid-2011.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"walkered","files":1,"time":1346656840,"description":"In the early 60s, Bernward Vesper and fellow university student Gudrun Ensslin begin a passionate love in the stifling atmosphere of provincial West Germany. Dedicated to the power of the written word, Bernward and Gudrun found a publishing house whose first publication is, paradoxically to many, a controversial past work of Bernward's ostracized father, an infamous Nazi author. Bernward defends his father's writing ability, even if he is haunted by his father's suspicious past. Gudrun, too, vehemently questions her own father's role during Hitler's Third Reich. Sensitive to the increasing restlessness of the times, the fiery couple lash out at the conformism and denial around them. After their tumultuous relationship nearly ends due to Bernward's infidelities, they start anew with a move to West Berlin in 1964. Joining forces with leftist writers and political activists, they become part of the spreading global uprising: &quot;If not us, who; If not now, when?&quot; But discontentment with the world takes its toll on their tumultuous relationship. By the late 60s, Gudrun has joined rebellious Andreas Baader's pro-violence cause and Bernward risks his sanity by using psychedelic drugs in his struggles to finally write the novel committed to changing the world... Based on the emotional true story of an explosive era. \n\nDVDRip-Xvid\n\nIMDb: tt1671496","torrent":{"xt":"urn:btih:0e46cf4acd247e9c04361fbfad5c79f110acdd9a","amp;dn":"Wer+wenn+nicht+wir+%28If+Not+Us%2C+Who%29-DVDRip-Xvid-2011.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e46cf4acd247e9c04361fbfad5c79f110acdd9a","infoHashBuffer":{"type":"Buffer","data":[14,70,207,74,205,36,126,156,4,54,31,191,173,92,121,241,16,172,221,154]},"announce":[],"urlList":[]}}