{"title":"Coast to Coast AM May 29, 2013 - Cases of Alien Abduction","uid":8545564,"size":56230392,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0ec8e4f479922bc0dad606f2d323c84fa38d6de4&amp;dn=Coast+to+Coast+AM+May+29%2C+2013+-+Cases+of+Alien+Abduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1370477106,"description":"MP3 version wins!\n\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\nDate:\n05-29-13\nHost:\nGeorge Noory\nGuests:\nKathleen  Marden,             Denise  Stoner,                   Larry  Conners\nDirector of abduction research for the Mutual UFO Network and niece of Betty Hill, Kathleen Marden and her co-author Denise Stoner, discussed various alien abduction cases and scenarios. Appearing by herself in the second hour, Marden shared inside details of the Betty and Barney abduction case which occurred in New Hampshire in 1961. After the encounter, the Hills experienced several hours of missing time, and had physical evidence that something had gone amiss. The dress that Betty wore had numerous tears in it, and eventually was found to be covered in a pink powdery substance that degraded the fabric of the dress, and reduced it to a rag, Marden recounted. The substance was tested and no one has ever been able to reproduce it or identify it, she added. Further, Barney Hill's dress shoes were so damaged they needed to be replaced, and both his and Betty's wristwatches never worked again.  \nBetty said the alien's eyes were cat-like, and had a little bit of yellow around the edges instead of being totally black. Interestingly, Betty subsequently participated in &quot;psychophysics&quot; experiments with researchers to try and vector in a UFO, and had limited success, Marden reported. Joining Marden in the latter half of the show, Denise Stoner shared her own abduction experiences, which initially began with her husband in Colorado, and involved missing time. She described various types of aliens that she's encountered: inactive 3ft. tall &quot;soldiers&quot; that line the craft, a 5ft. tall Grey-type she called &quot;my Escort,&quot; who guides and calms her, a being with insectoid eyes that blink vertically-- &quot;the Doctor&quot; who conducts medical procedures, and a hybrid-type who was able to download inaccessible information from her mind. \nA lot of abductees have been told information about what is to occur on the Earth-- usually they are shown calamitous type events, though it's uncertain whether these visions are accurate, said Stoner. The checklist of alien abduction signs includes missing time, nose bleeds, returning home wearing articles of clothing not belonging to you, and finding yourself in a place where you didn't start out, Stoner detailed, as well as certain &quot;markers&quot; that they don't make public. She also cited a curious phenomenon she's personally experienced-- coming back with a physical problem that she didn't have prior to being on the alien ship. For her, it was a muscular and nerve problem that doctors have been unable to diagnose. Among the other cases that Marden and Stoner have researched is Jenni Henderson's multi-generational abduction story, which took place in New Hampshire, near where the Hill's lived. \nLarry Conners Case\nFirst hour guest, longtime TV newsman Larry Conners talked about being fired from KMOV in St. Louis after he made a post onquestioning whether he was targeted by the IRS because of an interview he did with Pres. Obama last year. He said he's pursuing a wrongful termination case through his union, as well as the EEOC. For more on the incident, see this article. \nNews segment guests: Lauren Weinstein, Charles Shults III\nWebsite(s):\n kathleen-marden.com\n denisemstoner.com\nBook(s):\n The Alien Abduction Files\n Captured! The Betty and Barney Hill UFO Experience\n","torrent":{"xt":"urn:btih:0ec8e4f479922bc0dad606f2d323c84fa38d6de4","amp;dn":"Coast+to+Coast+AM+May+29%2C+2013+-+Cases+of+Alien+Abduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ec8e4f479922bc0dad606f2d323c84fa38d6de4","infoHashBuffer":{"type":"Buffer","data":[14,200,228,244,121,146,43,192,218,214,6,242,211,35,200,79,163,141,109,228]},"announce":[],"urlList":[]}}