{"title":"Fred Vermorel, Fashion, Perversity, and the Sixties Laid Bare [E","uid":12266266,"size":4605031,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f4884525b8a456ef9be737cffa99579a756b5ab&amp;dn=Fred+Vermorel%2C+Fashion%2C+Perversity%2C+and+the+Sixties+Laid+Bare+%5BE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hand_of_Doom","files":4,"time":1440240855,"description":"Fred Vermorel, Fashion, Perversity, and the Sixties Laid Bare [Epub] [Mobi]\n\n\nVivienne Westwood was the Queen of Punk Rock and her fashions have scandalized and fascinated the world since the Sixties. Parading models bare-breasted down the catwalks of Paris, posing pantiless outside Buckingham Palace - she has an insatiable appetite for anarchic outrageousness. She has never lost her power to shock, and her continued innovations make her one of the most talked-about fashion designers in the world. Vivienne Westwood describes for the first time in detail Westwood's childhood and early years; it also exposes the inside story of her stormy and bizarre relationship with musician and fashionista Malcolm McLaren. Fred Vermorel looks at the origins of Westwood's witty and erotic sensibility, placing it in the context of the Sixties, and throwing light on the dynamics of punk and on Westwood's later ability to tap into the inner logic of fashion - a Romantic perversity which is at the heart of mass consumption itself. As a dirty history of the Sixties shared by Westwoood, McLaren and the author, and as a story of the triumph of a mad, bad, outrageous girl, Vivienne Westwood succeeds brilliantly","torrent":{"xt":"urn:btih:0f4884525b8a456ef9be737cffa99579a756b5ab","amp;dn":"Fred+Vermorel%2C+Fashion%2C+Perversity%2C+and+the+Sixties+Laid+Bare+%5BE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f4884525b8a456ef9be737cffa99579a756b5ab","infoHashBuffer":{"type":"Buffer","data":[15,72,132,82,91,138,69,110,249,190,115,124,255,169,149,121,167,86,181,171]},"announce":[],"urlList":[]}}