{"title":"Ziggurat v1.0u3","uid":11549721,"size":391271320,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0f5d9262f77572c20eef79844efd60c51c09047d&amp;dn=Ziggurat+v1.0u3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lamasu","files":-1,"time":1416767414,"description":"&quot;Ziggurat is a dungeon crawling FPS, with procedurally generated scenarios and encounters. You'll face dozens of dangerous enemies while you find new and powerful spells, and learn helpful perks in your quest to overcome this deadly test.\nBecome a neophyte sorcerer, and get ready for your rite of passage: Enter the labyrinth and face dangerous challenges to prove your worth and become a powerful wizard.\nThe game focuses on fast-paced first person shooting, with an old-school vibe, and updated handling and game mechanics. Dungeon crawling and RPG/Roguelike elements are added into the mix, resulting in a fun, challenging and varied game, with lots of content to discover.\nFight almighty bosses, get through rooms filled with traps, and treasures that may help you in your journey... Each game is a whole new experience.\nUnlike most rogue-thingies, on Ziggurat your combat skills will be the most important asset to keep advancing. Leveling up and randomly generated content is there to improve variety and make each game different, not to make the game a roll dice or an unbearable grind.\nMost perks are designed to change the way you have to play or the weapons you'll want to use. Do you want more speed in exchange for less health, or maybe is better to have mana regeneration? Increase drop rate, or refill ammo here and now? No number game here, simple and direct choices.\nWe've also ensured that, as a proper FPS game, the experience is quick and direct. There's no inventory to manage or the need to compare two almost equal item drops, just weapon selection, and mana/health are usually the bargaining chip.\nA whole arsenal of magic and alchemic weapons will be at your disposal. Wreak havoc among your enemies, but watch your mana reserves or you might regret it later.\nMagic staves, spellbooks, magic wands... dozens of weapons with different attack strategies that help keeping the game fresh.&quot;\n\nThis is post-release Update 3 (2014-11-20).\n\nNew update, featuring an impressive amount of content. Main additions are the new Endless mode and a new room setting, along with a new enemy, and lots of fixes, upgrades and balancing changes:\n- New unlockable Endless mode, with gameplay variations to ensure fun, varied and challenging gameplay for hours (if you manage to survive).\n- New room theme for Floor 2: The Quarry.\n- New enemy: Rotten stem.\n- Added French and German languages.\n- Balancing changes:\n-- Shielded Skeletons: Fixed attack animations, reduced damage and attack distance.\n-- Poloko: Reduced regeneration when spawning enemies, reduced number of carrots spawned.\n-- Gunkarr: Reduced close quarters attack range.\n-- King Blob: Reduced attack damage.\n-- Adam: Increased number of small golems spawned, increased grenade speed.\n-- Ignus: Reduced number of minions spawned, reduced flame duration.\n-- Examiner Cepheus: Increased health.\n-- Necromancer: Increased threat value, reduced number of spawned skeletons.\n-- Slime: Reduced threat value.\n-- Basilisk: Reduced threat value.\n-- Carrots: Reduced threat value.\n-- Shaman: Reduced shot damage.\n-- Green slime: Reduced shot damage.\n-- Scarab Beetle Staff: Increased damage.\n-- Staff of Atlantis: Increased fire rate.\n-- Sphere of Ulthar: Increased damage.\n-- Porcupine Bomb: Increased mana usage.\n-- Increased poison damage rate, reduced poison state duration (so you can deal more damage with poison weapons as long as you keep poisoning them).\n-- Wraith rings: Reduced vertical spread, increased homing distance.\n-- Reduced duration of damage over time when you exit the damage source (In other words, lava deals less damage if you quickly jump outside it). \n- The game should start at the configured resolution now.\n- Fixed player perks appearing twice.\n- Done some improvements that reduced the project size, and probably memory footprint.\n- Rewards on treasure rooms shouldn't come out flying anymore.\n- Monsters on obelisk rooms no longer drop score goblets (so you can't farm them).\n- Demon: Fixed some animation issues.\n- Should have fixed Stuttering some people were experiencing.\n- Fixed water reflections being white from time to time.\n- Fixed Scaredy cat perk effects stacking.\n- Fixed Mudblood achievement unlocking when loading a game.\n- Fixed some achievement conditions not unlocking when playing a resumed game.\n- Prevented some cockatrices with speed boost from jumping too high.\n- You are shown an unlocked item for new game modes when winning the game.\n- Should have improved a bit performance and visual quality for Low/Lowest settings.\n- Fixed bad behavior with Magic Binding perk.\n- And plenty of other minor improvements.\n\nIf you like the game, support the developer, buy it!               &lt;a href=&quot;\nhttp://store.steampowered.com/app/308420/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/308420/&lt;/a&gt;\t &lt;a href=&quot;\nhttp://www.milkstonestudios.com/games/ziggurat/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.milkstonestudios.com/games/ziggurat/&lt;/a&gt;","torrent":{"xt":"urn:btih:0f5d9262f77572c20eef79844efd60c51c09047d","amp;dn":"Ziggurat+v1.0u3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f5d9262f77572c20eef79844efd60c51c09047d","infoHashBuffer":{"type":"Buffer","data":[15,93,146,98,247,117,114,194,14,239,121,132,78,253,96,197,28,9,4,125]},"announce":[],"urlList":[]}}