{"title":"Flying Saucers Are Real by Maj D. Keyhoe USMC (retd.)","uid":5486099,"size":19033077,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:109035d8c1dd80f24b335471c972388131f93582&amp;dn=Flying+Saucers+Are+Real+by+Maj+D.+Keyhoe+USMC+%28retd.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"artpepper","files":-1,"time":1270726251,"description":"The Flying Saucers Are Real by Maj. Donald Keyhoe\n\n\nPublisher: Cosimo Classics | ISBN: 1596050020 | edition 2004 | PDF | 207 pages | 15,1 mb\n\n\nDonald Keyhoe was there first. He didn't invent the UFO phenomenon, but he became its first authoritative private spokesman. In 1949, TRUE magazine asked aviation writer and retired Marine Corps Major Donald Keyhoe to look into the flying saucer enigma, which had burst onto the scene just two years previously. With information from his friends in the military, Keyhoe concluded that the objects came from outer space and that the Air Force was covering up the story to prevent panic.\n\n\n&quot;The article caused a sensation and a year later Keyhoe expanded it into this landmark book, THE FLYING SAUCERS ARE REAL. In a personal, no-nonsense style, Keyhoe provides the details of his investigation: he talks with the witnesses, reviews the history of the phenomenon, and attempts to pry open the secrecy lid the Air Force had clamped down on the subject. \n\nKeyhoe would go on to write four more books on the subject and in 1957 he became director of the National Investigations Committee on Aerial Phenomena, without a doubt the most influential private UFO organization of all time. But it is this book, which sold a half-million copies, that inspired hundreds of people to take up the UFO cause and established the core elements of UFO mythology, which the government has attempted to counter--unsuccessfully, I might add--to this very day.\n","torrent":{"xt":"urn:btih:109035d8c1dd80f24b335471c972388131f93582","amp;dn":"Flying+Saucers+Are+Real+by+Maj+D.+Keyhoe+USMC+%28retd.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"109035d8c1dd80f24b335471c972388131f93582","infoHashBuffer":{"type":"Buffer","data":[16,144,53,216,193,221,128,242,75,51,84,113,201,114,56,129,49,249,53,130]},"announce":[],"urlList":[]}}