{"title":"Ekseption - 00.04 - Vinylrip - Abrasax","uid":5324309,"size":225692966,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1131d0f85f687d3334c5283548df28bcd3e37b8d&amp;dn=Ekseption+-+00.04+-+Vinylrip+-+Abrasax&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Abrasax","files":9,"time":1264965748,"description":"Ekseption - 00.04 - Vinylrip - Abrasax\n\nLPrip:\nEkseption - 00.04\nRELEASED:  1971\nLABEL: Philips\nFORMAT: LP\nPRODUCER: Rick Van Der Linden\nBITRATE: Flac\n\nTracks:\n\nSide One:\n01. Ave Maria\n02. Body party\n03. Monlope\n04. Monkey dance\n05. Choral\n\nSide Two:\n06. Partita No. 2 in C minor\n07. Piccadilly sweet\n\n\nEkseption is a Dutch band that was famous during the late sixties/early seventies for the way it combined themes from classical composers with contemporary rock and jazz in a blend of dominating, virtuoso keys and trumpet plus sax(es). \n\nDue to their style and nature, it was only a matter of time before Ekseption would attempt to do something with an orchestra and they finally did it on their 4th album. The record went straight to the top of the charts, and cemented Ekseption's position as the most successful Dutch progressive rock band in the earliest 70's. The 14-minute &quot;Piccadilly Sweet&quot; was written by van der Linden, and was the track where the orchestra came best to the fore. The composition features many fine themes, and the orchestral arrangements are very powerful and melt very well together with the band. If Maurice Ravel had played in a progressive rock band, then this is maybe what it would have sounded like. The rest of the album is a typical Ekseption-mix of covers and original material. The old jazz-tune &quot;Monlope&quot; has been turned into an organ-driven progressive piece in three parts where part 2 is a symphonic baroque passage written by Van Der Linden. It stands in my opinion as one of Ekseption's very best recordings. The version of Bach's &quot;Partita No. 2 in C Minor&quot; introduced synths to the band's sound, while &quot;Ave Maria&quot; opens the album in a promising and beautiful way. Van Der Linden had penned the rest of the material. &quot;Body Party&quot; and &quot;Monkey Dance&quot; are both two rocking and catchy tracks while &quot;Choral&quot; is a very beautiful piece that builds up to a great finale with choir and church-organ. &quot;00.04&quot; was one of Ekseption's most successful albums.\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Abrasax/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Abrasax/&lt;/a&gt;","torrent":{"xt":"urn:btih:1131d0f85f687d3334c5283548df28bcd3e37b8d","amp;dn":"Ekseption+-+00.04+-+Vinylrip+-+Abrasax","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1131d0f85f687d3334c5283548df28bcd3e37b8d","infoHashBuffer":{"type":"Buffer","data":[17,49,208,248,95,104,125,51,52,197,40,53,72,223,40,188,211,227,123,141]},"announce":[],"urlList":[]}}