{"title":"V.A. - Primitive Music Of The World","uid":4410137,"size":84266370,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:12f583d303c7542603d7450f24258fec38c5412c&amp;dn=V.A.+-+Primitive+Music+Of+The+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starinar","files":37,"time":1222180145,"description":"CLICK ON starinar TO GET MORE TRIBAL AND INDIGENOUS MUSIC.\nBE A MEMBER OF A GLOBAL SeeDeRS TRIBE. MoRE CoMING SooN. ENJoY!\n\n\n\nVA - Primitive Music Of The World (192Kbps)\n\n\nNot so long ago scholars used the word &quot;primitive&quot; to describe \nall music from the non-Western world. They viewed it as rudimentary, \nsimple, and backward. From their ivory tower perspectives, it was \nWestern classical music that represented the apex of musical evolution. \nWhen composer Henry Cowell compiled Primitive Music of the World for \nFolkways in 1962, he was operating under this kind of musical prejudice. \nDespite his anachronistic slant, Henry Cowell's stellar selections for \nthe album betray his great appreciation for non-Western music. Primitive \nMusic of the World starts off with &quot;Murut Music of North Borneo.&quot; \nSounding somewhat similar to Native North American music, it consists \nof an all-male chorus chanting in unison around a single tone. \nPercussive sounds are produced as the chorus dances on a flexing floor. \nOther extraordinary tracks on the album include Pygmies singing a complex \ncontrapuntal elephant-hunting song, Australian Aborigines singing with \ndidgeridoo and clapstick accompaniment, Navajo Night Chanters \nalternating between relaxed and falsetto vocal tones, and East Indian \nTrinidadians playing music that draws upon both Hindustani and West \nAfrican traditions. The only thing primitive about this album is Cowell's \nuse of the word. It's an outdated term that now refers to a long forgotten \nworldview. Though put together by Cowell long ago, the album is hardly \nantiquated or dull: it is vibrant, creative, and sophisticated. And it's \nstill available from Folkways, as is everything in their vast catalog. \n\n- John Vallier, All Music Guide","torrent":{"xt":"urn:btih:12f583d303c7542603d7450f24258fec38c5412c","amp;dn":"V.A.+-+Primitive+Music+Of+The+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12f583d303c7542603d7450f24258fec38c5412c","infoHashBuffer":{"type":"Buffer","data":[18,245,131,211,3,199,84,38,3,215,69,15,36,37,143,236,56,197,65,44]},"announce":[],"urlList":[]}}