{"title":"Brothers in Arms Road to Hill 30 PC ISO","uid":4262427,"size":3129884672,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:136ec8593f3acbb9a46a4ca3bd790ab03f0f833e&amp;dn=Brothers+in+Arms+Road+to+Hill+30+PC+ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"toomuchbeeer","files":1,"time":1214531117,"description":"In a game set during the famous airdrop before the invasion at Normandy, Sgt. Matt Baker and his squad of 101st Airborne Paratroopers are scattered over the French countryside. As the story unfolds, the player (Baker) must choose between the success of his mission and the lives of his men - his brothers in arms.\nBrothers In Arms: Road to Hill 30 will immerse players in the historic eight-day invasion of Normandy - with unparalleled imagery, authenticity, sound, and gameplay.\n* One of a kind: Brothers In Arms is the only first-person tactical shooter set in WWII.\n* Real military tactics: Intuitive and easy-to-use squad controls appeal to both the hardcore and mainstream gaming audience.\n* Real soldiers: Featuring a cast of more than 20 characters, each having a distinctly unique personality, appearance, and style.\n* Revolutionary AI system: Allies and enemies use the standard operating procedures of fire and maneuver to flank and kill their foes.\n* Unprecedented authenticity: Historically accurate and detailed battlefields, events, and equipment recreated from Army Signal Corps photos, aerial reconnaissance imagery, and eyewitness accounts.\n* Innovative multiplayer: Players command three-man AI teams in a battle of wits and skill to accomplish exciting \n\nSystem Requirements:\n\n* Supported OS: WindowsÂ® 2000/XP (only)\n* Processor: 1 GHz PentiumÂ® III or AMD Athlon? (2.5 GHz Pentium IV or AMD recommended)\n* RAM: 512 MB (1 GB recommended)\n* Video Card: 32 MB DirectXÂ® 9.0c compliant (see supported list*)\n* Sound Card: 16-bit DirectX 9.0c compliant sound card\n* DirectX Version: DirectX 9.0c (included on disc)\n* DVD-ROM: 4X DVD-ROM (8X or better recommended)\n* Hard Drive Space: 5 GB\n* Peripherals Supported: Windows keyboard and mouse only\n* Multiplay: Broadband with 64 kbps upstream (128 kbps recommended)\n\n*Supported Video Cards at Time of Release:\n* ATIÂ® RadeonÂ® 8500/9000/X series\n* NVIDIAÂ® GeForce? 4/FX/6 series (GeForce 4 MX not supported)\nLaptop models of these cards not supporte","torrent":{"xt":"urn:btih:136ec8593f3acbb9a46a4ca3bd790ab03f0f833e","amp;dn":"Brothers+in+Arms+Road+to+Hill+30+PC+ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"136ec8593f3acbb9a46a4ca3bd790ab03f0f833e","infoHashBuffer":{"type":"Buffer","data":[19,110,200,89,63,58,203,185,164,106,76,163,189,121,10,176,63,15,131,62]},"announce":[],"urlList":[]}}