{"title":"Sexually Broken--Former Collegiate runner bound Ana Foxxx Matt W","uid":8486425,"size":1052176895,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:13e4b03ac38a947a63a98fe1dd3d296d2fe61f54&amp;dn=Sexually+Broken--Former+Collegiate+runner+bound+Ana+Foxxx+Matt+W&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1368835918,"description":"Former Collegiate runner, bound, throated, eyes fucked into the back of her head, on screen tying! | Ana Foxxx | Matt Williams\n\nMay 17, 2013 \n \n\nMP4 only.\n\n \nWe are always listening to feedback. We have learned most of you like to see on screen tying. So today all the work is done on screen, right in front of you. Ana Foxxx and her ripped, hard body will serve. We will take.\n\nIn her cute little USA shirt, jean shorts and sneakers she is just begging for bondage. We walk in and bind her elbows together, then her wrists, and in a few short seconds she is completely helpless. Now we manhandle our fit toy, demonstrating our complete control over her and her sexy body. We pull of her tight shorts, pull up her shirt and abuse her rock hard huge nipples. We make her squeal as we pinch and pull them. \n\nWe knock her to her knees and shove the hard white cock down her tight black throat. We face fuck her into subspace. She fights for air, but the cock is winning. Rough face fucking at it's best and she is completely helpless to boot. We bend her over a table and slide the spit coated cock right up her pussy, balls deep one stroke. She is impaled, and the cock bangs away deep and hard into her very core.\n\nShe cums multiple times from being banged from behind, her eyes rolling up inside her head as she cums and cums. We strappado her arms up and continue fucking our helpless athlete. In the end we HOGTIE her by just her ankles and elbows. We make her cum and squirt with the vibrator, then lift her off the ground in a Category 5 suspension. She floats there, waiting the return of hard cock... \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/05_17afoxxx3/SexuallyBroken-Ana-Foxxx-Matt-Williams-Former-Collegiate-runner-bound-throated-eyes-fucked-into-the-back-of-her-head-on-screen-tying.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/05_17afoxxx3/SexuallyBroken-Ana-Foxxx-Matt-Williams-Former-Collegiate-runner-bound-throated-eyes-fucked-into-the-back-of-her-head-on-screen-tying.php&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:13e4b03ac38a947a63a98fe1dd3d296d2fe61f54","amp;dn":"Sexually+Broken--Former+Collegiate+runner+bound+Ana+Foxxx+Matt+W","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13e4b03ac38a947a63a98fe1dd3d296d2fe61f54","infoHashBuffer":{"type":"Buffer","data":[19,228,176,58,195,138,148,122,99,169,143,225,221,61,41,109,47,230,31,84]},"announce":[],"urlList":[]}}