{"title":"POtHS - Shield of The Son - Bible Lessons on Fallen Angels Ufo W","uid":8731416,"size":8346342421,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:159388cbb95aca9538fc73c995df7554815031bc&amp;dn=POtHS+-+Shield+of+The+Son+-+Bible+Lessons+on+Fallen+Angels+Ufo+W&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"POtHS11","files":-1,"time":1374612454,"description":"PO t HS\n\nPouring Out the Holy Spirit\n\nShield of The Son\nBible Lessons on Fallen Angels Ufo Witches Demons\n\n\n &lt;a href=&quot;\nhttp://viewzone.com/monalisa.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://viewzone.com/monalisa.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8686429/POtHS_-_Apollo_Mission_20_-_Found_War_in_The_Heavens_on_The_Moon&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8686429/POtHS_-_Apollo_Mission_20_-_Found_War_in_The_Heavens_on_The_Moon&lt;/a&gt;\n\nPOtHS Comment:  Unknown Apollo Mission to The Dark Side of The Moon Discover Humungous Spacecraft with 2 Dead Nephilim Astronauts.  See Part 1 here: &lt;a href=&quot;\nhttp://conspiracyhub.com/details_resource.php?it=9789&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracyhub.com/details_resource.php?it=9789&lt;/a&gt;\n\nPublished on Jun 2, 2012\nAncient Advanced Civilization Found On Moon- Nasa Footage mirrored from Shield of the Son Productions\n\n\nINTRODUCTION\nHere's a story that has been going around the web since about 2007. It's pretty amazing and I'm kind of surprised that it hasn't received more attention. I think many editors thought it was too far fetched to be true.\n\nTo be honest, we thought it was a hoax until one of the staff here at viewzone decided to procure the film strips from the NASA site, noticed that there were two images of the object available (taken from different angles) and made a 3D composite image. The results are at the bottom of this page. While we are not confident about the accompanying video and images of the &quot;alien entity&quot; (the female body), we are surprised that the 3D images do show an actual object on the Moon's surface.\n\nIf you have the old red-blue 3D glasses you can see the spaceship pretty clearly. There's not much doubt that it's a spaceship -- either that or a submarine -- but we'll leave that up to our readers to decide.\n\nBackground Story\n\nThe story comes to us from a man who claims he was on a special NASA mission:\n\nWilliam Rutledge is retired and now lives in Africa. He recently came out to reveal some amazing facts about his involvement with NASA in the late 70s. Rutledge claims to have worked on at least two missions to the Moon, including the failed Apollo 19, and the Apollo 20, which he says was launched in August of 1976 from Vandenberg Air Force Base.\n\nBoth of these missions, according to Rutledge, were &quot;classified joint Space missions&quot; resulting from collaborations between U.S. and Soviet governments. They do not appear on any roster of NASA missions -- and, if this is true -- for good reasons.\n\nThe purpose of these missions was to investigate a large object on the far side of the moon in the Delporte-Izsak region, allegedly discovered and photographed during the Apollo 15 mission. The object, which vaguely resembled an &quot;X-Wing&quot; fighter as seen in the Star Wars films, was supposed to have been a very large alien spacecraft which had crashed or was otherwise abandoned on the Moon in ancient times.\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:159388cbb95aca9538fc73c995df7554815031bc","amp;dn":"POtHS+-+Shield+of+The+Son+-+Bible+Lessons+on+Fallen+Angels+Ufo+W","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"159388cbb95aca9538fc73c995df7554815031bc","infoHashBuffer":{"type":"Buffer","data":[21,147,136,203,185,90,202,149,56,252,115,201,149,223,117,84,129,80,49,188]},"announce":[],"urlList":[]}}