{"title":"Blind Spot - Hitlers Secretary","uid":4348955,"size":733372205,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:15b65f94af2f389360c5dd04a57859b4101b16db&amp;dn=Blind+Spot+-+Hitlers+Secretary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cabelinho","files":3,"time":1219040834,"description":"Traudl Junge foi a secretÃƒÂ¡ria particular de Hitler desde o outono de 1942 atÃƒÂ© a derrocada do regime nazista, em 1945. Ela o acompanhava em todos os lugares, seja em seu trem exclusivo, seja no bunker do FÃƒÂ¼hrer. Foi ali que Hitler ditou para ela seu testamento. Agora, Traudl Junge, 81 anos, fala pela primeira vez na histÃƒÂ³ria diante de uma cÃƒÂ¢mera. Na primavera de 2001, o diretor AndrÃƒÂ© Heller finalmente conseguiu convencÃƒÂª-la da importÃƒÂ¢ncia de registrar suas memÃƒÂ³rias para a posteridade. Ela mostra uma memÃƒÂ³ria excepcional, mas tambÃƒÂ©m revela suas dÃƒÂºvidas e reflexÃƒÂµes pessoais. No total, foram gravadas 10 horas de material, do qual foram editados 90 minutos para o documentÃƒÂ¡rio, sem o uso de imagens de arquivo. Junge se revela uma adversÃƒÂ¡ria ferrenha do nacional-socialismo, mas tambÃƒÂ©m uma mulher idosa perplexa com a incapacidade de uma jovem ingÃƒÂªnua ao nÃƒÂ£o identificar a gravidade da situaÃƒÂ§ÃƒÂ£o, com a qual colaborava.\n\n\n\nTraudl Junge was Adolf Hitler&amp;#039;s private secretary, from Autumn 1942 until the collapse of the Nazi regime. She worked for him at the Wolfsschanze in Obersalzberg, on his private train and, finally, in his bunker in the besieged capital. It was Traudl Junge to whom Hitler dictated his final testament. In her first ever on-camera interview, 81-year-old Junge talks about her unique life. In the spring of 2001, Andre Heller succeeded in convincing Traudl Junge how valuable it is to record her unique memories. Fifty-six years after the end of the Second World War, an important eyewitness reveals her experiences to us. What she saw and heard turned her into an furious opponent of National Socialism; an opponent, moreover, who is still painfully aware and seems incapable of forgiving the young girl she once was--for her naivete, ignorance, and her liking for Hitler.  Written by Sujit R. Varma \n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0311320/plotsummary&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0311320/plotsummary&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:15b65f94af2f389360c5dd04a57859b4101b16db","amp;dn":"Blind+Spot+-+Hitlers+Secretary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15b65f94af2f389360c5dd04a57859b4101b16db","infoHashBuffer":{"type":"Buffer","data":[21,182,95,148,175,47,56,147,96,197,221,4,165,120,89,180,16,27,22,219]},"announce":[],"urlList":[]}}