{"title":"Bella's Gift - Rick Santorum and Karen Santorum - Audiobook MP3","uid":11694105,"size":202806426,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:164a0248ad1fc4d897e92cceec5e2d394f574f28&amp;dn=Bella%27s+Gift+-+Rick+Santorum+and+Karen+Santorum+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Squiddy82","files":21,"time":1423645279,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nBella's Gift: How One Little Girl Transformed Our Family and Inspired a Nation\n\nWritten by: Rick Santorum, Karen Santorum, Elizabeth Santorum\nNarrated by: Rick Santorum, Diana Batarseh\nLength: 6 hrs and 59 mins\nUnabridged Audiobook\nRelease Date:02-10-15\n\nRick and Karen Santorum's inspiring story of life with Bella, their special-needs youngest child.\nFour days after Rick and Karen Santorum welcomed their eighth baby into the world, they were given the devastating news that their little girl, Bella, was going to die.\nThe full story of life with Bella has never been told until now. This inspiring family memoir explores what it means to embrace and celebrate the life of each person and find hope even in the midst of painful challenges.\nBella's Gift is the story of how the entire family came together to love and care for Bella and how God strengthened them during the storms and blessed their family with grace, peace, and joy. Searchingly honest, faith filled, and surprisingly joyful, Bella's Gift is a loving, lived-out testimony to the truth that everyone counts, even &quot;the least of these&quot;","torrent":{"xt":"urn:btih:164a0248ad1fc4d897e92cceec5e2d394f574f28","amp;dn":"Bella%27s+Gift+-+Rick+Santorum+and+Karen+Santorum+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"164a0248ad1fc4d897e92cceec5e2d394f574f28","infoHashBuffer":{"type":"Buffer","data":[22,74,2,72,173,31,196,216,151,233,44,206,236,94,45,57,79,87,79,40]},"announce":[],"urlList":[]}}