{"title":"Anton Bruckner Nl RPO Jaap van Zweden - Symphony no. 6 [FLAC]","uid":15304731,"size":239021493,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:165de78b5310b00163e01b98762bc42144babaf5&amp;dn=Anton+Bruckner+Nl+RPO+Jaap+van+Zweden+-+Symphony+no.+6+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":9,"time":1468521945,"description":"Anton Bruckner Nl RPO Jaap van Zweden - Symphony no. 6 [FLAC]\r\n\r\n  Genre: Classical \r\n  Source: CD \r\n  Codec: FLAC\r\n  Bit rate: ~ 1,000 kbps\r\n  Bit depth: 16\r\n  Sample rate: 44.1 kHz\r\n\r\n  01 I. Maestoso\r\n  02 II. Adagio. Sehr feierlich\r\n  03 III. Scherzo- Nicht schnell - Trio- Langssam\r\n  04 IV. Finale- Bewegt, doch nicht zu schnell\r\n\r\n   Continuing his super audio series of the symphonies of Anton Bruckner, Jaap van Zweden presents the Symphony No. 6 in A major with the Netherlands Radio Philharmonic Orchestra in a superb performance that will likely stand the test of time. Van Zweden has had great success with his riveting recordings of Bruckner's Eighth and Third symphonies, and he has positioned himself as one of the leading Bruckner conductors of his generation, alongside such important figures as Simone Young, Dennis Russell Davies, Marcus Bosch, and Gerd Schaller. Those artists have explored the less familiar original versions of Bruckner's symphonies, and while van Zweden has largely avoided that trend and conducted editions that are generally regarded as mainstream, there is usually something quirky about the versions he chooses. The Symphony No. 6 underwent an extensive clean-up in the 1990s by Rüdiger Bornhöft, who corrected errors in the previous editions by Robert Haas and Leopold Nowak, so van Zweden's 2012 recording presents that revision. Even so, this tweaked version of the Sixth is not drastically different from what listeners know from older recordings, so van Zweden's choice of score may not matter much to any but the most obsessed fans. What does matter, however, is the expressive power of the orchestra and the astonishing clarity and presence of the SACD, which gives the music extraordinary depth and presence. Van Zweden's talents may have less to do with presenting authentic or scholarly Bruckner than with presenting exciting and memorable Bruckner, and for that, he is hard to beat. With his excellent track record, van Zweden is the conductor to watch, so all of his recordings for Challenge Classics merit attention","torrent":{"xt":"urn:btih:165de78b5310b00163e01b98762bc42144babaf5","amp;dn":"Anton+Bruckner+Nl+RPO+Jaap+van+Zweden+-+Symphony+no.+6+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"165de78b5310b00163e01b98762bc42144babaf5","infoHashBuffer":{"type":"Buffer","data":[22,93,231,139,83,16,176,1,99,224,27,152,118,43,196,33,68,186,186,245]},"announce":[],"urlList":[]}}