{"title":"Life Of The Party","uid":8590356,"size":111224268,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:16f544e3d2e4d9cb0c2f405e5b709a747ebf2106&amp;dn=Life+Of+The+Party&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1371626752,"description":"'Life Of The Party'\n\nFantagraphics Books, 1996, 156 pages\n\nWritten and Illustrated by Mary Fleener\n\nMost everyone has heard the phrase &quot;sex, drugs, and rock-and-roll.&quot; But &quot;sex, drugs, rock-and-roll, and comics&quot;? You bet. In a gloriously straightforward manner, Mary Fleener illustrates her oftentimes decadent social experiences in this complete collection of her autobiographical comics work. The tableaux she weaves are a candid take on the party scene of Southern California, but what is most distinctive isn't her storytelling - it's her art. She has developed a unique style that she calls &quot;cubismo&quot;: a blend of underground comix and cubism. She uses this style to convey changes in mental states - specifically, changes in the subjective fields of experience - whether from anger, frustration, or drug use. A truly remarkable achievement. \n\nFleener's autobiographical comics (or - her clever neologism - autobiographix) depict a post-1960s Southern California scene centered on sex, drugs, and rock and roll and curiously combining New Age spirituality and decadence. Unlike many of her alternative-comics peers, Fleener seems less interested in personal introspection than in simply spinning a good yarn. Yarns she has in abundance, thanks to years spent playing in bar bands (at great personal risk: her predecessor in one band was shot onstage), attending wild parties, enduring lunatic boyfriends and unbalanced roommates, and surfing, which comes off as her sanest activity. She gets great mileage from the mundane, too, in stories about working tedious retail jobs and ridding the garden of slugs. Although its effectiveness lessens during the course of an entire book, her cubist-cartoony style (ever the word coiner, she calls it cubismo), with its clear compositions and hard-edged lines, is confident and attractive: it contributes significantly to the success of one of the more substantive additions to the autobiographix genre.","torrent":{"xt":"urn:btih:16f544e3d2e4d9cb0c2f405e5b709a747ebf2106","amp;dn":"Life+Of+The+Party","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16f544e3d2e4d9cb0c2f405e5b709a747ebf2106","infoHashBuffer":{"type":"Buffer","data":[22,245,68,227,210,228,217,203,12,47,64,94,91,112,154,116,126,191,33,6]},"announce":[],"urlList":[]}}