{"title":"The Beach Boys &amp; Brian Wilson - SMiLE hybrid (Mattix)","uid":5593626,"size":86511147,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:175e84e69923f9d2192a5941dd420bc7d9d1a0eb&amp;dn=The+Beach+Boys+%26+Brian+Wilson+-+SMiLE+hybrid+%28Mattix%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MMattix","files":-1,"time":1274958655,"description":"After Falling in Love with a bootleg of The Beach Boys' 'SMiLE' album from 1967, I quickly obtained a copy of Brian Wilson's completed 2004 Version. While I preferred hearing the songs performed by the Beach Boys, Brian Wilson's version did offer a few upsides. The audio quality was more crisp, the album as a whole had a better flow to it, and above all else, it was complete! But certain songs on the Brian Wilson version just didn't have the impact of their 1967 counterparts, so I found myself switching back and forth between both versions, and for each one, finding myself yearning for the opposite version during certain parts of the album. After doing much of this, I decided to take on a project. A few days down the road I find myself here presenting it's completion.\n\nThis is a Hybrid version of the album created by me (Mattix) that is comprised of roughly 50% of each album, but I have managed to give it a very cohesive flow that feels almost identical to that of the 2004 version. There are no hiccups or unnecessary pauses. Even the quality of the 2 albums meshes together very well. It's easy to get lost in this and completely forget that you're not listening to one single recording. \n\nThis is, in my opinion, the absolute most enjoyable way to experience the album, hands down.\n\nBut there are a few other things worthy of notice. It also contains 2 new versions of Beach Boys songs made by myself. Surf's Up and Good Vibrations. Neither of which can be found anywhere else and I firmly believe that they are both the best versions of the 2 songs available anywhere. When you compare them, you will know what I mean. Apart from those 2 tracks which have been dramatically reworked (especially Good vibrations), You will find that this is probably has the most crisp Beach Boys tracks available - all of which have been slightly enhanced. Here is a guide as to which tracks are used from which version:\n\n1. Our Prayer - Gee (BB)\n2. Heroes And Villains (BB [BW for the outro only])\n3. Roll Plymouth Rock (BW)\n4. Barnyard (BW)\n5. Old Master Painter - You Are My Sunshine (BB)\n6. Cabin Essence (BB)\n7. Wonderful (BB)\n8. Song For Children (BW)\n9. Child Is Father Of The Man (BW)\n10. Surf's Up (BB [Mattix Exclusive])\n11. I'm In Great Shape - I Wanna Be Around - Workshop (BW)\n12. Vege-Tables (BB)\n13. On A Holiday (BW)\n14. Wind Chimes (BW)\n15. Mrs. O'Leary's Cow (BW)\n16. In Blue Hawaii (BW)\n17. Good Vibrations (BB [Mattix stereo exclusive])\n\n\nI'm very happy with this and would really appreciate honest comments. Thanks.","torrent":{"xt":"urn:btih:175e84e69923f9d2192a5941dd420bc7d9d1a0eb","amp;dn":"The+Beach+Boys+%26+Brian+Wilson+-+SMiLE+hybrid+%28Mattix%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"175e84e69923f9d2192a5941dd420bc7d9d1a0eb","infoHashBuffer":{"type":"Buffer","data":[23,94,132,230,153,35,249,210,25,42,89,65,221,66,11,199,217,209,160,235]},"announce":[],"urlList":[]}}