{"title":"The Case Against the Jews","uid":4940309,"size":199989,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:178d542d3d073c6e7b6adf6e75c3e03a57a0e05e&amp;dn=The+Case+Against+the+Jews&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Anchorite1","files":1,"time":1244422763,"description":"Jews and gentiles have been in a state of conflict for the last 2000 years -- an understandable if unfortunate circumstance, since brothers in religion or other ideology, like brothers in a family, have a more intense rivalry among themselves than they do with others more alien. But if religion provided the basis for most of the Jew-gentile conflict in historical times, it no longer does so, if for no other reason than that religion has simply ceased to play a major role in a society in which only a century ago it was the dominant force. Instead, the Jew-gentile conflict -- the &quot;Jewish Question&quot; as it is sometimes termed -- has now become a problem of the overweening influence if not virtual dominance by Jews of gentile institutions and culture. In the sense of the evolutionary struggle for &quot;survival of the fittest&quot; there is nothing obviously wrong with such a conflict; but when the details of this conflict are given a careful inspection, there seems to be a great deal which is wrong. The purpose of the present essay is to make just such an inspection; but rather than attempting to present detailed research (which would require at least a book) I have chosen rather to highlight a number of major points in a rather summary -- but I believe revealing -- fashion. While I have provided documentation for many of my assertions, as well as an extensive bibliography where a great deal more information along these lines may be found, the assertions of this essay will still be difficult for many to believe because the material is generally terra incognito to most people, including well-educated ones. The reason for this, of course, is that -- as mentioned earlier -- there is no greater taboo in American society (and for that matter, Western society) than the criticism of Jews, with the result that there is not only a profound ignorance concerning the Jewish Question, but a profound unwillingness to believe that there could possibly be anything worthwhile to learn. While I obviously cannot pry open those minds which are closed on this subject, for those individuals with at least a rudimentary curiosity I hope I will at minimum stimulate a desire to verify or refute the assertions of this essay. In my view there is simply no issue more important to Americans or white men generally than the Jewish Question, as those who dare to read this essay will shortly understand. I hasten to add, however, that there are no easy answers to the problems which are raised here, and those who believe differently have simply failed to grasp the complexity of the issues.","torrent":{"xt":"urn:btih:178d542d3d073c6e7b6adf6e75c3e03a57a0e05e","amp;dn":"The+Case+Against+the+Jews","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"178d542d3d073c6e7b6adf6e75c3e03a57a0e05e","infoHashBuffer":{"type":"Buffer","data":[23,141,84,45,61,7,60,110,123,106,223,110,117,195,224,58,87,160,224,94]},"announce":[],"urlList":[]}}