{"title":"Elvis Presley As recorded in stereo 57 vol 2 Jan 13,1957 flac","uid":9181208,"size":375322981,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:178d6e7ed6885a29c507d816fd4304260c27f73e&amp;dn=Elvis+Presley+As+recorded+in+stereo+57+vol+2+Jan+13%2C1957+flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mileyc.rox","files":9,"time":1384227601,"description":"Peace In The Valley (# 1-9)\nI Beg Of You (# 1-12)\nThat's When Your Heartaches Begin (# 1-13)\nMean Woman Blues (# 14 mastertake)\nTake My Hand, Precious Lord (# 14 mastertake)\nElvis Radio Special '57, Detroit, March 31, 1957 (an unreleased Elvis interview)\nJanuary 1957 was a busy month for Elvis Presley. Besides his national TV appearance on the Ed Sullivan program, he undertook over half a dozen soundtrack sessions for his second film &quot;Loving You&quot; and a couple of studio sessions proper. In almost every instance, Presley's ability to craft timeless performances shines through. If Elvis dominated 1956, he turned up the heat in 1957.\nThis disc presents most of the studio session held at Radio Recorders in Los Angeles, California on January 13, 1957, from the dry (no reverb added to the voice or instruments), binaural (two track stereo) safety tape. Between the 12th and 13th nine tunes were recorded, six pop numbers and three gospel, including &quot;Peace In The Valley&quot;, debuted on TV just a week earlier for Elvis' final Ed Sullivan appearance. The Radio Recorders building is still around, sitting on Santa Monica Boulevard, and looks like a little cottage house -- it's hard to believe so much great music was made there (Elvis and otherwise).\n\nThese tapes made up part of the superb 'Stereo '57 (Essential Elvis, Vol. 2)' release from RCA/BMG about ten years ago, but here the listener gets a little bit more, a fly-on-the-wall perspective of the recording session. The sound quality is a notch or two below the official binaural album, but it's not very noticeable (although the 19 minutes of &quot;Peace In The Valley&quot; can be heard in better quality on another &quot;import&quot;, 'I Got Stung'). Unfortunately, the various takes aren't separated on the disc, so one has to be prepared to wade through, for example, 15 minutes of &quot;I Beg Of You&quot; to hear a favorite moment! It's a single session, 31 takes, five songs.\n\nThere's plenty of interesting alternates, some still not officially released, including beautiful versions of &quot;Peace In The Valley&quot; (one with a piano intro instead of Scotty Moore's guitar -- after a breakdown Elvis notes &quot;it's easy ... can sing all day&quot;) and &quot;That's When Your Heartaches Begin&quot;. It should be mentioned that the CD holds takes 6-13 of &quot;Heartaches&quot;, not 1-13 as the cover states. Some of these seven run-throughs reveal Elvis, the producer, in action (he cuts off take ten's first line with &quot;uh-uh&quot;) -- on others the naughty Elvis (starting the monologue in take seven: &quot;If you bring your sweetheart, if you ... shit&quot;).\n\n&quot;I Beg Of You&quot;, as Elvis notes, &quot;ain't full enough on the opening, it has to be a little fuller, about four more musicians&quot;, due as much to the &quot;dry&quot; session tape as the arrangement, but it's rock and roll heaven anyhow (&quot;Darling, please, please break my heart ...&quot;). This January version would be shelved for 31 years until official issue on 'Stereo '57 (Essential Elvis, Vol. 2)' , although its rawness makes it superior to the performance waxed in February and released later in 1957. His vocal throughout is a rare treat -- like &quot;Let Me&quot; on the awesome 1997 RCA/BMG 'Jailhouse Rock' reissue, one can focus on Elvis' voice since it's almost completely isolated on one of the two stereo tracks. It's an uncommon priviledge to feel as if you're right next to him as he sings. And he gets better with each attempt, until he nails the track on take twelve!\n\nTo make the January 13th concept complete, the CD includes the official release master takes of &quot;Mean Woman Blues&quot; (binaural) and &quot;Take My Hand, Precious Lord&quot; (monaural) and a bonus interview on tour in Detroit, March 31, 1957. Another noisy and typical Q &amp; A affair, Elvis does mention the original title of what would become &quot;Jailhouse Rock&quot; (in reply to his feelings on getting a haircut if he's drafted): he states that it'll happen way before anything like that as his &quot;next movie role is a prison picture ... 'The Hard Way' (!)&quot;.\n\nAt this point in his life, Elvis really enjoyed the recording process. It's quite clear that Steve Sholes is producer in name only -- Elvis calls out every arrangement (&quot;we're gonna fade out at the end, y'all&quot;), jokes with the Jordanaires (&quot;they're trying to get a new Cadillac this year, you know&quot;) and runs the show, as he had since the previous July in New York (to record &quot;Hound Dog&quot;, &quot;Don't Be Cruel&quot; and &quot;Any Way You Want Me&quot;). To be privy to such a magnificent artist at his best (and only 22 years old!) makes this disc, despite some drawbacks, absolutely essential. ","torrent":{"xt":"urn:btih:178d6e7ed6885a29c507d816fd4304260c27f73e","amp;dn":"Elvis+Presley+As+recorded+in+stereo+57+vol+2+Jan+13%2C1957+flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"178d6e7ed6885a29c507d816fd4304260c27f73e","infoHashBuffer":{"type":"Buffer","data":[23,141,110,126,214,136,90,41,197,7,216,22,253,67,4,38,12,39,247,62]},"announce":[],"urlList":[]}}