{"title":"Incognito - Inside Life - (1991)[FLAC-EAC-CUE]","uid":4172056,"size":325637789,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:17fb9b3898360ee7dfe950fff38c300274b9250c&amp;dn=Incognito+-+Inside+Life+-+%281991%29%5BFLAC-EAC-CUE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"seanprince","files":22,"time":1209924556,"description":"Incognito - Inside Life - (1991)[FLAC-EAC-CUE]\n\nTrack list\n\nIncognito - Inside Life\n\n01.\tMetropolis\t\t05:11\n02.\tSmile\t\t\t04:48\n03.\tOne Step To A Miracle\t04:48\n04.\tCan You Feel Me\t\t03:43\n05.\tCrazy For You\t\t03:31\n06.\tGypsy\t\t\t05:29\n07.\tInside Life\t\t04:32\n08.\tLove Is The Colour\t04:09\n09.\tSketches In The Dark\t04:23\n10.\tSoho\t\t\t05:00\n11.\tAlways There\t\t05:04\n12.\tPromise You The Moon\t05:30\n\nBiography\tby John Bush\n\nAn acid jazz project with surprisingly deep roots in the 1970s jazz/funk/fusion world, Incognito was originally formed by Jean-Paul Maunick (aka Bluey) and Paul &quot;Tubbs&quot; Williams. Both were leaders of the late-&amp;#039;70s disco-funk group Light of the World, who scored several moderate British hits, including a cover of &quot;I Shot the Sheriff.&quot; Just after the release of Light of the World&amp;#039;s third LP (Check Us Out), Maunick and Williams shifted the lineup slightly and renamed the conglomeration Incognito.\nIncognito debuted with the single &quot;Parisienne Girl&quot; and released the 1981 LP Jazz Funk, but was inactive during the rest of the 1980s. Maunick continued to write material for his group, even while working with Maxi Priest and others. (Williams later moved to Finland.) By the beginning of the 1990s, DJ legend and early Incognito fan Gilles Peterson had founded the Talkin&amp;#039; Loud label and he made Incognito one of his first signings. The 1991 single &quot;Always There&quot; (with vocals by Jocelyn Brown) became a Top Ten hit as part of Britain&amp;#039;s booming acid jazz scene, prompting the release of Incognito&amp;#039;s second album overall, Inside Life. It was largely a studio affair, with Maunick and engineer Simon Cotsworth directing a large cast with many of the best musicians in Britain&amp;#039;s fertile groove community.\nWith 1992&amp;#039;s Tribes Vibes + Scribes, Maunick added a more established vocalist, the American Maysa Leak. A cover of Stevie Wonder&amp;#039;s &quot;Don&amp;#039;t You Worry &amp;#039;Bout a Thing&quot; became another Incognito hit, and the album ascended Britain&amp;#039;s pop charts even as it rose on America&amp;#039;s contemporary jazz charts. The third album, Positivity, became the group&amp;#039;s biggest album success, with much attention across Europe as well as Britain. Leak unsuccessfully attempted a solo career with Blue Note, leading to the temporary vocal replacement Pamela Anderson (not the Baywatch pinup) on 1995&amp;#039;s 100Â° and Rising. Leak returned, though, appearing on the following year&amp;#039;s Beneath the Surface.\nIncognito later expanded its discography with 1996&amp;#039;s Remixed, 1998&amp;#039;s Tokyo Live, and 1999&amp;#039;s No Time Like the Future. The group&amp;#039;s next two albums were again made without Leak, 2001&amp;#039;s Life Stranger Than Fiction and 2003&amp;#039;s Who Needs Love, which featured Brazilian vocalist Ed Motta. Leak returned for 2004&amp;#039;s Adventures in Black Sunshine. Bees + Flowers + Things appeared at the end of 2006. The album was a mix of cover versions along with re-recordings of four Incognito classics. \n\nReview\n\nI could not find a review for this album. if anyone can please post it, This is a good funky album, the track &quot;always there&quot; is on the money, but in all i would recomend this album well worth a listen.\n\nEnjoy.","torrent":{"xt":"urn:btih:17fb9b3898360ee7dfe950fff38c300274b9250c","amp;dn":"Incognito+-+Inside+Life+-+%281991%29%5BFLAC-EAC-CUE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17fb9b3898360ee7dfe950fff38c300274b9250c","infoHashBuffer":{"type":"Buffer","data":[23,251,155,56,152,54,14,231,223,233,80,255,243,140,48,2,116,185,37,12]},"announce":[],"urlList":[]}}