{"title":"easyHDR PRO 2.22.1 [Multi][Patch BRD]","uid":8610837,"size":9173441,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:18a0ba73b0b25af45e49bd7b863554a9471bb852&amp;dn=easyHDR+PRO+2.22.1+%5BMulti%5D%5BPatch+BRD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WSI","files":-1,"time":1372130284,"description":"With easyHDR PRO, get your digital photos closer to what you've seen with your own eyes. Say goodbye to unwanted over- and underexposures. EasyHDR PRO was created to be a useful and reliable image processing program which produces High Dynamic Range images.\n\nYou will get neat results even if the photos are taken in very difficult lighting conditions. A HDR image is produced from a sequence of photos taken with different exposure settings. It has to be tone mapped, so it can be displayed on a computer screen or printed. If the photos are taken hand-held (without a tripod) the photo alignment tool (automatic as well as manual) can be used. \n\nWith the manual tool it is possible to compensate for shift, rotation, scale and perspective misalignments. The final result can be further post-processed with build-in filters, which include: sharpening, blur, noise removal, white balance as well as selective color tone modification. The program is capable of importing various file formats: JPEG, TIFF, FITS (used in astrophotography cameras), Radiance RGBE (HDR image) and nearly all digital camera RAW formats, by all vendors.\n \nIf you have hundreds of photos to process you'll also find batch processing very useful. Just create a task list, start processing and wait for the results.\n\nInfo:\n\n- Install, don't run apps\n- Copy Patch to install dir and apply\n &lt;a href=&quot;\nhttp://img96.imageshack.us/img96/3831/klux.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img96.imageshack.us/img96/3831/klux.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:18a0ba73b0b25af45e49bd7b863554a9471bb852","amp;dn":"easyHDR+PRO+2.22.1+%5BMulti%5D%5BPatch+BRD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18a0ba73b0b25af45e49bd7b863554a9471bb852","infoHashBuffer":{"type":"Buffer","data":[24,160,186,115,176,178,90,244,94,73,189,123,134,53,84,169,71,27,184,82]},"announce":[],"urlList":[]}}