{"title":"Carl Hiaasen - Flush","uid":4646162,"size":310356817,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1932a796a73248b832355a39019b4e1c4dd834d3&amp;dn=Carl+Hiaasen+-+Flush&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"g-roid","files":-1,"time":1231887644,"description":"FLUSH\nBy: Carl Hiaasen\nRead by: Michael Welch\n\nNoah's dad has a little problem with anger control. He tried to stop the Coral Queen casino boat's illegal dumping...by sinking the boat.\n\nBut his bold protest fizzles: Within days the casino is back in business, and Noah's dad is behind bars and out of action. Now Noah is determined to succeed where his father failed. But even though pumping raw sewage Into the waters of the Florida Keys is both gross and against the law, turns out it's near impossible to catch the flusher-especially when he's already bamboozled the prosecutors, the local press, and even the Coast Guard.\n\nBut Noah's got a few allies of his own. There's his little sister, Abbey, an unreformed childhood biter; Lice Peeking, a half-soused ex-mate of the Coral Queen who is willing to testify...for a price; and Shelly, a bighearted bartender with even bigger biceps.\n\nOkay, so the odds aren't good. But Noah has an ace up his sleeve-a plan so crazy it just might stop the polluting, save the beaches, and prove to the world that it's the owner of the Coral Queen, and not his dad, who is full of...crud.\n\nCarl Hiaasen has been writing about Florida since his father gave him a typewriter at age six. Then it was hunt-and-peck stories about neighborhood kickball and softball games. Now Hiaasen writes a column for the &quot;Miami Herald&quot; and is the author of many bestselling novels for adults, including &quot;Basket Case&quot; and &quot;Skinny Dip&quot;. &quot;Hoot&quot;, Hiaasen's first novel for young readers was the recipient of numerous awards, including the prestigious Newbery Honor.\n\nFrom 5 CDs in MP3 Format.\n\nRecommended for listeners age 10 and up.","torrent":{"xt":"urn:btih:1932a796a73248b832355a39019b4e1c4dd834d3","amp;dn":"Carl+Hiaasen+-+Flush","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1932a796a73248b832355a39019b4e1c4dd834d3","infoHashBuffer":{"type":"Buffer","data":[25,50,167,150,167,50,72,184,50,53,90,57,1,155,78,28,77,216,52,211]},"announce":[],"urlList":[]}}