{"title":"[TBox] Dragon Ball Z Full 1-291(Subbed Jap Vers)","uid":4541975,"size":68325751016,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:19412b762e9f664117a7b0cbfe927908fd691a4d&amp;dn=%5BTBox%5D+Dragon+Ball+Z+Full+1-291%28Subbed+Jap+Vers%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"armygreen","files":337,"time":1227977714,"description":"Here they are.  Every episode of the original Dragonball Z episodes numbered 1-291 unedited, uncut, in Japanese, and with English subtitles.  And it only took 3 weeks of searching several hours a day every day to find them.\n\nI don&amp;#039;t remember what site I got this from.  I&amp;#039;m still downloading the files right now, actually.  When I finish I plan on seeding for a very long time, considering how long it takes to download all of these files.\n\nA few notes:\n\nSome of the vids are in AVI format and some are in OGM format.  I haven&amp;#039;t downloaded any of the OGM files yet, only the AVI&amp;#039;s.  I have a little over a week left of downloading before I&amp;#039;m completely finished.\n\nNow, for the AVI files, at least, it may not seem like the subtitles work for you.  It seemed that way for me at first.  I did some research and found out about CCCP.  Just google it.  It should be the top link.  After you download it and run the executable file to install it, it&amp;#039;ll ask you if you want to install the video players as well.  Put a check mark in the Media Player Classic box.  You can go ahead and check the other player also if you&amp;#039;d like.\n\nMedia Player Classic is the only program I&amp;#039;ve found that will play the subtitles that come with this torrent.  Otherwise you&amp;#039;ll have to find and download the subtitles in .srt format seperately.  And most likely you&amp;#039;ll end up having to manually sync every d@amn subtitle line in every file just to get them to sync with the videos properly.\n\nOnce I&amp;#039;ve downloaded some of the OGM files, I&amp;#039;ll let you guys know how the subtitles on those run.\n\nA suggestion:\n\nI wasn&amp;#039;t sure how import the .NFO file was to running the vids so I put that and the SAMPLE.AVI files on high priority.  Once those were downloaded I put the first episode on high priority and everything else on low priority.  I&amp;#039;ve continued doing that with each subsequent file.  Doing this will allow you do download the first episodes first and the last episodes last rather than downloading everything at once, so you can start watching sooner.\n\nI plan to continue seeding for a very long time once I finish downloading all the files.  I mean, how could I deny anyone such a wonderful thing?  I hope everyone else does the same.","torrent":{"xt":"urn:btih:19412b762e9f664117a7b0cbfe927908fd691a4d","amp;dn":"%5BTBox%5D+Dragon+Ball+Z+Full+1-291%28Subbed+Jap+Vers%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19412b762e9f664117a7b0cbfe927908fd691a4d","infoHashBuffer":{"type":"Buffer","data":[25,65,43,118,46,159,102,65,23,167,176,203,254,146,121,8,253,105,26,77]},"announce":[],"urlList":[]}}