{"title":"The Legacy of Parmenides.pdf","uid":4896275,"size":16146177,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1999c977c9bf80f64ddc0b1a2b792e04508baeac&amp;dn=The+Legacy+of+Parmenides.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gorra09","files":1,"time":1242344491,"description":"Here's what the publisher has to say. I don't necessarily endorse all the statements that follow:\n\nParmenides of Elea was the most important and influential philosopher before Plato. Patricia Curd here reinterprets Parmenides' views and offers a new account of his relation to his predecessors and successors.\n\nIn the traditional interpretation, Parmenides argues that generation, destruction, and change are unreal and that only one thing exists. He therefore rejected as impossible the scientific inquiry practiced by the earlier Presocratic philosophers. But the philosophers who came after Parmenides attempted to explain natural change and they assumed the reality of a plurality of basic entities. Thus, on the traditional interpretation, the later Presocratics either ignored or contradicted his arguments. In this book, Patricia Curd argues that Parmenides sought to reform rather than to reject scientific inquiry and offers a more coherent account of his influence on the philosophers who cameafter him.\n\nThe Legacy of Parmenides provides a detailed examination of Parmenides' arguments, considering his connection to earlier Greek thought and how his account of &quot;what-is&quot; could serve as model for later philosophers. It then considers the theories of those who came after him, including the Pluralists (Anaxagoras and Empedocles), the Atomists (Leucippus and Democritus), the later Eleatics (Zeno and Melissus), and the later Presocratics (Philolaus of Croton and Diogenes of Apollonia). The book closes with a discussion of the importance of Parmenides' views for the development of Plato's Theory of Forms.\n","torrent":{"xt":"urn:btih:1999c977c9bf80f64ddc0b1a2b792e04508baeac","amp;dn":"The+Legacy+of+Parmenides.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1999c977c9bf80f64ddc0b1a2b792e04508baeac","infoHashBuffer":{"type":"Buffer","data":[25,153,201,119,201,191,128,246,77,220,11,26,43,121,46,4,80,139,174,172]},"announce":[],"urlList":[]}}