{"title":"ORPHAN #8 - Kim van Alkemade","uid":12892692,"size":1290160,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a1d84fbc605d9712f5c25341f4fd88ef05bf43f&amp;dn=ORPHAN+%238+-+Kim+van+Alkemade&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1449146371,"description":"ORPHAN #8 - Kim van Alkemade | EPUB\r\n\r\nIn this stunning new historical novel inspired by true events, Kim van Alkemade tells the fascinating story of a woman who must choose between revenge and mercy when she encounters the doctor who subjected her to dangerous medical experiments in a New York City Jewish orphanage years before.\r\n\r\nIn 1919, Rachel Rabinowitz is a vivacious four-year-old living with her family in a crowded tenement on New York City’s Lower Eastside. When tragedy strikes, Rachel is separated from her brother Sam and sent to a Jewish orphanage where Dr. Mildred Solomon is conducting medical research. Subjected to X-ray treatments that leave her disfigured, Rachel suffers years of cruel harassment from the other orphans. But when she turns fifteen, she runs away to Colorado hoping to find the brother she lost and discovers a family she never knew she had.\r\n\r\nThough Rachel believes she’s shut out her painful childhood memories, years later she is confronted with her dark past when she becomes a nurse at Manhattan’s Old Hebrews Home and her patient is none other than the elderly, cancer-stricken Dr. Solomon. Rachel becomes obsessed with making Dr. Solomon acknowledge, and pay for, her wrongdoing. But each passing hour Rachel spends with the old doctor reveal to Rachel the complexities of her own nature. She realizes that a person’s fate—to be one who inflicts harm or one who heals—is not always set in stone.\r\n\r\nLush in historical detail, rich in atmosphere and based on true events, Orphan #8 is a powerful, affecting novel of the unexpected choices we are compelled to make that can shape our destinies.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:1a1d84fbc605d9712f5c25341f4fd88ef05bf43f","amp;dn":"ORPHAN+%238+-+Kim+van+Alkemade","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a1d84fbc605d9712f5c25341f4fd88ef05bf43f","infoHashBuffer":{"type":"Buffer","data":[26,29,132,251,198,5,217,113,47,92,37,52,31,79,216,142,240,91,244,63]},"announce":[],"urlList":[]}}