{"title":"FEAR Perseus Mandate [pcgame-Eng-Ita] [Tntvillage]","uid":6482202,"size":4263149568,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1abaefeade13f2f6b0ff0160e4929885496e18e4&amp;dn=FEAR+Perseus+Mandate+%5Bpcgame-Eng-Ita%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"maxmalu6601","files":1,"time":1308567580,"description":"F.E.A.R. Perseus Mandate\n\n[img]http://img232.imageshack.us/img232/9081/coxc.jpg[/img]\n\nData di Uscita: 16.11.2007\nSviluppato da Monolith\nPubblicato da Vivendi Universal\nDistribuito da Vivendi Universal \nSupporto: 1 DVD5\nGenere: Simulazione Sparatutto\nLanguage: English - Italiano\n\n\nDescrizione:\nF.E.A.R. Perseus Mandate ÃƒÂ¨ la seconda espansione per il mitico gioco F.E.A.R. che potrete giocare senza il bisogno del gioco originale. In questa espansione prenderete i panni di un nuovo personaggio che si troverÃƒÂ  sempre ad Armacham in una storia parallela all'originale F.E.A.R. che vi permetterÃƒÂ  di capire nuovi sviluppi e a capire la storia da un punto di vista diverso da quello originale. Il vostro compito in questa nuova avventura sarÃƒÂ  di scoprire cosa ÃƒÂ¨ Perseus e cosa comporta quel progetto tanto segreto. Vi troverete contro dei nuovi nemici, nuove paure e nuove armi in questa tenebrosa e difficile espansione. - Espansione stand alone per cui non avrete bisogno della versione originale del gioco per giocare. - Scoprite i misteri nascosti ad Armacham e le veritÃƒÂ  del progetto Perseus. - Affrontate nuove orribili nemici, i Nightcrawler. - Nuove armi da usare tra cui la Chain Lighting Gun, un lancia granate e un Fucile di Precisione superpotenziato. - Un nuovo modo multigiocatore immediato che vi permetterÃƒÂ  di entrare subito nel vivo dell'azione. - Supporto Multigiocatore fino a 16 giocatori e una Intelligenza Artificiale completamente migliorata.\n\nDescription:\nPerseus Mandate is the second standalone storyline expansion to the award winning first person shooter franchise F.E.A.R. Fight fear with F.E.A.R. as you take point in a brand new team experiencing a new incident at Armacham with a story line that runs parallel to F.E.A.R. and Extraction Point revealing a new perspective of the event. Your job in this new adventure is to find out what Perseus is and why the Nightcrawlers have been called in to collect it before you can.\n\n[img]http://img190.imageshack.us/img190/9148/96894384.jpg[/img]  [img]http://img813.imageshack.us/img813/8572/94845648.jpg[/img]\n\n[img]http://img225.imageshack.us/img225/1250/77460025.jpg[/img]  [img]http://img839.imageshack.us/img839/7372/58601443.jpg[/img]\n\nVisit the YouTube link:\n\n\nInstallazione:\n1. Monta o masterizza il file immagine.\n2. Installa il gioco. Quando richiesto inserisci questo seriale: TAP9-WAB6-CAG3-MES7-6983\n3. Copia il file dalla cartella NO_DVD e incollalo nella directory di installazione del gioco sovrascrivendo quando richiesto.\n4. Buon Divertimento.\nPer convertire testi e lingua in italiano eseguire il file che si trova nella cartella &quot;FEAR.Perseus.Mandate.Traduzione.FULL.iTALiAN&quot; assicurandosi che la conversione abbia la stessa directory del gioco installato.\nNota: Se avete problemi a lanciare il gioco con l'icona sul desktopo (ho notato che questo puo avvenire se non si ÃƒÂ¨ connessi a internet), eseguite il gioco direttamente dal file &quot;FEARXP2&quot; che si trova nella directory di installazione del gioco.\n\nInstallation:\n1. Mount or burn the image file. \n2. Install the game. When prompted enter the serial-TAP9 WAB6-CAG3-MES7-6983 \n3. Copy the file from the folder and paste it into NO_DVD the game installation directory, overwriting when prompted. \n4. Have fun. \n\nNote: If you have trouble launching the game with the icon on the desktop (I have noticed that this can happen if you are not connected to the Internet), run the game directly from the file 'FEARXP2' located in the installation directory of the game.\n\nIl gioco ÃƒÂ¨ stato testato su windows XP\n\nRequisiti di sistema minimi:\nSistema Operativo: Windows XP/Vista\nProcessore: Pentium 4 1.7 GHz o AMD equivalente\nRAM: 512 MB\nScheda Video: GeForce con 64 MB di memoria o Radeon dalla serie 9000 in su\nDirectX 9.0C\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:1abaefeade13f2f6b0ff0160e4929885496e18e4","amp;dn":"FEAR+Perseus+Mandate+%5Bpcgame-Eng-Ita%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1abaefeade13f2f6b0ff0160e4929885496e18e4","infoHashBuffer":{"type":"Buffer","data":[26,186,239,234,222,19,242,246,176,255,1,96,228,146,152,133,73,110,24,228]},"announce":[],"urlList":[]}}