{"title":"[SoM]Viola bacia tutti[DvdRip-Divx-Ita-Mp3]","uid":4907030,"size":600915968,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1ae17f541367b7fade5b75873d9a18c630f95d31&amp;dn=%5BSoM%5DViola+bacia+tutti%5BDvdRip-Divx-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1242947300,"description":"\n\n\nTre ragazzi sui trent'anni, Samuele, Max e Nicola partono a bordo di un camper per una vacanza estiva senza una meta precisa, un giorno a Rimini sull'Adriatico un altro a Viareggio sul Tirreno. Ma mentre stanno per uscire da Roma, Viola, una ragazza che ha appena rapinato una banca, si intrufola nel camper per sfuggire alla polizia. Sale sul tetto e lÃƒÂ¬ rimane nascosta, finchÃƒÂ©, alla prima sosta, quando i ragazzi escono, si fa vedere, li minaccia con la pistola e li prende come ostaggi. All'inizio, di fronte alla pistola puntata, i tre pensano bene di non contraddirla. Poi, lungo strade poco frequentate tra Marche e Toscana, Viola si dimostra un po' impacciata, tutt'altro che violenta, e i quattro cominciano a parlare tra loro. Viola allora rivela che ha il compito di consegnare il bottino della rapina, alcune monete di inestimabile valore, a ricettatori di sua conoscenza. Dopo qualche perplessitÃƒÂ , i ragazzi, tutti e tre attratti dalla sua bellezza, si lasciano convincere e decidono di aiutarla e accompagnarla. Comincia un'avventura che li porta a conoscere luoghi e persone che non avrebbero mai pensato di incontrare. Dopo aver contattato una certa Sibilla, arrivano al nord, nella fattoria di uno strano tipo, Giotto, la cui segretaria, Amanda, dÃƒÂ  loro istruzioni di recarsi in Svizzera per l'incontro conclusivo. Qui giunti, si accorgono che i maiali hanno mangiato le monete. Tutto ÃƒÂ¨ finito, insieme tornano a Viareggio e qui si separano. I ragazzi riprendono il viaggio col camper, ma Viola, a loro insaputa, ÃƒÂ¨ di nuovo sul tetto.","torrent":{"xt":"urn:btih:1ae17f541367b7fade5b75873d9a18c630f95d31","amp;dn":"%5BSoM%5DViola+bacia+tutti%5BDvdRip-Divx-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ae17f541367b7fade5b75873d9a18c630f95d31","infoHashBuffer":{"type":"Buffer","data":[26,225,127,84,19,103,183,250,222,91,117,135,61,154,24,198,48,249,93,49]},"announce":[],"urlList":[]}}