{"title":"Eggert-London-Lizenz zum Toten(London terrorist attacks)(2005)","uid":4746524,"size":2054126,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1be0e548462302b9691ec3f4d2f9c20477c42721&amp;dn=Eggert-London-Lizenz+zum+Toten%28London+terrorist+attacks%29%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1235914690,"description":"For english-only speaking:\nThis booklet is in german language. English title would be: London - The licence to kill - Involvement of intelligence services in terrorism (2005). On 7.7.2005 a terrorist attack in London kills over 50 people and wounds hundreds more. To this day are the causes of this bloody attack unknown. Scotland Yard is convinced they were just another suicide act of crazy Islamic terrorists who want to spread their hatred against the west. But Wolfgang Eggert doesn't think so at all as he not only found facts that contradict this but also link them straight to British and American intelligence services. Terror in the name of the state? It would certainly not be the first time this happened. Find out what &quot;licence to kill&quot; really means these days. 95 pages.\n\nFur Deutschsprachige:\nDer 7. Juli 2005 wird den meisten noch gut in Erinnerung sein: An jenem Tag explodierten mitten in London Bomben. Sie rissen in drei U-Bahnen und einem Bus 54 Menschen in den Tod, verletzten mehr als 100 zum Teil schwer. Schon wenige Tage spÃƒÂ¤ter stand fÃƒÂ¼r Scotland Yard fest: Es handelte sich um vier SelbstmordattentÃƒÂ¤ter, die vermutlich im Namen der Al-Kaida gebombt hatten. Keine importierten Terroristen, sondern bis dato unbescholtene und bestens integrierte Briten, deren ethnische Wurzeln in muslimischen LÃƒÂ¤ndern lagen. Soweit die Fakten. Wolfgang Eggert, Politologe und frei schaffender Historiker aus MÃƒÂ¼nchen, der als Kenner der Geheimdienstszene und radikalreligiÃƒÂ¶ser Netzwerke gilt, hat sich in seinem neuesten Buch mit den Ermittlungen befasst und WidersprÃƒÂ¼chliches zutage gefÃƒÂ¶rdert. Es sind Details, die aufhorchen lassen. Das beginnt schon bei der schnellen Identifizierung der angeblichen TÃƒÂ¤ter. Von ihnen lieÃƒÅ¸en die Bomben nichts ÃƒÂ¼brig - abgesehen von ihren Ausweispapieren. Auch die Unbescholtenheit der TÃƒÂ¤ter lieÃƒÅ¸ Eggert keine Ruhe: liebevolle VÃƒÂ¤ter und EhemÃƒÂ¤nner, beruflich erfolgreich, gesellschaftlich akzeptiert. Wieso sollten sich diese MÃƒÂ¤nner selbst tÃƒÂ¶ten und andere Menschen umbringen, ohne Abschiedsbriefe an ihre Familien? Und wieso kauften die angeblichen SelbstmordattentÃƒÂ¤ter fÃƒÂ¼r die Zugfahrt Luton-London RÃƒÂ¼ckfahrttickets und zahlten fÃƒÂ¼r einen Langzeitparkplatz? Zur Tarnung? Wozu? Gegen die MÃƒÂ¤nner bestand keinerlei Verdacht. Eggert nahm auch das von Scotland Yard verÃƒÂ¶ffentlichte Foto, das die angeblichen AttentÃƒÂ¤ter beim Betreten des Bahnhofs Luton zeigt, unter die Lupe. Ob die Figuren tatsÃƒÂ¤chlich erst nachtrÃƒÂ¤glich in das Bild integriert wurden, kÃƒÂ¶nnen nur Experten beurteilen. Doch eine Beobachtung macht stutzig: AuÃƒÅ¸er den angeblichen TÃƒÂ¤tern ist keiner zu sehen. Und das um 7.21 Uhr, mitten im Pendlerverkehr an einem gut frequentierten Bahnhof. Die Liste der WidersprÃƒÂ¼che ist erschreckend lang. Manchem Leser mag Eggerts Beiwerk, das sich mit den Verstrickungen britischer und amerikanischer Geheimdienste in die Islamistenszene beschÃƒÂ¤ftigt, zu sehr in die Sparte VerschwÃƒÂ¶rungstheorie abgleiten. Doch selbst wenn man das beiseite lÃƒÂ¤sst, keimt nach der LektÃƒÂ¼re der Verdacht auf, von den Londonern Ermittlern in die Irre geleitet worden zu sein. 95 Seiten.\n","torrent":{"xt":"urn:btih:1be0e548462302b9691ec3f4d2f9c20477c42721","amp;dn":"Eggert-London-Lizenz+zum+Toten%28London+terrorist+attacks%29%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1be0e548462302b9691ec3f4d2f9c20477c42721","infoHashBuffer":{"type":"Buffer","data":[27,224,229,72,70,35,2,185,105,30,195,244,210,249,194,4,119,196,39,33]},"announce":[],"urlList":[]}}