{"title":"Mo Yan - Frog","uid":13371155,"size":333615696,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1c9bbb06000d0c9de17e132fad0432b5302a16ec&amp;dn=Mo+Yan+-+Frog&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":11,"time":1454200482,"description":"A NEW YORK TIMES TOP BOOK OF 2015\r\n\r\nWASHINGTON POST NOTABLE BOOK\r\n\r\nThe author of Red Sorghum and China’s most revered and controversial novelist returns with his first major publication since winning the Nobel Prize. In 2012, the Nobel committee confirmed Mo Yan’s position as one of the greatest and most important writers of our time. In his much-anticipated new novel, Mo Yan chronicles the sweeping history of modern China through the lens of the nation’s controversial one-child policy.\r\n\r\nFrog opens with a playwright nicknamed Tadpole who plans to write about his aunt. In her youth, Gugu—the beautiful daughter of a famous doctor and staunch Communist—is revered for her skill as a midwife. But when her lover defects, Gugu’s own loyalty to the Party is questioned. She decides to prove her allegiance by strictly enforcing the one-child policy, keeping tabs on the number of children in the village, and performing abortions on women as many as eight months pregnant.\r\n\r\nIn sharply personal prose, Mo Yan depicts a world of desperate families, illegal surrogates, forced abortions, and the guilt of those who must enforce the policy. At once illuminating and devastating, it shines a light into the heart of communist China","torrent":{"xt":"urn:btih:1c9bbb06000d0c9de17e132fad0432b5302a16ec","amp;dn":"Mo+Yan+-+Frog","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c9bbb06000d0c9de17e132fad0432b5302a16ec","infoHashBuffer":{"type":"Buffer","data":[28,155,187,6,0,13,12,157,225,126,19,47,173,4,50,181,48,42,22,236]},"announce":[],"urlList":[]}}