{"title":"Bitwig Studio 1.0.3","uid":9844762,"size":129679360,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1cb88e2553f691352b8821e711c93bebb8c09872&amp;dn=Bitwig+Studio+1.0.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cabolombo","files":1,"time":1396053795,"description":"Bitwig Studio is a dynamic software solution for music creation and performance to realize all of your musical ideas in every stage of production.\nFrom sound design to music creation, discover the new standard in customized workflow. Bitwig Studio inspires you to take greater control of your productions, giving you access to every aspect of your workflow as needed. Streamline your creative process and quickly take your music from ideas to complete songs, tracks and compositions. With Bitwig Studio, youÎ“Ã‡Ã–re in command of a workflow that works best for you.\n\nRecord and arrange, improvise and perform, or do it all at once. Choose between several display profiles. Design your own sounds with dedicated container devices. Combine built-in instruments, effects, and VST plug-ins. Bitwig StudioÎ“Ã‡Ã–s unified mapping system allows you to modulate any device or VST parameter using macro controls and modulator devices.\n\nExplore a new world of creative possibilities, including audio and note expressions, histogram-based value editing, layered editing, extensive bounce-in-place functions, automatic slicing, smart controller integration, and the Open Controller Scripting API. Every feature in Bitwig Studio was developed by musicians, for musicians. Welcome to the next generation of music creation and performance software for Windows, Mac OS X, and Linux.\n\n\nChanges in Bitwig Studio 1.0.3\n\n\nFIXED\tCrash when somehow managing to start an event drag and drop interaction without clicking on the event.\nFIXED\tCrash sometimes when stopping overdubbed looped clip recording on arranger.\nFIXED\tDragging files from external application on windows causes threads to leak and eventual out of memory error\nFIXED\tPressing Esc when renaming a track still edits the track's name\nFIXED\tCrash if delete a track that user is droppig a clip onto before the clip has finished loading\nFIXED\tCrash when scanning some shell VST plugins.\nFIXED\tCrash when reading SF2 files with a sample index which is out of range.\nFIXED\tCrash when tapping ctrl with nothing focused\nFIXED\tSome audio interfaces doesn't get detected\nFIXED\tCrash when dragging pitch expression event with shift modifier.\nFIXED\tCrash when toggling solo for a drum pad in a drum machine that is in a slot of a container device\nFIXED\tPreview warp marker are sometimes shown at the wrong location.\nFIXED\tAudio engine crashed sometimes when deleting a VST plugin device with it's window open on Mac OSX\nFIXED\tCrash when reversing audio that has not finished loading.\nFIXED\tCrash when showing a popup window on Linux if the window manager sent focus in or out notifications to the popup window\nFIXED\tCrash when making arranger time selection and then dragging from the automation lane instead of the clip header\n\n\nSometimes their servers are down, so here it is.","torrent":{"xt":"urn:btih:1cb88e2553f691352b8821e711c93bebb8c09872","amp;dn":"Bitwig+Studio+1.0.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cb88e2553f691352b8821e711c93bebb8c09872","infoHashBuffer":{"type":"Buffer","data":[28,184,142,37,83,246,145,53,43,136,33,231,17,201,59,235,184,192,152,114]},"announce":[],"urlList":[]}}