{"title":"GUNSMOKE 134-136 [retr?tv]","uid":3960855,"size":546805807,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1ccf655c1b57d65f302e0632248c2414c71ec09e&amp;dn=GUNSMOKE+134-136+%5Bretr%3Ftv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flixer","files":4,"time":1199440355,"description":"GUNSMOKE 134-136\n\n34. CHESTER&amp;#039;S MAIL ORDER BRIDE (7/14/1956)\nChester has been having a correspondence romance with a Miss Ann Smithwright and she&amp;#039;s agreed to marry him. Problem is that instead of his own picture, Chester has sent her a picture of Matt.\nGuest star: Ken Curtis (Festus), Bert Rumsey (Sam, Bartender) , Joel Ashley (Linus), Russ Thoron (Brady), William Hamel (customer), Bert Ramsy (Sam), Mary Carver (Ann Smithwright), Joel Ahley (Nate Linus), Russell Thorson (Brady, Pinkerton Agent), Fred Carson (Buffalo Hunter)\n\n35. THE GUITAR  (7/21/1956)\nWeed Pindle is a rather mild mannered wandering guitar player who is in Dodge. A couple of the rowdier cowboys have started having fun at his expense getting him drunk. When they find out he fought for the Union in the 3rd Illinois Cavalry their fun turns serious and they are set on hanging the peaceful player. Chester and some of the other citizens are just as determined to prevent it.\nGuest star: Charles Gray (Gene Tyler), Duane Grey (Delmer), Joseph Mell (Bill Pence), Bert Rumsey (Sam, Bartender) , Aaron Spelling (Weed Pindle), Bill Hall (Tom), Charles Sray (Tyler), Jacques Aubuchon (Augie Short)\n\n36. CARA  (7/28/1956)\nCara, Matt&amp;#039;s old flame from Yuma turns up in Dodge but she may be a scout sent by bank robber, Jack Tolliver.\nGuest star: Howard Culver (Mr. Uzzel) , Charles Webster (Sheriff Benson), Douglas Odney (Tolliver), Jorja Curtright (Cara), Wilfred Knapp (Sam Botkin) \n\nXviD/528x384/23.98fps\nMP3/48kHz/792bps/26min\n\nThree more to the end of Season 1. Leave a comment if you&amp;#039;d like to see more! :)","torrent":{"xt":"urn:btih:1ccf655c1b57d65f302e0632248c2414c71ec09e","amp;dn":"GUNSMOKE+134-136+%5Bretr%3Ftv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ccf655c1b57d65f302e0632248c2414c71ec09e","infoHashBuffer":{"type":"Buffer","data":[28,207,101,92,27,87,214,95,48,46,6,50,36,140,36,20,199,30,192,158]},"announce":[],"urlList":[]}}