{"title":"The War Between The Generals","uid":11691285,"size":3851433,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1db206608fbe4061cddb9bf0652087fe3db794fe&amp;dn=The+War+Between+The+Generals&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"HowdyDooDoo","files":1,"time":1423550643,"description":"This is one of the great untold stories of our time - that of the little band of generals entrusted with a historic task: invading and liberating Nazi-occupied Europe. They were supposed to be fighting the Germans, but some of their fiercest battles were fought against each other. At the center was the Supreme Commander himself, Dwight D. Eisenhower - sincere, indecisive, desperate to hold the Alliance together. Against him was Field-Marshal Bernard Montgomery, who strove ceaselessly to gain authority. Cavilling against them both were the others - the outrageous Patton, the dogged Bradley, the bomber barons like Spaatz, Vandenberg, and Butcher Harris, and Trafford Leigh-Mallory. After the war, there was a cover-up. Not until David Irving began his research did the full truth emerge. Among his unexpected discoveries was the wickedly candid diary of the obscure general who was Eisenhower s eyes and ears . Through this and other private accounts we see the war as the generals lived it - squabbling over perks and preferences, taking their mistresses with them on to the battlefield, and there are revelations about General Patton that will amaze. There are other surprises - General de Gaulle s use of torture upon his fellow Frenchmen is one, and a clear attempt by the Allies to get rid of him is another. This book is a history of command. It shows how the ambitions and personalities of the men at the top affect the course of a war and the lives of the ordinary mortals in the field","torrent":{"xt":"urn:btih:1db206608fbe4061cddb9bf0652087fe3db794fe","amp;dn":"The+War+Between+The+Generals","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1db206608fbe4061cddb9bf0652087fe3db794fe","infoHashBuffer":{"type":"Buffer","data":[29,178,6,96,143,190,64,97,205,219,155,240,101,32,135,254,61,183,148,254]},"announce":[],"urlList":[]}}