{"title":"King Arthur and Chivalry","uid":7970839,"size":265861062,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1df1a82ec053a62394d0a54195e37b247bc58c7d&amp;dn=King+Arthur+and+Chivalry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kukamonga","files":24,"time":1356834653,"description":"These 24 lectures, taught by the editor of the only scholarly quarterly in the world devoted solely to Arthurian lore, invite you to explore the time-honored and timeless legends of King Arthur and their links to the world of chivalry in the literature of the Middle Ages. Professor Bonnie Wheeler shows why she has won teaching award after teaching award as she blends historical analysis with the study of literature to heighten your understanding of both. Professor Wheeler offers this searching lecture series on the great chivalric romances of the Middle Ages and their tales of knightly quests, courtly love, and an extraordinary place called Camelot. These lectures trace the development of the chivalric mentality in literature and thought from the Middle Ages to modern times. You discuss texts including: \n\n- The Dream of Rhonabwy \n- The Song of Roland \n- Andreas Capellanus's On Love \n- Poem of My Cid \n- Silence \n- Chretien de Troyes's Erec and Enide, Yvain, and Lancelot \n- Sir Gawain and the Green Knight \n- Malory's Le Morte Darthur. \n\n\n&quot;As a teacher,&quot; says Professor Wheeler, &quot;I never meet anyone who can talk to me for more than two minutes about King Arthur and Camelot without asking, Is it true?' &quot;In response, I often want to quote Winston Churchill: And more and better, besides!' &quot; There are few figures in literature as compelling as Arthur and his knights. Why? &quot;In contrast to the starkly individual heroism of ancient epic, Arthur's world is one where there are many different heroes, where each can be heroic in a special way,&quot; notes Professor Wheeler. &quot;This gives Camelot and the Round Table a unique and original appeal that is still strong today. &quot;This is important and fascinating because chivalric life itself was so closely modeled on literature, on the stories of Arthur and his court,&quot; she continues. Drawing from folklore, archaeology, history, and literary studies, Dr. Wheeler evaluates knighthood and chivalry as historic institutions and ideals. Then she builds on that understanding in order to shed light on the great Arthurian stories that we have inherited from the High Middle Ages and which continue to fascinate readers today. \n\nLecture titles\n\n01. Arthur in History and Legend \n02. In Search of Arthur \n03. The Land and Its Stories \n04. The Matter of Britain \n05. Two Welsh Tales \n06. Dreaming Arthur \n07. Honor, Shame, and Largesse \n08. Knighthood and How It Grew \n09. The Lover's Curriculum \n10. The Round Table in French \n11. Lancelot and Guenevere \n12. Yvain, the Knight of the Lion \n13. Gender Bending in French Romance \n14. Fearful Festivals \n15. The Game of Blame, the Comedy of Shame \n16. Malory's Vision of History \n17. The Pentecostal Oath \n18. The Return to Rome \n19. &quot;He Passed All Other Knyghtes&quot; \n20. The Arthurian Golden Boy \n21. Sir Tristram and the Anxiety of Chivalry \n22. The Quest for the Grail \n23. Passion and Loss \n24. To the Isle of Avalon ","torrent":{"xt":"urn:btih:1df1a82ec053a62394d0a54195e37b247bc58c7d","amp;dn":"King+Arthur+and+Chivalry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1df1a82ec053a62394d0a54195e37b247bc58c7d","infoHashBuffer":{"type":"Buffer","data":[29,241,168,46,192,83,166,35,148,208,165,65,149,227,123,36,123,197,140,125]},"announce":[],"urlList":[]}}