{"title":"Waterfront CD - mp3 -320Kb/s HI-FI(Original) -manolito2112","uid":7516693,"size":109845987,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:20172f380f566b440b527ed982e6b8a862bdbff6&amp;dn=Waterfront+CD+-+mp3+-320Kb%2Fs+HI-FI%28Original%29+-manolito2112&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1344492776,"description":"In 1987, Waterfront were signed directly to EMI/SBK Productions by Charles Koppelman and Marty Bandier. The band went on to achieve chart success on both sides of the Atlantic. Waterfront was signed directly to Polydor via David Munns, the now ex- Vice Chairman &amp; CEO of EMI Records.\n \nThey operated in a similar musical style as This Way Up and Climie Fisher. The band were signed to Polydor Records, and were best known for their 1989 UK No. 17 hit single (and U.S. No. 10 hit), &quot;Cry&quot;. Waterfront followed up &quot;Cry&quot; in the U.S. with another single, &quot;Nature Of Love&quot;, which hit No. 70 on the Billboard Hot 100.[1]\n \nThey released their debut album, Waterfront, in 1989 with eventual sales reaching in excess of 600,000 worldwide. They are the first Welsh duo to achieve top 10 single status in the US and were named BMI Songwriters of the year in 1990. &quot;Cry&quot; was awarded as one of the 'most played singles on US radio' at the BMI 50th Anniversary Celebrations in Los Angeles, with the song now approaching one million plays on radio, resulting in membership to BMI's Million-Air Club.[citation needed]\n \nIn 1992, Chris Duffy released a solo album and single, also on Polydor Records, both entitled &quot;All The Time In The World&quot;. The album contained three tracks co-written with Phil Cilia.\n \nIn May 2000, Duffy and Cilia reunited as Waterfront at the Kashmir Klub/BMI Showcase in London, England, a concert that was broadcast on the internet. The group performed tracks like &quot;Valentine's Day&quot;, &quot;Cowboy Dreaming&quot;, and &quot;Kingdom Comes&quot;.[2]\n \nIn 2007, the reunited Waterfront secured single of the week for a two week period on the O2/Napster mobile download portal, with a new acoustic alternative country track, &quot;Valentine's Day&quot;.\n \nAs of 2009, the band were recording songs for an upcoming album release, samples of which were available on their Myspace page. According to this, &quot;The new material takes Waterfront in a completely new adult contemporary direction - allowing Phil and Chris to draw on their alternative country influences (Ryan Adams, Keith Urban, Bruce Springsteen, Tom Petty, Lucinda Williams, Counting Crows and the Wallflowers)&quot;.[3]\n \nThe new CD album entitled Ghosts Of The Good was released by Chordamundo Records in November 2011 and it includes 11 tracks and a lot of collaboration from contributing musicians, such as Jamie Crompton (ex-Suzi Quatro band lead guitarist). There are ten new songs and then a bonus 'country makeover' release of their 1987 hit &quot;Cry&quot;.\n","torrent":{"xt":"urn:btih:20172f380f566b440b527ed982e6b8a862bdbff6","amp;dn":"Waterfront+CD+-+mp3+-320Kb%2Fs+HI-FI%28Original%29+-manolito2112","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20172f380f566b440b527ed982e6b8a862bdbff6","infoHashBuffer":{"type":"Buffer","data":[32,23,47,56,15,86,107,68,11,82,126,217,130,230,184,168,98,189,191,246]},"announce":[],"urlList":[]}}