{"title":"The Deadly Ones - It's Monster Surfing Time (1964) [Music for H","uid":5139990,"size":27038855,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:20effbb1cb2aca4425e791b34096788730edc0eb&amp;dn=The+Deadly+Ones+-+It%5C%27s+Monster+Surfing+Time+%281964%29+%5BMusic+for+H&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":19,"time":1256833573,"description":"The Deadly Ones - It's Monster Surfing Time (1964) [Music for Hellowen]\nCD (2001) To MP3 128 mbit/s\nIncluded: CD &amp; LP Covers and this Info\n\nThe Deadly Ones - It's Monster Surfing Time (Collectables)  Reviewed by DJ Johnson\nFrom the first wave of surf, this 1964 oddball remains one of the best examples of how surf music can work as Halloween party music. It needs help, of course, and that help came in the form of howls, screams, and evil voices saying any number of strange things. Originally released on Vee Jay Records (you remember, the little indie that was the only label in America with the intelligence to put out the first Beatles record) it has been dusted off and released on CD by Collectables, and it sounds maaaahvelous. The voices are infinitely clearer as they moan such things as &quot;there's a creature in the surfer's lagoon,&quot; &quot;hey, got a match?,&quot; &quot;Igor, quit tormenting the sharks and get back on your surfboard!&quot; or &quot;oh please!!! Make it stop!!&quot; Hey, guy, I feel your pain, but the CD keeps playing. It may be the simplest of 60s surf, but it's decorated for Halloween and I'm in the mood. \n\nTracklist:\n01. It's Monster Surfin' Time  (Joe South)\n02. Outer Limits Surf  (Joe South)\n03. There's A Creature In The Surfer's Lagoon  (Joe South)\n04. Surfin' Dock Side  (J. Sullivan and F. Arnold)\n05. The Mad Drummer [Pt. 1]  (C.Thomas, E.Thomas)\n06. The Mad Drummer [Pt. 2]  (C.Thomas, E.Thomas)\n07. Raunchy  (Bill Justis, Manker)\n08. Rebel Rouser  (Duane Eddy, Lee Hazelwood)\n09. The Moonlight Surfer  (Ray Whitley)\n10. Help  (Joe South)\n11. Igor Goes Surfing\t(J. Sullivan and F. Arnold)\n12. The Lone Surfer  (Joe South)\n\n\nThe Deadly Ones - It's Monster Surfing Time  Label: Vee Jay VJLP 1090 12   Reviewed by Phil Dirt http://www.leftfield.org/~reverb/reviews/d/deadly1850.html\nThis is a grand example of gimmick studio projects of the sixties. Unlike the &quot;Rat Fink&quot; mung, this has moments of brilliant instrumental surf with an edge and a unique flavor. Some of the originals here were written by (and reportedly performed by) Joe South (&quot;Polk Salad Annie&quot;). Most notable is &quot;The Lone Surfer,&quot; melodically interesting enough to have been adopted as a regular part of the Berzerkers' set for the last decade. Super rare, and worth the hunt. 3 stars\n\n&quot;It's Monster Surfing Time&quot; 3 stars\nOpening with a Bobby &quot;Boris&quot; Picket-like intro, this borrows heavily on &quot;Comin' Home Baby,&quot; and uses the same kind of swirly vibrato-tremolo effect Paul Johnson often used on Challengers/Good Guys sessions. It's a tasty sidetrip.\n\n&quot;Outer Limits Surf&quot; 3 stars\nNo, it's not the Mar-Ketts tune. It's a mid tempo rocker an infectious rhythm track. The melody line is an interesting and pleasurable journey through the studio scene. It's a Joe South tune with a country underpinning.\n\n&quot;There's A Creature In The Surfer's Lagoon&quot; 3 stars\nJoe South's work here is marginal. From the moronic intro, it quickly drops into an uninspired jam.\n\n&quot;Surfin' Dockside&quot; 3 stars\nJ. Sullivan and F. Arnold wrote this, and these boys morphed it into a plucky semi surf epic. It's more country than surf I suppose, but then again, what's a studio band know? Still, the bouncy plucking is fun, and the ultra echoed glissandos are pretty weird.\n\n&quot;The Mad Drummer Part I&quot; 3 stars\nMonster laughing, George of the Jungle percussion, a suave exotic melody, and an infectious rhythm. This was written by C. and E. Thomas. It sounds like a refugee from the big band era brought up to date (for 1964). The &quot;Bat Man&quot; bits in the break are nifty. The drums are excellent, but I don't know who it was. It sounds a little like Earl Palmer.\n\n&quot;The Mad Drummer Part II&quot; 3 stars\nMore in the same vein, but more distinct &quot;Bat Man&quot; references, and an organ lead. Nowhere near as interesting, but if the two parts were actually joined, it would work fine, 'cuz the last half of this is much like part I.\n\n&quot;Raunchy&quot; 2 stars\nWeirdness, slow &quot;Raunchy&quot; accompanied by monster groaning and castanets, and you have Bill Justis rolling over in his grave.\n\n&quot;Rebel Rouser&quot; 3 stars\nA rough dry echoed glissando opens up this version of Lee Hazelwood's classic tune that Duane Eddy had such a hit with. Aside from the silly screams, this is a solid version, with tasty guitar work and ample energy.\n\n&quot;The Moonlight Surfer&quot; 4 stars\nRay Whitley wrote this melodic tune. the arrangement is excellent, with a rolling rhythm and subdued guitar tone. An excellent track to drive to, very fluid and a real feel of the open road.\n\n&quot;Help&quot; 3 stars\nJoe South penned this. It's not the Beatles tune. It's also more a Jerry McGee kinda country jam than a real song. It's infectious and fun, but not essential. It leans on Bo Diddley here and there as well as the Nashville trends of the day.\n\n&quot;Igor Goes Surfing&quot; 3 stars\nJ. Sullivan and F. Arnold wrote this, and the pluckiness of their other composition here is carried forward to this track. It's more a jam, and a bit jazzy, with the insipid monster yakking about the surf stuff thrown in.\n\n&quot;The Lone Surfer&quot; 4 stars\nJoe South's great tune, and this is really pretty surfy. the Berzerkers have had this in their set for many years. It's a bit sad, and very melodic, with a great beat and an infectious riff. Great glissandos! Very nice to have.","torrent":{"xt":"urn:btih:20effbb1cb2aca4425e791b34096788730edc0eb","amp;dn":"The+Deadly+Ones+-+It%5C%27s+Monster+Surfing+Time+%281964%29+%5BMusic+for+H","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20effbb1cb2aca4425e791b34096788730edc0eb","infoHashBuffer":{"type":"Buffer","data":[32,239,251,177,203,42,202,68,37,231,145,179,64,150,120,135,48,237,192,235]},"announce":[],"urlList":[]}}