{"title":"Command &amp; Conquer - Sole Survivor (Proper ISO by IcySon55)","uid":3571991,"size":621479869,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:219b266cd54b45bdae2735fa188de7cddae3f744&amp;dn=Command+%26+Conquer+-+Sole+Survivor+%28Proper+ISO+by+IcySon55%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IcySon55","files":7,"time":1165438751,"description":"Command &amp; Conquer - Sole Survivor\n\nThe most compelling elements of the Command &amp; Conquer series have been, without a doubt, its competitive multiplayer battles. With that in mind, it makes perfect sense that Westwood would attempt to take advantage of this strength by creating a C&amp;C game tailor-made for the Internet. Sounds like a foolproof concept, right? Not quite.\n\nC&amp;C: Sole Survivor has little in common with its popular relatives. Instead of commanding vast armies and managing resources, you are given control of only one unit chosen before entering combat. The units include a wide variety of NOD and GDI weaponry such as recon bikes, artillery, and a variety of infantry and tanks. You can even choose from several dinosaurs that were hidden in the original C&amp;C.\n\nEach unit has its own abilities and type of weapon. Some are fast and lightly armored, while others are slow-moving killing machines. All of these units are very vulnerable when they first enter the battlefield, making it a necessity to quickly pick up crates that enhance their speed, armor, health, weapon range, and reload speed. Once units are fully powered up, they are evenly matched, keeping the level of competition reasonably balanced. (Of course, it&amp;#039;s to your advantage to pick on those not as strong as you.) Nursing your unit to its full potential isn&amp;#039;t easy, however. As its abilities are strengthened, the likelihood of an &quot;ion attack&quot; (a laser shot by a deadly, unseen ion satellite) increases. This adds an annoying element to the game. Often, Sole Survivor forces you to decide if you should try to get one more crate and risk an ion death (forcing you to you respawn with the minimal amount of attributes) or play it safe and be content with your unit&amp;#039;s current abilities. Unfortunately, this gamble wears on the nerves. There are too many circumstances that can cause you to pick up a crate even when you don&amp;#039;t want to. For example, you could click in one spot of the map, and the computer may make your unit take a weird route through a crate in order to reach your destination. This forces you to painfully micromanage your unit&amp;#039;s movement around the map to avoid them. But sometimes that isn&amp;#039;t even good enough, as latency can force you to make a mistake and steer your unit right into a crate. Sole Survivor has three modes of gameplay. They are similar and share the same play mechanics but are different enough to affect your unit selection. The most basic mode is the free-for-all, where it&amp;#039;s every unit for itself. The goal is to simply power up your vehicle so that you can kill anyone you see for points. While mindless killing is fun in multiplayer games such as Quake, it doesn&amp;#039;t work for this game. There&amp;#039;s little skill or interactivity involved in trying to gather a bunch of power-ups without being blasted by the ion cannon, and then pointing and clicking on the guy you want to kill. The player with the most points at the end of the time limit wins. This gets pretty boring after a few rounds, and most players will find themselves moving on to the other game modes.\n\nCapture the flag is the most involving because it requires precise teamwork to retrieve the flag from the opponent&amp;#039;s base defenses (obelisks and missile towers). Long-ranged units must destroy the defenses from a safe distance so fast units can make a break to get the flag while their stronger teammates provide cover. When groups of veteran players get together for a match, this mode is challenging and fun, but frankly, it doesn&amp;#039;t happen too often. If only a few inexperienced or foolish players join a team, it can become a big burden. Luckily, there is football, which is essentially a scaled down version of capture the flag that uses undefended goals instead of bases. Less team cooperation is needed, making it an easier game to play and learn. Problematic to these team games is that when players disconnect or just quit the game, Sole Survivor does nothing to compensate the team that suffers the loss. This leads to some woefully unbalanced teams (three vs. five, eight vs. two, etc.) that can ruin a game. Obviously, there isn&amp;#039;t much Westwood can do to make players communicate and work together, but it can easily provide handicaps to level the playing field for uneven teams.\n\nThe good news is that Sole Survivor has no monthly charge and that the product support is excellent. Westwood&amp;#039;s server is easy to use and even sponsors a &quot;ladder&quot; system that logs everyone&amp;#039;s points and deaths. Additionally, the game automatically downloads patches and updates itself when the user connects to the Westwood server, so it&amp;#039;s expected that the game will continue to evolve and improve as time wears on. Unfortunately, at this time, Sole Survivor is a simple and relatively shallow game that is only fun when every requisite (smart players, low lag, balanced teams) is met.\n\nBy Kraig Kujawa, GameSpot\n\n\nNotes:\n\nYou do not need to burn this to play it. Just mount it in a virtual drive. You also do not need to use the &quot;sole_102.exe&quot;. (It&amp;#039;s a NoCD crack I included, but you don&amp;#039;t actually need it.) Just install the game, then install the patches one by one in order (a,b,c). Don&amp;#039;t forget to put them in the game directory when installing them.\n\nSince Westwood died. online play with this game is no longer possible. Well, not until the new XWIS servers add support for this game, if ever.\n\nEnjoy the Practice mode. :)","torrent":{"xt":"urn:btih:219b266cd54b45bdae2735fa188de7cddae3f744","amp;dn":"Command+%26+Conquer+-+Sole+Survivor+%28Proper+ISO+by+IcySon55%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"219b266cd54b45bdae2735fa188de7cddae3f744","infoHashBuffer":{"type":"Buffer","data":[33,155,38,108,213,75,69,189,174,39,53,250,24,141,231,205,218,227,247,68]},"announce":[],"urlList":[]}}