{"title":"The Power of Gold The History of an Obsession.pdf","uid":4835612,"size":43400949,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21e602baf565b36cd09ef3184b40659c3bcc0c92&amp;dn=The+Power+of+Gold+The+History+of+an+Obsession.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Djofullinn","files":1,"time":1239305804,"description":"Amazon.com Review\nIn the first chapter of his book The Power of Gold, Peter Bernstein quotes the immortal words of King Ferdinand of Spain, who once declared: &quot;Get gold, humanely if possible, but at all hazards--get gold.&quot; As ensuing chapters reveal, man's obsession with finding, keeping, selling, and evaluating gold has rarely been a humane adventure and has always been a hazardous one. Digging deeply into history's treasury of torrid tales and complicated deals, Bernstein examines gold's lure with an economist's passion for quantification, a historian's eye for detail, and a sociologist's feel for its consequence.\nUseless as a metal for most practical purposes, gold originally held value as decoration and adornment for the wealthy ancients. Later, it was minted and used as coins by the Lydians in 635 B.C. That, Bernstein goes on to reveal, put gold on a path from the concrete to the abstract, from evidence of wealth to the standard behind wealth in other forms, and finally to the tenuous place it holds in today's virtual world of credit cards and computer chips. Along the way lie wild stories of lives destroyed, fortunes won and quickly lost, and values transformed: the massacre by the Spanish invader Pizarro, whose small band of men decimated the formidable army of Emperor Atahualpa, &quot;the Inca,&quot; through more duplicity than military skill; the roller-coaster ride of the 1890s, when the rippling impact of the Baring Brothers bank crisis in Britain sent the isolated United States into an economic meltdown; and the surplus of the Gold Coast natives of Timbuktu, who willingly traded their gold for much-needed salt, ounce for ounce.\n\nBernstein is a great storyteller. His accounts of mythological, ancient, and recent history ooze with odd and entertaining details that bring each successive tale of obsession to life. If not for his skill, the sheer volume of events collected here--presented more anecdotally than systematically--would be overwhelming. In the end, though, it is Bernstein's fascination with the power of gold to entangle and entrap its possessors, and its ultimate ability to change the course of entire eras and civilizations, that makes his book as fascinating as it is informative. A dense but entertaining read. --S. Ketchum --This text refers to an out of print or unavailable edition of this title. \n\nFrom Publishers Weekly\n&quot;[T]he quest for gold&quot; has been &quot;gluttonous,&quot; says Bernstein, tracing the metal's impact on human myth and history: gold has inspired art, battles, conquests and discoveries, including Columbus's trip to the New World, where he hoped to secure enough gold to buy back the Holy Sepulcher from the Muslims. Bernstein makes clear the metal's virtues: it's so malleable that one ounce can be stretched into a 50-foot wire or pounded into 100 square feet, and it lasts forever (4,500-year-old Egyptian dental work, he notes, is good enough for today's mouths). Bernstein's gift for storytellingAwith just the right touch of acerbic wit (on the myth of Jason and the Golden Fleece, he summarizes, &quot;The story does not have a happy ending, because Jason was a compulsive social climber&quot;)Aand his presentation of the paradox of how and why such a soft and simple metal has been afforded such value help make this work a winning account of human obsession, comprehensive, entertaining and enlightening. A knowledge of economics might help during the last third of the book, when Bernstein moves from ancient times to modern day and describes the economic chaos that followed WWI. By then gold was no longer the domain of legend; it had become a commodity, the standard against which powerful nations measure their wealth. But Bernstein, author of the bestselling Against the Gods: The Remarkable Story of Risk, livens up his intricate economic discussion with tales such as the one about the Harvard Business School professor who got into trouble with his dean for withdrawing his gold from the Harvard Trust Company during a gold standard-related panic in 1933. As the title promises, Bernstein does deliver a page-turning history of the not-so-heavy metal and its influence on people through the ages. $250,000 ad/promo; first serial to Worth. (Oct.) \nCopyright 2000 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title. ","torrent":{"xt":"urn:btih:21e602baf565b36cd09ef3184b40659c3bcc0c92","amp;dn":"The+Power+of+Gold+The+History+of+an+Obsession.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21e602baf565b36cd09ef3184b40659c3bcc0c92","infoHashBuffer":{"type":"Buffer","data":[33,230,2,186,245,101,179,108,208,158,243,24,75,64,101,156,59,204,12,146]},"announce":[],"urlList":[]}}