{"title":"Sniper Elite Nazi Zombie Army.Update.1-P2P","uid":8244760,"size":727910594,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:22a0b02b66ba01fef7278ec9271fcd020ca646eb&amp;dn=Sniper+Elite+Nazi+Zombie+Army.Update.1-P2P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Gh0stNet","files":26,"time":1363029958,"description":"Sniper Elite: Nazi Zombie Army (c) Rebellion\n\n : Release Date: 01-03-2013           :Game Type:    Action\n   Image Format: ISO                   DISCS: 1 DVD                               Protection: Steam+CEG\n\n ******************************\n**     **RELEASE NOTES**       **\n ****************************** \n\n Featuring a co-op campaign for 1 to 4  players,  Nazi  Zombie  Army  is  a\n horrifying new stand-alone expansion of  the  award-winning  Sniper  Elite\n series.\n In the dying flames of World War II, a  despairing  Hitler  unleashes  one\n final, unholy gamble - a legion of undead super soldiers that threatens to\n overwhelm the whole of Europe.\n You are Karl Fairburne - the sniper who shaped world history. You are  one\n of  the  last  living  souls  in  Germany.  You  must  team  up  or   die.\n American, German,  Russian  -  previous  military  allegiances  no  longer\n matter. Now it's just the living versus the dead.\n Only a Sniper Elite with nerves of steel and a steady aim stands a  chance\n against Hitler's Nazi Zombie Army!\n\n\n Features:\n\n * Battle through blood-drenched levels in a Berlin overrun by Hitler's\n   supernatural forces.\n * Adapt to harrowing new enemies - occult commanders, roof-jumping\n   snipers, undead suicide infantry and worse...\n * Test your sniping skills under extreme pressure, keep your cool, and\n   keep a boomstick handy - just in case.\n * For the first time in Sniper Elite history, battle your way through a\n   campaign built for up to four players.\n * Fight back-to-back with a German officer, a scientist and a Russian\n   soldier.\n * Work together or face annihilation - plan your positions, set your traps\n   and make your stand.\n * See every putrid lung burst, every rotten bone shatter with the return\n   of Sniper Elite's acclaimed X-Ray 'kill cam'.\n * Experience the genre-best sniping ballistics and precise controls that\n   made the series a best-seller.\n * Take into account gravity, wind, velocity, stability and more under the\n   pressure of the zombie onslaught. You don't want to miss.\n\n\n\nChangeLog:-\n----------\n \n-Fix for some users hanging on a black screen after launching game on steam.\n-Fix for when exiting the game it hangs for a long time before shutting down.\n-Quick Match: Fix allowing clients to ignore current host and search for another lobby.\n-Mission success screen - Various fixes with incorrect messages displayed.\n-Fixed AI colliding with incapacitated players.\n-Improvements to the bullet camera to show more multiple kills.\n-AI targeting improved to distribute target selection amongst multiple players.\n-Bullet camera frequency can now be set to NONE.\n-Fix for Occult General appearing almost invisible post a checkpoint restart.\n-Fixed Super Elite sliding around looking dead on clients.\n-Fix to stop other players from interrupting a resuscitation.\n-Fix to stop score farming on Occult General battle.\n-Fix to stop bullet cameras on resurrecting AI that was causing some t-posing.\n-Labyrinth: Fix to stop AI visibly teleporting into view in some sections.\n-Cathedral: Fix to stop Safe room door from not closing.\n-Cathedral: Fix to remove an invisible damage volume that was affecting players.\n-Subway: Fix to remove infinite spawning Snipers in end battle.\n\n ***************************** \n**   **Install Notes:**      **\n ***************************** \n-Copy and replace all the files in the root folder,\n-Overwrite when prompted\n-run the &quot;NZA.Update.bat&quot; bat\n-Play and Enjoy\n\n ******************************** \n**   **Additional Notes:**      **\n ******************************** \n \n* Patch is provided by Muffl0n (cs.rin.ru)\n* Used the ali213 crack thanks.\n\nNote:-\n\nAdd Steam_API.dll to exclusion list as some antiviruses may show it as a false positive.   ","torrent":{"xt":"urn:btih:22a0b02b66ba01fef7278ec9271fcd020ca646eb","amp;dn":"Sniper+Elite+Nazi+Zombie+Army.Update.1-P2P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22a0b02b66ba01fef7278ec9271fcd020ca646eb","infoHashBuffer":{"type":"Buffer","data":[34,160,176,43,102,186,1,254,247,39,142,201,39,31,205,2,12,166,70,235]},"announce":[],"urlList":[]}}