{"title":"Atmosphere Deluxe 6.0","uid":3981591,"size":67084300,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:22a97ad11db78d49fc057c271a58f206b7bd7a9d&amp;dn=Atmosphere+Deluxe+6.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"electroacoustic","files":2,"time":1200586749,"description":"Atmosphere (Ambient Soundscape Generator) is extremely easy to use, whether you simply want to sit back and listen to the relaxing soundscapes or want to create professional quality natural sound based CDs or MP3s. You don&amp;#039;t need any experience of audio editing should you wish to use the program to create your own recordings.\n\nYou can select between the inbuilt soundscapes with one click or create your own soundscape from scratch within minutes.\n\n\nFeatures:\n\n\nCreate your own CDs of MP3s of natural soundscapes exactly how YOU like them.\nRealtime playback through speakers or headphones.\n\n\nCreate natural sound effects for video productions, outdoor events and public places / exhibitions.\n\n\nTransfer your recordings to MP3 player to take with you to listen to anywhere - During plane\nflights, on the train, hotel rooms etc.\n\n\nRecord to Wav or MP3 format - No sound editing experience required.-\n\n\nRelax\n\nChoose from over 40 inbuilt soundscapes or create your own\nCreate ever changing and evolving soundscapes\nInclude only the sounds you prefer\nSelect from 16 binaural brainwave tracks to create personalized brain entrainment sessions.\nAdd slideshows and scrolling panoramic images to accompany the nature sounds\nAutochange scenarios automatically according to schedule\nAdd audio from MP3 or CD to accompany the nature sounds\nDownload expansion sound and image packs from our registered users area\nInclude your own sounds and images in the program.\n\n\n\nRecord\n\nCreate professional royalty free sounds of nature and wellness CDs from start to finish\nExtremely easy to use - No experience with sound editing is required\nRecord to Wav or MP3 format\n10 band EQ and 12 band reverb for precision control\nAdd music or spoken audio from your favorite MP3s or CD tracks and record them mixed with the soundscapes.\nAdd fade in and out to final recordings.\nSelect from 16 binaural brainwave tracks to create brain entrainment CDs or MP3s","torrent":{"xt":"urn:btih:22a97ad11db78d49fc057c271a58f206b7bd7a9d","amp;dn":"Atmosphere+Deluxe+6.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22a97ad11db78d49fc057c271a58f206b7bd7a9d","infoHashBuffer":{"type":"Buffer","data":[34,169,122,209,29,183,141,73,252,5,124,39,26,88,242,6,183,189,122,157]},"announce":[],"urlList":[]}}