{"title":"Tony Monaco - Five Albums - Jazz Organ","uid":4904722,"size":514898627,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:237a639d624d16d96546ad6d450652affccd821f&amp;dn=Tony+Monaco+-+Five+Albums+-+Jazz+Organ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"L_Hammond","files":-1,"time":1242832054,"description":"Tony Monaco - Five Albums - Jazz Organ\n\n\nIf you like jazz organ, and lots of jazz organ blues of the highest calibre, this one is for you!\n\n\nList of included albums:\n\n2001 Burnin' Grooves\n2003 A New Generation (with Joey DeFrancesco)\n2004 Fiery Blues\n2006 East To West\n2008 Live At The Orbit Room\n\n\nOne of the greatest honors in a Jazz Musician's life is to be voted in the Downbeat Magazine Critics polls and readers polls. In 2005, Tony was blessed to be a voted in both polls and in January 2006, he was also voted by Jazztimes Readers as being in the top 4! &quot;The readers polls really touched me because it means that I have gained some respect from my fans and that they dig my playing. Also the fact that they would consider me to be worthy of being included to the list of other great jazz organist who have helped shape me into what I've always wanted to be 'A Jazz Organist'.&quot;\n\nTony, born in 1959, started playing the accordion when he was eight years old. When he was twelve, he was given a Jimmy Smith album and instantly knew that Jazz Organ was his calling. Tony began to play in jazz night clubs around Columbus, Ohio while he was still learning the art of the Hammond B-3 organ. He was influenced by hometown organists such as Hank Marr and Don Patterson. Tony's newfound fascination led him to jazz organ legends Jimmy McGriff, Richard 'Groove' Holmes, Charles Earland, Jack McDuff, and Dr. Lonnie Smith. Here he found an unlimited source of inspiration.\n\nOn Tony's sixteenth birthday, he received a phone call from Jimmy Smith. This was a great honor and really boosted his enthusiasm as an organist. Jimmy Smith continued to give Tony jazz organ secrets over the phone while Tony was playing around Columbus. When he was twenty, Jimmy Smith invited Tony to come play with him at his club in Woodland Hills L.A., California. An experience Tony would never forget; Tony finally got to play in front of the master of the jazz organ.\n\nIn April 2000, Tony met jazz organist Joey DeFrancesco while Joey was playing in Columbus, Ohio. The two of them became instant friends. Joey recognized Tony's talents right away and offered to produce a CD for him. Tony was thrilled at this wonderful opportunity. He flew out to Joey's house in Arizona to begin recording 'Burnin' Grooves'. Tony recorded with Byron Landham on drums and Paul Bollenback on guitar. He also recorded a few tracks with Joey, who was on either piano or trumpet. Burnin' Grooves sparked international attention. The success of the recording served as the catalyst for regional and national tours.\n\n----------\n\nMP3 format. All songs are tagged by the book.\n\nIf you encounter errors during the file sharing, please, place this material as close to the root of the hard disk as possible and restart the file sharing (e.g. as close as possible to C: in Windows). This is in order to make the path (drive, directory and filename) as short as possible. Operating systems have limits regarding how long a path including the filename can be, and if this limit is exceeded there will be errors.\n\n----------","torrent":{"xt":"urn:btih:237a639d624d16d96546ad6d450652affccd821f","amp;dn":"Tony+Monaco+-+Five+Albums+-+Jazz+Organ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"237a639d624d16d96546ad6d450652affccd821f","infoHashBuffer":{"type":"Buffer","data":[35,122,99,157,98,77,22,217,101,70,173,109,69,6,82,175,252,205,130,31]},"announce":[],"urlList":[]}}