{"title":"Darren Hayes - Insatiable   (2nafish)","uid":5319957,"size":153190404,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:246057b23a3e41799e9447c7fe89613c1a583171&amp;dn=Darren+Hayes+-+Insatiable+++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1264836876,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Insatiable&quot; is the debut solo single released by Australian singer Darren Hayes, former lead singer of the band Savage Garden, in 2002.\n\nThe music video is directed by Alek Keshishian and has Darren Hayes looking at videos of an actress that he is infatuated with. The video shows Darren Hayes has allowed his hair to grow and is blonde (which is his natural hair color).\n\nThe protagonist of the song describes his love for an actress and how his love for her is insatiable. The songs lyrics are very sexual and use euphemisms with erotic overtones.\n\nThere are three major versions of the single; the Limited Edition and Parts one and two (or CD1 and CD2). The Limited Edition of the single was only available for the first week of release before the other two versions were made available.\n\nDarren Stanley Hayes (born 8 May 1972) is an Australian singer-songwriter. Hayes debuted in 1996 as the frontman and singer of the pop duo Savage Garden, whose 1997 album Savage Garden propelled them to superstardom. It spawned the singles &quot;I Want You&quot;, &quot;To the Moon and Back&quot;, and the airplay number-one &quot;Truly Madly Deeply&quot;. The duo followed the success of their debut album with Affirmation (1999), which also produced several hits such as &quot;I Knew I Loved You&quot;, &quot;The Animal Song&quot; and &quot;Crash and Burn&quot;. Savage Garden sold more than 23 million albums worldwide before parting ways in 2001.\n\nHayes released his first solo album Spin in 2002. The album sold two million copies worldwide, debuted at #2 in the UK album charts and spawned the hit single &quot;Insatiable&quot;. Hayes' second solo album The Tension and the Spark marked a big change of direction for the singer-songwriter, showing him experimenting with electronica and darker lyrics. NME wrote about Hayes and the first single from the album, Popular saying it was &quot;A twistered masterclass in career reintervention...This guy is a genius.&quot; While the UK Observer said &quot;This album is no folly and succeeds, often to the point of all out triumph, on its own terms.&quot; Hayes parted way with his record company in 2006 and started his own independent record label Powdered Sugar, from which he would release his third solo album This Delicate Thing We've Made (2007). Including his work with Savage Garden, Hayes has sold more than 25 million albums worldwide.\n\nSpin is the first solo album from the ex-Savage Garden member Darren Hayes. The album was mixed by Chris Lord-Alge and produced by Walter Afanasieff. It was released in Australia in March 2002 and reached the rest of the world later that year. The album has sold 4 million copies as of 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:246057b23a3e41799e9447c7fe89613c1a583171","amp;dn":"Darren+Hayes+-+Insatiable+++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"246057b23a3e41799e9447c7fe89613c1a583171","infoHashBuffer":{"type":"Buffer","data":[36,96,87,178,58,62,65,121,158,148,71,199,254,137,97,60,26,88,49,113]},"announce":[],"urlList":[]}}