{"title":"Auschwitz: Plain Facts: A Response to Jean-Claude Pressac","uid":11720985,"size":2942202,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:248f751d62b2911c5c9200e9e478c96707821e11&amp;dn=Auschwitz%3A+Plain+Facts%3A+A+Response+to+Jean-Claude+Pressac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424815606,"description":"With two major works on the Auschwitz concentration camp, French pharmacist Jean-Claude Pressac tried to refute revisionists with their own technical methods. Whereas his first work remained rather obscured, Pressac's second book on The Technique of Mass Murder was praised by the mainstream in Europe, and they proclaimed victory over the revisionists. But they did not reckon with the revisionists... In &quot;Auschwitz: Plain Facts,&quot; Pressac's works are subject to a detailed and devastating critique by leading revisionist scholars. Although Pressac deserves credit for having made accessible many hitherto unknown documents, his writings could not refute the revisionists, because Pressac violated many scientifi c principles: Neither did Pressac adhered to scientific nor to formal standards when interpreting documents: He made claims that he either could not prove or which contradict the facts. Many documents he quoted do not state what he claimed they do. But most importantly: He did not pay any attention to &quot;the technique&quot; of the mass murder at issue, as his books claim. Neither do his books contain references to technical or scientific literature, nor are there any technical consideration in them. In fact, he reveals such a massive technical incompetence that his works belong into the category of novels rather than history. Despite these deficiencies, Pressac is still hailed as the savior of the Auschwitz-Holocaust by the mainstream. &quot;Auschwitz: Plain Facts&quot; is a must read for all those who want to argue against the lies and half truth of established historiography. With contribution by Germar Rudolf, Serge Thion, Robert Faurisson, and Carlo Mattogno","torrent":{"xt":"urn:btih:248f751d62b2911c5c9200e9e478c96707821e11","amp;dn":"Auschwitz%3A+Plain+Facts%3A+A+Response+to+Jean-Claude+Pressac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"248f751d62b2911c5c9200e9e478c96707821e11","infoHashBuffer":{"type":"Buffer","data":[36,143,117,29,98,178,145,28,92,146,0,233,228,120,201,103,7,130,30,17]},"announce":[],"urlList":[]}}