{"title":"Wasteland (DC Comics anthology series)","uid":5401367,"size":446078220,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:24ad2762e5efd7b45d9d2e5f45cbd750d64286d8&amp;dn=Wasteland+%28DC+Comics+anthology+series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jollyship33","files":20,"time":1267438654,"description":"Wasteland was an American anthology-style horror comic book published by DC Comics in 1987-1989 and intended for adult readers. The series lasted 18 issues.\n\nEach issue (with the exception of the book-length final issue) consisted of three unrelated stories written by John Ostrander or Del Close (or both, in collaboration) and a team of four artists (at any given time), one of whom would illustrate the three stories in each issue, the fourth supplying that month's cover (which had no direct connection to the interior contents). Members of the rotating crew of artists included Don Simpson, David Lloyd, William Messner-Loebs and Timothy Truman. One special issue included only the artwork of Joe Orlando.\n\nFor the most part, the series avoided the sort of gory shock associated with the twist ending horror comics typified byTales from the Crypt and The Twilight Zone television series in favor of more unpredictable and ambivalent stories. The themes of alienation and psychological dread often occurred, mixed with grotesque black humor, absurdism and social and political commentary in the form of satire.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:24ad2762e5efd7b45d9d2e5f45cbd750d64286d8","amp;dn":"Wasteland+%28DC+Comics+anthology+series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24ad2762e5efd7b45d9d2e5f45cbd750d64286d8","infoHashBuffer":{"type":"Buffer","data":[36,173,39,98,229,239,215,180,93,157,46,95,69,203,215,80,214,66,134,216]},"announce":[],"urlList":[]}}