{"title":"Lure Of The Temptress [GoG]","uid":8399896,"size":14792661,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2510a01913f5ab561a684f2e85e0258e0f058573&amp;dn=Lure+Of+The+Temptress+%5BGoG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"GOG-Upp","files":2,"time":1366669221,"description":" &lt;a href=&quot;http://www.gog.com/gamecard/lure_of_the_temptress&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.gog.com/gamecard/lure_of_the_temptress&lt;/a&gt;\n\nWhat's cool about it:\nA captivating story set in grim, medieval times\nThe old-school feel of a classic adventure game\nMany interesting characters that move about freely and live out their own lives, thanks to the Virtual Theatre system\nOverview:\nTrouble is afoot in the once peaceful land of Turnvale. Skori warriors (vicious mercenaries under the control of the mysterious Temptress) have arrived. But who is the Temptress, and more importantly, where is she?\n\nFrom the creators of the Broken Sword series, Revolution Software, comes the first in a series of 'Virtual Theater' adventure game. Non-playable characters will walk around and perform different actions regardless of your interaction with them. There is a variety of options and commands, including the possibility of interaction with a supporting character, whom you can give orders in order to solve some of the game's puzzles.\n\nLure of the Temptress has an intuitive point and click system. Everything you need to do (movie, talk, search and fight) is controlled via the mouse and its two buttons. It's all you need to explore a large and complex game world with over 60 screens to explore... more than 25 intriguing characters to interact with... and of course, Selena - the Temptress.\n\n\n-------------\n\nIF YOU HAVE ANY REQUESTS, PLEASE WRITE THEM IN COMMENTS, ENJOY AND DON'T FORGET TO SEED IT BACK.","torrent":{"xt":"urn:btih:2510a01913f5ab561a684f2e85e0258e0f058573","amp;dn":"Lure+Of+The+Temptress+%5BGoG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2510a01913f5ab561a684f2e85e0258e0f058573","infoHashBuffer":{"type":"Buffer","data":[37,16,160,25,19,245,171,86,26,104,79,46,133,224,37,142,15,5,133,115]},"announce":[],"urlList":[]}}