{"title":"Customized Optimized Personilized Windows 7 8 8.1 10 Start Menu","uid":15379736,"size":1019854,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:25908f945103ff14df53de637c79a7f240605fc8&amp;dn=Customized+Optimized+Personilized+Windows+7+8+8.1+10+Start+Menu+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rafaway00","files":1,"time":1469220783,"description":"Edition 01 July 2016\r\n \r\nThe complete text it's inside.\r\n \r\nIf your computer does not have RafaWay and you don’t want to install RafaWay, we recommend install in a second SSD/Hard drive, so you don’t need to reformat your computer. In order to convince you to install RafaWay, here we will give you a little bit of the functionalities without the need to reformat your computer. For example: \r\nRafaWay Shortcut:\r\n1). StartMenu: On ‘’RafaWay Shortcut’’ folder or zipped folder (C:RafaWayMore or RafaWay Programs), there is varies Windows and Microsoft Office® shortcuts versions. The Microsoft Office® shortcuts only work if you have or installed the same version corresponding to the ‘’Office Shortcut RafaWay’’ within the start menu and it it’s also necessary to remove the shortcut created by Office installation. The standard M. Office® Shortcut within the RafaWay start menu is 2016. If you install an earlier version, remove the shortcut, and copy the correct shortcut version to the start menu. Use the ‘’shortcut startmenu all users’’ to open your start menu folders.  Copy to the ‘’All User menu’’, so other users accounts will have the same start menu. Choose your preferred ‘’RafaWay shortcuts folders startmenu’’ and copy to your computer ‘’start menu’’\r\n2). Quick Launch/‘’Taskbar’’: Copy the RafaWay folder to drive C:/ (recommended), go to the taskbar and click on the options/toolbar/new taskbar/ and add one of the subfolders ‘’QL’’ that  you liked. Uncheck ‘’lock the taskbar’’/. Click in the ‘’two arrows’’-‘’taskbar’’ options and uncheck ‘’Show Text’’/’’show title’’.\r\n3). Links: Copy the shortcuts of the ‘’Links’’ folder to the ‘’Links’’ folder of your computer. In Windows 10 ‘’Links’’ will not appear in the side of Windows Explorer.\r\n4). The ‘’FirefoxPortable’’ and ‘’ThunderbirdPortable’’ highly customized it’s in RafaWay folder  you copied earlier to Drive C:/, or copy it now. It has many uses, one of them is to have another Gmail account without needing logging in and logging out.\r\n5). How to Install Firefox and Thunderbird highly customized on your computer:                                                  A). Install Firefox and Thunderbird if you don’t have it.                                                                                        B). Export bookmarks.                                                                                                                                    C). Close Firefox and Thunderbird.\r\nAttention: Firefox and Thunderbird cannot be opened until you have finished all operations. Although writing the Firefox and Thunderbird in one text, Firefox folder must be copied to another Firefox referent, and the Thunderbird folder should be copied to another Thunderbird referent folder. We recommend to complete one program processes before beginning the other. It’s your choice if you want to install both (Firefox and Thunderbird) or just one of them.\r\nD) Cut all subfolder profile files with similar name &quot;n2qigvhv.default&quot; which is found in:                                                                                                                                                               C:Users[your name]AppDataRoamingMozillaFirefoxProfiles                                              C:Users[your name]AppDataRoamingThunderbirdProfiles                                                                        Or use the shortcut ‘’Profile Firefox’’ and ‘’Profile Thunderbird’’\r\nCreate two folders BackupOldFireFox, BackupOldThunderbird and Paste the files. \r\nE) Copy the profile files of the portable version:                                                 RafaWayFirefoxPortableDataprofile\r\nRafaWayThunderbirdPortableDataprofile\r\nPaste in the profile subfolder with the similar name of &quot;n2qigvhv.default&quot; which is found in:\r\nC:Users[your name]AppDataRoamingMozillaFirefoxProfiles                                              C:Users[your name]AppDataRoamingThunderbirdProfiles \r\nIn case the bookmarks you exported previously are yours, import now. \r\nDone!","torrent":{"xt":"urn:btih:25908f945103ff14df53de637c79a7f240605fc8","amp;dn":"Customized+Optimized+Personilized+Windows+7+8+8.1+10+Start+Menu+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25908f945103ff14df53de637c79a7f240605fc8","infoHashBuffer":{"type":"Buffer","data":[37,144,143,148,81,3,255,20,223,83,222,99,124,121,167,242,64,96,95,200]},"announce":[],"urlList":[]}}