{"title":"The Mathematics of Medical Imaging: A Beginners Guide","uid":6532629,"size":4597736,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25ac532ac19ea3775230c9e2e556b0b10ef6ab8b&amp;dn=The+Mathematics+of+Medical+Imaging%3A+A+Beginners+Guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1310401162,"description":"Timothy G. Feeman, &quot;The Mathematics of Medical Imaging: A Beginners Guide&quot; \n S,..ger | 2009 | ISBN: 0387927115 | 141 pages | PDF | 4.38 MB \n\n This text explores medical imaging, one of the most significant areas of recent mathematical applications, in a concise manner accessible to undergraduate students. The author emphasizes the mathematical aspects of medical imaging, including not only the theoretical background, but also the role of approximation methods and the computer implementation of the inversion algorithms.\n\n In twenty-first century health care, CAT scans, ultrasounds, and MRIs are commonplace. Significant computational advances, along with the development, design, and improvement of the machines themselves, can only occur in conjunction with a proper understanding of the mathematics. Some topics covered include x-rays, the Radon Transform, back projection, the Fourier Transform, filters and convolution, and discrete image reconstruction.\n\n This book is inherently interdisciplinary in nature, and therefore is appropriate for students of engineering, physics, and computer science, in addition to mathematics. A working knowledge of multivariable calculus, as well some basic knowledge of differential equations and basic linear algebra and matrix methods, are mathematical prerequisites.","torrent":{"xt":"urn:btih:25ac532ac19ea3775230c9e2e556b0b10ef6ab8b","amp;dn":"The+Mathematics+of+Medical+Imaging%3A+A+Beginners+Guide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25ac532ac19ea3775230c9e2e556b0b10ef6ab8b","infoHashBuffer":{"type":"Buffer","data":[37,172,83,42,193,158,163,119,82,48,201,226,229,86,176,177,14,246,171,139]},"announce":[],"urlList":[]}}