{"title":"EnigmaT Set Rips { Cuts } - February 11th, 2010","uid":5358873,"size":1075942997,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:25ca5269881367d473795ee95b81aea06c51c603&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+February+11th%2C+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":117,"time":1266035210,"description":" &lt;a href=&quot;http://enigmat.webhop.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://enigmat.webhop.net&lt;/a&gt;\n.\nJoin My Facebook Page for latest updates  --\n.\nEnigmaT Set Rips { Cuts } - February 11th, 2010.torrent\n.\n8 Ball - Momento (Cut From Emery Set)-enTc.mp3\nAbraham Leoga - Stability (Trance Arts Remix) (Cut From Suzy Set)-enTc.mp3\nAd Brown &amp; Matt Lange - Intercoastal (Cut From Jaytech Set)-enTc.mp3\nAdam Navel &amp; Elite Electronic - Existence (Abstract Vision Remix) (Set Rip)-enTc.mp3\nAfter Meridian &amp; Dave Costa feat. Cat Martin - Empty Spaces (Andrew Bennett's Last Time Mix) (TATW 306 Rip)-enTc.mp3\nAlaa - Kerala (Original Mix) (Cut From Tate Set)-enTc.mp3\nAlex Armes - Hypnotize (Deep Mix) (Cut From Emery Set)-enTc.mp3\nAllen &amp; Donaghy - Dark Matter (Cut From Haslam Set)-enTc.mp3\nAnemosphere - Kyra (Adam Nickey Remix) (Cut From Redstar Set)-enTc.mp3\nAnge &amp; Perception Of Sound - Touching The Sky (Jsoul Vocal Remix)(Cut From Jaytech Set)-enTc.mp3\nAspiration - Matilda (ASOT 442 Rip)-enTc.mp3\nAtlantis Ocean - Critical Mistake (Cut From PvD Set)-enTc.mp3\nBates45 - Daisy (Set Rip)-enTc.mp3\nBissen - Skylands (TATW 306 Rip)-enTc.mp3\nBlue Magoo - Migrate (Cut From Spain Set)-enTc.mp3\nBoom Jinx &amp; Andrew Bayer - By All Means (Boom Jinx Remix) (Cut From Jaytech Set)-enTc.mp3\nBT Feat. Kirsty Hawkshaw - A Million Stars (Cut From Emery Set)-enTc.mp3\nChewLips - Karen (Mark Otten Vox Remix) (Cut From Yaz Set)-enTc.mp3\nChris Cortez - ASHA (Cut From Sherry Set)-enTc.mp3\nChris de Seed - Green Hills (Cut From Downey Set)-enTc.mp3\nCramp - Sliders (Original Mix) (Cut From Schossow Set)-enTc.mp3\nCressida - Two-O-Ten (Ronski Speed Pres. Sun Decade Mix) (Set Rip)-enTc.mp3\nDa Others &amp; Andrea Saenz - Cadence Not Back (Unplugged Mix) (ASOT 442 Rip)-enTc.mp3\nDave Horne Meets Econu - Occlusion (Cut From Powers Set)-enTc.mp3\nDavid Forbes - Katsu (Original Mix) (TATW 306 Rip)-enTc.mp3\nDBN - Chicago (Cut From Emery Set)-enTc.mp3\nDeportrance - Unforgettable (Original Mix) (Cut From Distant Ident Set)-enTc.mp3\nDigital Blonde - Damiana (Cut From J00F Set)-enTc.mp3\nDJ Ange - Seamless (Steve Anderson Edit) (Set Rip)-enTc.mp3\nDJ Choose - Hacksaw (Set Rip)-enTc.mp3\nDJ Choose - Silk Ceiling (Set Rip)-enTc.mp3\nDJ Feel &amp; Aurosonic Feat. Ale Haze - Feel (Abstract Vision &amp; Elite Electronic Dub Mix) (ASOT 442 Rip)-enTc.mp3\nDj Gard - Northern Lights (Cut From UzeYroS Set)-enTc.mp3\nDrama - Game Over (Original Mix) (Cut From Suzy Set)-enTc.mp3\nEnergy &amp; Reminder - Access Denied (Sonic Element Remix) (Cut From Suzy Set)-enTc.mp3\nEnergy &amp; Reminder - Emotions (ReOrder Remix) (Cut From Abstract Set)-enTc.mp3\nEverything But The Girl - Missing (DJ DLG Remix) (Cut From Sheperd Set)-enTc.mp3\nFRONT &amp; Rigel - Antares (Original Mix) (Cut From Saint-Jules Set)-enTc.mp3\nGordon Coutts - Firebird (John Gibbons &amp; Scimon Tist Remix) (Set Rip)-enTc.mp3\nGordon Coutts &amp; Owen Johnston - Beatroot (Cut From Coutts Set)-enTc.mp3\nGuy Mearns - Adaptation (Cut From Mearns Set)-enTc.mp3\nGuy Mearns - Skyscraper (Cut From Mearns Set)-enTc.mp3\nGuy Mearns - Stargazer (Cut From Mearns Set)-enTc.mp3\nGuy Mearns Feat. Nathalie - Forever (Cut From Mearns Set)-enTc.mp3\nHaris C - Symphony (Original Mix) (Cut From Suzy Set)-enTc.mp3\nJ. Michael Kober - Lost Moon (Cut From J00F Set)-enTc.mp3\nJames Best - Dancing With Ghosts (Cut From Coutts Set) (Ã‚Â´ÃƒÂ¯Ã‚Âª)-enTc.mp3\nJane Maximova - Switch (Costa Remix) (Cut From Abstract Set)-enTc.mp3\nJason Kinetic - Sidechained Melody (Set Rip)-enTc.mp3\nJaytech - In The Jungle (Set Rip)-enTc.mp3\nJDS - Nine Ways (Lee Haslam Remix) (Cut From Haslam Set)-enTc.mp3\nJohan Ekman - Reniscence (Original Mix) (Set Rip)-enTc.mp3\nJonas Stenberg Pres. Sunstate - Nightfall (Rough Mix) (Cut From Downey Set)-enTc.mp3\nKarybde &amp; Scylla - Reflexions Of Light (Trance Arts Remix) (Set Rip) (Ã‚Â´ÃƒÂ¯Ã‚Âª)-enTc.mp3\nKarybde &amp; Scylla - UNTITLED -Feb 2010- (Set Rip) (Ã‚Â´ÃƒÂ¯Ã‚Âª)-enTc.mp3\nKayosa &amp; Tolland - The Story (Cut From Haslam Set)-enTc.mp3\nKlauss Goulart - Lead Me Into The Night (Guy Mearns Remix) (Set Rip)-enTc.mp3\nKlauss Goulart - Misty (Fabio Stein's Uprise in 99' Mix) (Cut From Stein Set) (Ã‚Â´ÃƒÂ¯Ã‚Âª)-enTc.mp3\nKlopfgeister - Rice Krispies (Cut From J00F Set)-enTc.mp3\nKomytea - Kontadition (Mike Solar Edit) (Cut From Solar Set)-enTc.mp3\nLee Haslam - Har-Rumph (Cut From Stein Set)-enTc.mp3\nLee Osborne - Eight (Main Mix) (Cut From W&amp;W Set)-enTc.mp3\nLily Allen - The Fear (UNKNOWN Remix) (Cut From PvD Set)-enTc.mp3\nLuke Terry - Catanic (Cut From Powers Set)-enTc.mp3\nLuke Terry - Tears Of Disbelieve (Cut From PvD Set)-enTc.mp3\nM.I.K.E - Winter Nights in NYC (Cut From W&amp;W Set)-enTc.mp3\nMarc Enzo - Galvanised (Owen Johnston Remix) (Cut From Coutts Set) (Ã‚Â´ÃƒÂ¯Ã‚Âª)-enTc.mp3\nMarc Lener - Arctic Sun (Arjona vs CJ Peeton Remix) (Cut From Valentine Set)-enTc.mp3\nMarcus Schossow &amp; Robert Burian - Kofola (Rank 1 Remix) (Cut From Jong Set)-enTc.mp3\nMarzio Dance &amp; Luca Antollini - We Belong (Original Extended Mix) (Cut From Tydi Set)-enTc.mp3\nMatt Eray - Rise (Original Mix) (Cut From Distant Ident Set)-enTc.mp3\nMatt Eray - Sedona (Cut From Russ Jones Set) (Ã‚Â´ÃƒÂ¯Ã‚Âª)-enTc.mp3\nMatthew Dunne - Slingshot (Original Mix) (Cut From Stein Set)-enTc.mp3\nMike Levy - Optical Delusion (Original Mix) (Cut From Redstar Set)-enTc.mp3\nMimo - Will You Be There (Seamus Haji Remix) (Cut From Jules Set)-enTc.mp3\nMog &amp; Phil Crawf Feat. Marc La Salle - Searching (Cut From Coutts Set)-enTc.mp3\nMonakhov &amp; Que - Hola (Proff Remix) (Cut From Jaytech Set)-enTc.mp3\nMorgan Page - Strange Condition (Inpetto Remix) (-Short- Cut From Minas Set)-enTc.mp3\nNicholas Bennison - Zero Balance (Reaky Remix) (Cut From PvD Set)-enTc.mp3\nPete The System - The Thief Of Time (Cut From Coutts Set)-enTc.mp3\nPolaroid - So Damn Beautyful (Mac &amp; Taylor Remix) (Cut From Stein Set)-enTc.mp3\nRafael Frost - Flashback (Cut From Ferry Set)-enTc.mp3\nRank 1 vs Jochen Miller - The Great Escape (Jonas Stenberg Remix) (Cut From Emery Set)-enTc.mp3\nRebecca Saforia - Ananda (Cut From Coutts Set)-enTc.mp3\nRebecca Saforia - Palingenesis (Original Mix) (Cut From Suzy Set)-enTc.mp3\nRicoccha - Elektrik (Cut From Coutts Set) (Ã‚Â´ÃƒÂ¯Ã‚Âª)-enTc.mp3\nRino Cabrera - Best of Me (Daniel Portman American Spirit Remix) (Cut From Nhato Set)-enTc.mp3\nSequentia vs Maarten van Bergen - Echoes of Sound (Original Mix) (Set Rip)-enTc.mp3\nSied van Riel - 12Hz (Original Mix) (Set Rip)-enTc.mp3\nSintec - Reflex Reaction (Cut From Haslam Set) (Ã‚Â´ÃƒÂ¯Ã‚Âª)-enTc.mp3\nSolaris Heights - Erzengel (Agent Toga Reinterpretation) (Cut From Zahran Set)-enTc.mp3\nSolarity - Diophantine (TATW 306 Rip)-enTc.mp3\nSonic City &amp; Neuromancer - Vienen Los Platillos (Tom Brook Remix) (Cut From Meza Set)-enTc.mp3\nSouth Boy &amp; DJ Giorgio - Stars (Original Mix) (Cut From Faskil Set)-enTc.mp3\nSouthside Players - More Than Ever (Krzysztof Chochlow Remix) (Cut From Haslam Set)-enTc.mp3\nSpacewalker - Cavern Of Secret 20.10 (Dephasys Remix) (Cut From Karybde Set)-enTc.mp3\nSpirit Catcher &amp; Compuphonic - Cleaver (Cut From Jaytech Set) (Ã‚Â´ÃƒÂ¯Ã‚Âª)-enTc.mp3\nStefan Vincent - The Groove That Went (Cut From LB Set)-enTc.mp3\nSteve Anderson Feat. Pippa - Always More (Ernesto vs Bastian Remix) (Set Rip)-enTc.mp3\nSteve Bengaln - Terminal Reactivated (Original Mix) (Cut From Jerom Set)-enTc.mp3\nStuart Donaghy - Rapture (Cut From Haslam Set)-enTc.mp3\nStuart James - Linear Movement (Cut From Powers Set)-enTc.mp3\nSuncatcher Feat. Aneym - Underneath My Skin (Original Dub Mix) (Cut From A&amp;F Set)-enTc.mp3\nTasadi - Uranus (Cressida Remix) (Set Rip)-enTc.mp3\nThe Fusion Feat. Jane Maximova - Behind Rain Waves (Cut From Abstract Set)-enTc.mp3\nThe Quasar - Magnetic Needle (Kosmas Epsilon Remix) (Cut From Faskil Set)-enTc.mp3\nThe Skywalkerz- Eleonore (Original Club Mix) (Cut From Row Set)-enTc.mp3\nTom Colontonio - Inspirari Melodia (George Acosta Remix) (Cut From Coutts Set)-enTc.mp3\nTrance Arts - Dreamcatcher (Karybde &amp; Scylla Remix) (Set Rip) (Ã‚Â´ÃƒÂ¯Ã‚Âª)-enTc.mp3\nUNKNOWN - UNTITLED (Abstract Vision &amp; Elite Electronic Remix) (Cut From Abstract Set) (Ã‚Â´ÃƒÂ¯Ã‚Âª)-enTc.mp3\nUNKNOWN - UNTITLED (Distant Identity Remix) (Set Rip) (Ã‚Â´ÃƒÂ¯Ã‚Âª)-enTc.mp3\nUNKNOWN - UNTITLED (Ex-Driver Remix) (Cut From Abstract Set)-enTc.mp3\nValentino Kanzyani - Outhouse (Goncalo M Remix) (Cut From Fei Set)-enTc.mp3\nVinny Troia Feat. Jaidene Veda - Do For Love (Mike Hiratzka Downtempo Remix) (Cut From Emery Set)-enTc.mp3\nW&amp;W vs. Jonas Stenberg - Alligator Fuckhouse (Cut From W&amp;W Set)-enTc.mp3\nWeekend Heroes - Sidewinder (Ace Ventura Remix) (Cut From J00F Set)-enTc.mp3\nWhelan &amp; DJ Scala - Napoli (Cut From Stein Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:25ca5269881367d473795ee95b81aea06c51c603","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+February+11th%2C+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25ca5269881367d473795ee95b81aea06c51c603","infoHashBuffer":{"type":"Buffer","data":[37,202,82,105,136,19,103,212,115,121,94,233,91,129,174,160,108,81,198,3]},"announce":[],"urlList":[]}}