{"title":"Pippa Wright - Unsuitable Men - AZW3, ePub, MOBI - Barbie1710","uid":7799316,"size":1387567,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2611df0cf3e8b35de724cc21381ebc58b9d9db21&amp;dn=Pippa+Wright+-+Unsuitable+Men+-+AZW3%2C+ePub%2C+MOBI+-+Barbie1710&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Barbie1710","files":8,"time":1352238683,"description":"Pippa Wright - Unsuitable Men - AZW3, ePub, MOBI - Barbie1710\n\n\nAfter eleven years of coupled-up domesticity, Rory Carmichael is single for the first time in her adult life. Even she would admit that her ex-boyfriend Martin wasn't the most exciting man in the world -- let's face it, his idea of a rocking night was one spent updating his Excel spreadsheets -- but Rory could rely on him and, having watched her mother rack up four turbulent marriages, that's what matters. But when she discovers that her supposedly reliable Mr Right is a distinctly unreliable cheater, she's forced to consider the possibility that everything she knows about relationships is wrong. In an effort to reinvigorate both her love life and her lacklustre career at posh magazine Country House, she sets herself a mission to date as many unsuitable men as possible. Toyboys. Sugar daddies. Fauxmosexuals. Maybe the bad boys she's never dated can show her what she's been missing in life. But if Mr Right can turn out to be so wrong, maybe one of her Mr Wrongs will turn out to be just right ...\n\n\nThis is a multi-tracker torrent.  Please check your Bit-Torrent client for the true number of seeds.  Enjoy &amp; Please Seed","torrent":{"xt":"urn:btih:2611df0cf3e8b35de724cc21381ebc58b9d9db21","amp;dn":"Pippa+Wright+-+Unsuitable+Men+-+AZW3%2C+ePub%2C+MOBI+-+Barbie1710","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2611df0cf3e8b35de724cc21381ebc58b9d9db21","infoHashBuffer":{"type":"Buffer","data":[38,17,223,12,243,232,179,93,231,36,204,33,56,30,188,88,185,217,219,33]},"announce":[],"urlList":[]}}