{"title":"The Holy Terror by Wayne Allen Sallee {dwg}","uid":11340315,"size":2901191,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:27217ebca3c3052625843b37ba27a9864e8648de&amp;dn=The+Holy+Terror+by+Wayne+Allen+Sallee+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1414794081,"description":"Serial killer Frank Haid, dubbed the Painkiller by Chicago police and media, murders 18 people--all paralytics. Commanded by an unseen presence that he calls ''Father'' and that speaks in the voice of an uncle whose rotting corpse he keeps in the living room, Haid destroys his victims (what's left of them) and evidence in a way that puzzles police. Hardest hit are residents of Marclinn, a home for the handicapped, where survivors decide they must track down the madman themselves. Their efforts bring them into contact with Chicago's weird underworld--including junkie/murderers and a deformed prostitute whose head grows out her chest--and their own true selves. Crippled physically and emotionally, Marclinn inhabitants must overcome their limitations before taking on their nemesis. Their unlikely front man is Evan Shustak, who is the novel's centerpiece. About a hundred pages into the novel, he dons his superhero outfit - wrist braces, a &quot;utility belt&quot; from which hang bags of vitamins and aspirin, and a plaid heating pad for a cape then announces: &quot;Crippled and insane, I am the American Dream!","torrent":{"xt":"urn:btih:27217ebca3c3052625843b37ba27a9864e8648de","amp;dn":"The+Holy+Terror+by+Wayne+Allen+Sallee+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27217ebca3c3052625843b37ba27a9864e8648de","infoHashBuffer":{"type":"Buffer","data":[39,33,126,188,163,195,5,38,37,132,59,55,186,39,169,134,78,134,72,222]},"announce":[],"urlList":[]}}