{"title":"Warhammer 400gicide [MULTI9]","uid":12390167,"size":3289290888,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2860d283db4c3ba1b49cdda1f94583bce50b1595&amp;dn=Warhammer+400gicide+%5BMULTI9%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polan32","files":3,"time":1441883370,"description":"Title: Warhammer 40,000: Regicide\nGenre: Action, Indie, Strategy\nDeveloper: Hammerfall Publishing \nPublisher: Hammerfall Publishing\t\nRelease Date: 8 Sep, 2015\nCrack: 3DM\n\nSystem Requirements:\nOS: Windows Vista \nProcessor: 2.4 GHz Dual Core (2.4 GHZ) \nMemory: 3 GB RAM \nGraphics: NVIDIA GeForce 8600 GT / ATI Radeon HD 2600 XT or greater \nDirectX: Version 9.0c \nHard Drive: 4 GB available space \n\nRegicide is a brutal take on one of the greatest turn based strategy games of all time. The game fuses multiple phases of combat with dynamic action. Manoeuvre your army into place and unleash a devastating array of tactical abilities to crush your enemies. The game offers two distinct modes: \n \nRegicide mode:\nPlan the attack and command your soldiers through two phases of combat. Open fire on your enemies, utilise tactical abilities and unleash psychic powers to crush your foes. Fight your way through violent single and multiplayer battles to destroy everything that stands between you and certain victory. \n\n \nClassic mode:\nSharpen your tactics in both single and multiplayer games based on traditional chess rules, executing brutally violent kills in dramatic battlefield terrains. Select your race and go to war online against opponents from all over the world in the fully cross-platform multiplayer mode. \n\nKey Features:\n2 unique game modes: Play in both Classic chess and extended Regicide game modes. \nOnline and single player: Test yourself against our AI in both Campaign and Skirmish and bring your new skills to bear against opponents in multiple online game modes. \nA cunning AI: Sharpen your skills verse 5 different AI difficulty settings in both Classic and Regicide. \nLocal multiplayer: Face off against live opponents in local hotseat matches. \nAsynchronous gameplay: Take your game with you and challenge your friends to multiple asynchronous matches. \nCompetitive online leaderboards: Compete against your friends and the world with live Classic and Regicide Leaderboards. \n50 mission single-player campaign: Join Captain Dracomedes as he fights for Hethgar Prime with the Sons of Sanguinius in the 50 mission, fully-narrated campaign: The Angels of Death. \n2 unique races: Play as the indomitable Space Marines or blood thirsty Orks, each with their unique strengths, weaknesses, abilities and strategies. \n11 unlockable Chapters and Clans: Requisition one of 11 iconic Space Marine Chapters or Ork Clans to field in multiplayer and skirmish matches \n36 exclusive models: Tailor your army's appearance by progressing through Campaign, Skirmish (VS AI) and Online Leaderboards. \n45 unique player and unit abilities: Unleash an overwhelming array of player and unit abilities to bring devastation to your enemies. Customise your ability loadouts to match your play style. \nLocalised in 8 different languages: Play in English, French, German, Norwegian, Italian, Polish, Russian, and Spanish.\n\nThis is only the beginning. The universe spans untold galaxies to conquer. \nThis is not just war. This is REGICIDE.\n\n1.Install\n2.Play","torrent":{"xt":"urn:btih:2860d283db4c3ba1b49cdda1f94583bce50b1595","amp;dn":"Warhammer+400gicide+%5BMULTI9%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2860d283db4c3ba1b49cdda1f94583bce50b1595","infoHashBuffer":{"type":"Buffer","data":[40,96,210,131,219,76,59,161,180,156,221,161,249,69,131,188,229,11,21,149]},"announce":[],"urlList":[]}}