{"title":"Claudio\u001f Bini Jaume\u001f Bech - PHEs, Environment and Human Health","uid":10283288,"size":7418278,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29c5442406df9e14a16e5eb92351b92ec19fdd76&amp;dn=Claudio%1F+Bini+Jaume%1F+Bech+-+PHEs%2C+Environment+and+Human+Health&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Kisbalta","files":1,"time":1401741521,"description":"Research on potentially harmful elements (PHEs) in the environmental, agricultural\nand life sciences is extensively increasing since the last decades, owing to the larger\nconsciousness of general population of the risks induced by anthropic activities to\nhuman health.\nThis book is dedicated to the occurrence and behaviour of PHEs in the different\ncompartments of the environment, with special reference to soil as one of the most\nvulnerable ecosystems, and a precious resource with limited resilience capacity.\nCurrent studies of PHEs in ecosystems have indicated that many industrial areas\nnear urban agglomerates, abandoned or active mines, major road systems (highways\nand national roads) and ultimately also agricultural land act as sources, and at\nthe same time sinks, of PHEs (particularly Zn, Cu, Cd). In these areas, large\namounts of metals are recycled or dispersed in the environment, posing severe\nconcerns to human health. Therefore, starting from the atmosphere (Chap. 1),\nthrough the aquatic environment (Chap. 2) and the different soil compartments\n(Chaps. 3, 4), the book also encompasses all the anthropic systems where PHEs\nplay a significant role (mine and urban areas, Chaps. 5, 6). The soil-plant relationships,\nand the element fluxes from soil to plant and the food chain, including an\noverview on soil remediation, are explored in Chaps. 7, 8. In the last part of the\nbook, trace elements join the food safety (Chap. 9) and the risk assessment\n(Chap. 10), concluding with potential risk to human health (Chap. 11), which is\nthe main purpose of the whole book: to ensure a safe environment and a good\nquality of life to new generations.\nThe book provides new insight on the role and function of PHEs in the environmental\nand human health, following fundamental textbooks (e.g. Ferguson 1990;\nAdriano2001; Kabata-Pendias and Mukhejre 2007; Brevik 2013; Alloway 2013) and\npapers (e.g. Lag 1980, 1984; Nriagu 1988; Nriagu and Pacyna 1988; Thornton 1993;\nOliver 1997; Abrahams 2002; Bernard 2008; Steinnes 2009) without forgetting\nrecent thousands of contributions from several scientific domains, not only soil\nscience, but also plant physiology, biology, epidemiology, medicine, and in particular\noncology.","torrent":{"xt":"urn:btih:29c5442406df9e14a16e5eb92351b92ec19fdd76","amp;dn":"Claudio%1F+Bini+Jaume%1F+Bech+-+PHEs%2C+Environment+and+Human+Health","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29c5442406df9e14a16e5eb92351b92ec19fdd76","infoHashBuffer":{"type":"Buffer","data":[41,197,68,36,6,223,158,20,161,110,94,185,35,81,185,46,193,159,221,118]},"announce":[],"urlList":[]}}