{"title":"Emil Sergel - Mitt år som nomad (Svensk Retail PDF)","uid":13016348,"size":6698320,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a6eaeb785548c3dbc2b82e5dcf71804cb34f5c3&amp;dn=Emil+Sergel+-+Mitt+%26aring%3Br+som+nomad+%28Svensk+Retail+PDF%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1450294288,"description":"Författare: Emil Sergel\r\n       Titel: Mitt år som nomad - Vägen till ett friare liv\r\nUtgivningsår: 2015\r\n       Språk: Svenska\r\n        ISBN: 9789176172766\r\n      Format: Retail PDF\r\n\r\nMånga har lekt med tanken och många har lockats av idén, men få har kommit längre än så. Emil Sergel tog steget fullt ut. Han sålde allt, skaffade sig en surfbuss och gav sig ut på ett ett år långt livsexperiment som modern nomad.\r\n\r\nUnder de fyra ensammaste dagarna i mitt liv börjar jag fantisera om ett liv utan prylar, möbler och måsten. Om ett liv där jag lever enklare, jobbar mindre och lever mer. Ju mer jag tänker på det, desto mer inser jag att jag måste testa.\r\n\r\nOm möjligheterna är oändliga, varför väljer då nästan alla att leva samma slags liv? Med bostadsrätt, fast jobb, banklån och fem veckors semester. Emil Sergel bestämmer sig istället för att leva som nomad under ett år. Ett uppbrott för att försöka hitta rätt i livet. Ett liv utan ett fast hem för att undersöka vad som händer. Ett år av valfrihet och upplevelser. Ett år där han kommer att utmana sina gränser och springa sitt första ultramarathon, hångla med en bushpilot i den indonesiska djungeln samt lyckas tjäna ett par hundra tusen kronor på några veckor efter att precis ha beslutat sig för att inte jobba så mycket.\r\n\r\nEmil Sergel är frilansjournalist och filmare med hela världen som arbetsplats, ofta med fokus på äventyr och friluftsliv. Han är uppväxt i den lilla byn Hackås i Jämtland, har alltid sökt kontrasterna i livet och känner sig lika hemma bland hipsters i Brooklyn som hos hundspannsförare i Jukkasjärvi","torrent":{"xt":"urn:btih:2a6eaeb785548c3dbc2b82e5dcf71804cb34f5c3","amp;dn":"Emil+Sergel+-+Mitt+%26aring%3Br+som+nomad+%28Svensk+Retail+PDF%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a6eaeb785548c3dbc2b82e5dcf71804cb34f5c3","infoHashBuffer":{"type":"Buffer","data":[42,110,174,183,133,84,140,61,188,43,130,229,220,247,24,4,203,52,245,195]},"announce":[],"urlList":[]}}