{"title":"Ghost Rider Collection 1949","uid":9656596,"size":1080711825,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2a8275bd4991e9924fe1c2f2480b8a012cc41807&amp;dn=Ghost+Rider+Collection+1949&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mothra67","files":-1,"time":1393197030,"description":"Golden Age Origin \n\nRex Fury originally had a different secret identity than the Ghost Rider. He was known as the Calico Kid. Rex would pretend to be a mild mannered and wimpy traveling salesman, but he would change into the Calico Kid and become a colorfully-dressed hero.\n\nHe was assisted by a young Chinese boy named Sing Song whom he had saved from being framed for murder. His black horse was named Ebony, but he later got a new white horse named Spectre after becoming Ghost Rider.\n\nFederal marshal Rex Fury wore a white outfit covered with phosphorus and a cape that had phosphorescent on one side and black on the other.\n\n Rex used the black side of the cape to cover parts of his body to give the illusion that he was merely a floating head or pair of hands. To further the illusion, he wielded a black lariat and a black bullwhip so that he could appear to grab things at a distance, and even his twin six-guns and his horse, Spectre, glowed in the dark.\nThe Ghost Rider battled many foes who, like him, were not truly supernatural at all, such as an impostor of Frankenstein's Monster and the Harpy, as well as others who were the real deal, such as werewolves and vampires. While the character never crossed over with anyone, his mask inspired the Avenger to put on a costume.\n\nNote\nMarvel's Phantom Rider is based on Magazine Enterprise's Ghost Rider.\n\nLegal Note\nOnly the version of the character that appeared in Magazine Enterprises titles in in public domain. The subsequent Marvel Comics version is, suffice to say, not.\n\nGolden Age Appearances\n\nAs The Ghost Rider:\n\nTim Holt #11-41\nGhost Rider #1-14\nBest of the West #1-12\nBobby Benson's B-Bar-B Riders #13-15\nBlack Phantom #1\nGreat Western #9\nRed Mask #42-50\n\nThis collection is missing the appearances in ME's A-1 comics magazine, so if any of you have them LMK!!!!","torrent":{"xt":"urn:btih:2a8275bd4991e9924fe1c2f2480b8a012cc41807","amp;dn":"Ghost+Rider+Collection+1949","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a8275bd4991e9924fe1c2f2480b8a012cc41807","infoHashBuffer":{"type":"Buffer","data":[42,130,117,189,73,145,233,146,79,225,194,242,72,11,138,1,44,196,24,7]},"announce":[],"urlList":[]}}