{"title":"The Bell by Iris Murdoch","uid":9138199,"size":356328860,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2b094b239136a4e8bafb4a4deba82e2621c22be1&amp;dn=The+Bell+by+Iris+Murdoch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Arazbr","files":26,"time":1383457984,"description":"Written by Iris Murdoch \n\nUnabridged \n\nA lay community of thoroughly mixed-up people is encamped outside Imber Abbey, home of an order of sequestered nuns. A new bell is being installed when suddenly the old bell, a legendary symbol of religion and magic, is rediscovered. And then things begin to change. Meanwhile the wise old Abbess watches and prays and exercises discreet authority. And everyone, or almost everyone, hopes to be saved, whatever that may mean. Originally published in 1958, this funny, sad, and moving novel is about religion, sex, and the fight between good and evil.\n\n\nOutside of Imber Abbey, the home of an enclosed order of nuns, lies Michael Meade's ancestral home, Imber Court. Michael's homosexuality has in the past complicated his desire to become an ordained priest, and he has decided to make Imber Court a lay community of the Abbey. To the court comes a small group of more and less &quot;pure&quot; people, &quot;whose desire for God makes them unsatisfactory citizens of an ordinary life, but whose strength or temperament fails them to surrender the world completely.&quot; Added to them are the visitors: Toby Gashe, a handsome and earnest young man, soon to attend Oxford; Nick Fawley, with whom Michael had a disastrous affair several years previously; Paul Greenfield, an egotistical art historian; and Paul's rather bohemian wife Dora, who &quot;had begun to suspect that Paul thought her the tiniest bit vulgar.&quot; Iris Murdoch combines rarefied philosophy, intellectual introspection, and a terrifically dry humor as she takes us into the minds of troubled people seeking a good and satisfying life in the midst of their religion, their culture, and the natural tendencies of their own personalities. The force and tension of repressed contemplation grows until it is released by a series of stunning events. These characters want to be saved - The Bell asks us to consider what it is that saves us.","torrent":{"xt":"urn:btih:2b094b239136a4e8bafb4a4deba82e2621c22be1","amp;dn":"The+Bell+by+Iris+Murdoch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b094b239136a4e8bafb4a4deba82e2621c22be1","infoHashBuffer":{"type":"Buffer","data":[43,9,75,35,145,54,164,232,186,251,74,77,235,168,46,38,33,194,43,225]},"announce":[],"urlList":[]}}