{"title":"DOOM II: Hell on Earth","uid":4315159,"size":30300610,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2c816516d2d622f4dea29eba83d96d2cf262e774&amp;dn=DOOM+II%3A+Hell+on+Earth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Vredeskind","files":6,"time":1217036009,"description":"DOOM II: Hell on Earth\n\n\nProduct Description:\n\nLet the Obsession begin. Again. \nThis time, the entire forces of the netherworld have overrun Earth. To save her, you must descend into the stygian depths of Hell itself! \n\nBattle mightier, nastier, deadlier demons and monsters. Use more powerful weapons. Survive more mind-blowing explosions and more of the bloodiest, fiercest, most awesome blastfest ever! \n\nPlay DOOM II solo, with two people over a modem, or with up to four players over a LAN (supporting IPX protocol). No matter which way you choose, get ready for adrenaline-pumping, action-packed excitement that&amp;#039;s sure to give your heart a real workout. \n\nHere is why people have still been playing it since 1995,\nThe original Doom was such and incredible first person shooter they had to make a totally new 32 level Doom with lots more monsters, such as the Chain Gunner, the Pain Elemental, the Arch Vile and others, but still the same old weapons and graphics. My second point is the fact that they are still selling Doom 2, they are no longer selling the original Doom except for in a bundle. So since 1995 and the game is still around and selling strong, must mean something! So what is Doom 2? In Doom 2 you are a soldier just coming off of a mission in space (Doom 1), so you must return to planet Earth only to discover it has been taken over and then from there go into the heart of it all, Hades and destroy the monster behind it all. The levels are incredibly detailed with 100s of new wall textures, where you actually believe you are in a city slum overrun by monsters, and you go to the lair of the monsters to destroy the big bad bosses. With that being said, why are people still playing it? Because Doom 2 is the surface beneath it all is a whole community that supports Doom 2 by creating new levels, some easy and simple, others 64 levels of pure pain continuing the saga or starting a new saga, with new enemies, new wall textures and fun. There are even expansion packs sold with 1000s of new levels to keep you playing forever beyond the original Doom 2! \n\n\nCheck Amazon: &lt;a href=&quot;\nhttp://www.amazon.com/ACTIVISION-12803-Doom-Jewel-Case/dp/B00005OBQB/ref=pd_sbs_sw_1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/ACTIVISION-12803-Doom-Jewel-Case/dp/B00005OBQB/ref=pd_sbs_sw_1&lt;/a&gt;\n\n\n\nBurn or mount with alcohol120%","torrent":{"xt":"urn:btih:2c816516d2d622f4dea29eba83d96d2cf262e774","amp;dn":"DOOM+II%3A+Hell+on+Earth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c816516d2d622f4dea29eba83d96d2cf262e774","infoHashBuffer":{"type":"Buffer","data":[44,129,101,22,210,214,34,244,222,162,158,186,131,217,109,44,242,98,231,116]},"announce":[],"urlList":[]}}