{"title":"Exposing Oily Politicians, War Profiteers, and the Media that Lo","uid":4866582,"size":5375434,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c8106adfe20dfb8fca2cab6ca938b92a6577053&amp;dn=Exposing+Oily+Politicians%2C+War+Profiteers%2C+and+the+Media+that+Lo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dodgerblue","files":1,"time":1240553727,"description":" Exposing Oily Politicians, War Profiteers, and the Media that Love Them\nJournalist and radio host Goodman brings her hard-hitting, no-holds-barred brand of reporting to an array of human rights, government accountability and media responsibility issues, and the result is bracing and timely. Goodman isn't about to let anyone slide by with easy explanations, not even then President Clinton when he called in on her daily Pacifica news show. And she is fierce and tireless in her commitment to dig behind official versions of the facts to get to very different stories. Her analysis of Iraq War contracts won by certain key Bush campaign donors will open many eyes, not only with its neat comparison of donation amount with contract value but also with its bold presentation of &quot;Crony Connections.&quot; A gadfly's life in these turbulent times is neither restful nor boring, and Goodman's perspective on events like genocidal massacres in East Timor and mainstream coverage of the Jessica Lynch rescue is both important and alarming. Instances in which newspapers like the New York Times and the Washington Post have published stories based on leaked reports from unnamed government sources only to have to retract the stories later as being unfounded allow Goodman to argue that sophisticated news management techniques of spin, disinformation and controlled access to sources are undermining the reliability of media reporting. How, she asks, could journalists &quot;embedded&quot; with U.S. troops in Iraq be objective reporters of all that was occurring there, and whose interests were being served? These and other provocative questions power Goodman's stirring call for a democratic media serving a democratic society.","torrent":{"xt":"urn:btih:2c8106adfe20dfb8fca2cab6ca938b92a6577053","amp;dn":"Exposing+Oily+Politicians%2C+War+Profiteers%2C+and+the+Media+that+Lo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c8106adfe20dfb8fca2cab6ca938b92a6577053","infoHashBuffer":{"type":"Buffer","data":[44,129,6,173,254,32,223,184,252,162,202,182,202,147,139,146,166,87,112,83]},"announce":[],"urlList":[]}}