{"title":"&quot;O Giteftis ton alogon&quot;  The Horse Whisperer 1998 -","uid":10026516,"size":1432513972,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2cafe65b183e4a51313f947c6a4275506a0eae9b&amp;dn=++%26quot%3BO+Giteftis+ton+alogon%26quot%3B++The+Horse+Whisperer+1998+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nik51","files":-1,"time":1398276786,"description":" &quot;O Giteftis ton alogon&quot;  The Horse Whisperer 1998 - Greek Subs\n\n\nEna 14xrono koritsi, h Grace (Scarlett Johansson) kai o Pilgrim, to agaphmeno ths alogo, travmatizontai sovara se ena troxaio atyxhma. H mhtera ths Annie (Kristin Scott Thomas), mia polyasxolh syntaktria apo to Manhatan, pliroforeitai gia thn \nyparxh tou &quot;Gitefti&quot; Tom Booker (Robert Redford). \nÎ— Annie katalavainei oti h moira ths korhs ths kai toy alogou einai arrikta syndedemenes kai se mia prospatheia na apalynei tis psyxikes kyrios pliges toys, pairnei thn Grace kai ton Pilgrim (o opoios exei metamorfothei se ena agrio, fovismeno zoo) kai xekinoun gia to rantso tou Tom. \n\nO cowboy gnorizei pos na epikoinonei kai na therapevei ta aloga, eno zei makrya apo tis koinonikes symvaseis, dexetai na voithisei ton Pilgrim ki etsi mesa sto yperoxo fysiko topio ths Montana, arxizei mia makra periodos gia th therapeia ths psyxhs oxi mono toy alogou kai ths mikrhs  tou idiokthtrias, alla kai ths Annie kai tou idiou tou Tom. \n\nSkinothetontas gia proth fora ton eafto tou, Î¿ Robert Redford metaferei me maestria sthn othoni to exairetiko mythistorhma tou Nick Evans . \n\nÂ«O Giteftis ton alogonÂ» einai mia tryferh, vathia anthropinh kai romantikh istoria agaphs, me th fysh na protagonistei, toso mesa apo thn exairetikh fotografia, oso kai sthn ousia ths ypotheshs ths tainias.\nApodeiknyei oti h epafh tou anthropou me th fysh therapevei kai tis pio vathies pliges.\n\nOi ermhneies exairetikes, alithines kai ousiastikes apoteloun ena megalo atou ths spoudaias afths tainias, pou xoris melodramatikes exarseis, parousiazei enan apo tous pio sparaktikous kai adiexodous erotes pou mas exei xarisei h mikrh othonh.\n\nElpizontas oti den sas kourasa, sas eyxomai Kalh Theash, zito na exet ligh ypomonh sto download, kai (fysika) ANAPARAGOGH (seed)!! ","torrent":{"xt":"urn:btih:2cafe65b183e4a51313f947c6a4275506a0eae9b","amp;dn":"++%26quot%3BO+Giteftis+ton+alogon%26quot%3B++The+Horse+Whisperer+1998+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cafe65b183e4a51313f947c6a4275506a0eae9b","infoHashBuffer":{"type":"Buffer","data":[44,175,230,91,24,62,74,81,49,63,148,124,106,66,117,80,106,14,174,155]},"announce":[],"urlList":[]}}