{"title":"Smart Tools 9.5","uid":13069846,"size":5947635,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:2e09be4940ce2545c13caaaf6616cfdc78141ff3&amp;dn=Smart+Tools+9.5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ahmerafzal","files":1,"time":1450783851,"description":"Smart Tools offers you the ultimate tool box app with 35 cool smart tools like bubble level, ruler, speedometer, distance meter, unit converter, sound level and more. It is almost a must to have it on your phone, like carrying a swiss army knife.\r\n\r\n1. Ruler\r\nMeasure dimensions and angles of different objects. No calibration needed.\r\n\r\n2. Level meter\r\nCheck the surface levels.\r\n\r\n3. Smart speedometer\r\nDisplays you the speed on a racing-style gauge using GPS. It also records maximum speed, average speed, traveled distance and a current slope.\r\n\r\n4. Smart light\r\nUse it as a manual torch light, as a strobe light or as a music light show.\r\n\r\n5. Smart sound meter\r\nMonitor the current sound pressure level and its spectrum.\r\n\r\n6. Location (map)\r\nShows your current location on the map, current GPS coordinates and the altitude.\r\n\r\n7. Smart distance meter\r\nMeasure distance and height of different objects using smart algorithm.\r\n\r\n8. Smart speed gun\r\nMeasure speed of moving objects using smart algorithm.\r\n\r\n9. Compass\r\nWill help you discover the right direction.\r\n\r\n10. Magnifier\r\nMagnify small objects that are hard to see. It also includes a flash light.\r\n\r\n11. Mirror\r\nSee yourself using the front facing camera.\r\n\r\n12. Protractor\r\nMeasure the slope of any object using your camera and imaginary weight.\r\n\r\n13. Stopwatch\r\nMeasure the time accurately. It also includes the countdown option.\r\n\r\n14. Metal detector\r\nDetect magnetic field of nearby materials and observe it on real time chart.\r\n\r\n15. Vibrometer\r\nObserve real time seismograph data, based on Richter scale. The algorithm is auto-calibrating.\r\n\r\n16. Luminosity meter\r\nMeasure the environmental luminosity (Lux).\r\n\r\n17. Color sensor\r\nCapture the color of any object in RGB format through your camera.\r\n\r\n18. Smart converter\r\nConvert between different currencies and physical units. Currencies are updated automatically.\r\n\r\n19. Smart microphone\r\nUse your phone as an external mic or as a megaphone. Input/output can be switched between internal, AUX, and BT. It also includes an equalizer.\r\n\r\n20. Metronome\r\nClassic metronome with adjustable tempo.\r\n\r\n21. Pitch tuner\r\nTune the pitch of your voice or musical instruments. It can also play the corrected tone.\r\n\r\n22. Code scanner\r\nScan bar and QR codes quickly with your camera.\r\n\r\n23. NFC reader\r\nRead NFC tags.\r\n\r\n24. Cardiograph\r\nMeasure your heart rate with a camera and observe a real time pulse chart. Smart algorithms are used to filter the noise.\r\n\r\n25. Dog whistle\r\nChoose between different high-pitched sounds and volumes to call your dog.\r\n\r\n26. Random generator\r\nGenerate random numbers from custom range.\r\n\r\n27. Time zones\r\nDisplays current time at any location.\r\n\r\n28. Thermometer\r\nDisplays current temperature, humidity and air pressure.\r\n\r\n29. Drag Racing\r\nMeasure the performance of your vehicle. You can switch between different acceleration and brake tests. It includes an auto start/stop function and a chart.\r\n\r\n30. Battery tester\r\nTest your device’s battery.\r\n\r\n31. Night Vision\r\nSee objects in dark areas, using the device’s camera.\r\n\r\n32. Calculator\r\nMake basic calculations.\r\n\r\n33. Counter\r\nHelps you with counting objects.\r\n\r\nTools support both unit formats (metric/imperial) and several languages. However, not all devices have the appropriate sensors to support all the tools. The app is tested mostly on Samsung, LG, HTC and Toshiba phones. Feel free to email me if you find any bugs or need any help with the tools. Please note that it is a free app with some unobtrusive ads","torrent":{"xt":"urn:btih:2e09be4940ce2545c13caaaf6616cfdc78141ff3","amp;dn":"Smart+Tools+9.5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e09be4940ce2545c13caaaf6616cfdc78141ff3","infoHashBuffer":{"type":"Buffer","data":[46,9,190,73,64,206,37,69,193,60,170,175,102,22,207,220,120,20,31,243]},"announce":[],"urlList":[]}}