{"title":"20131025 Portugal No Wood","uid":9102358,"size":1194405,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2ef6edc1a2712ac1c7ee736b3ac3aea7be0eb3b7&amp;dn=20131025+Portugal+No+Wood&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thebigaym","files":4,"time":1382797282,"description":"The map key is Taenona. Slot 0 is early in the game. Slot 2 is later, and the autosave is at the point of victory.\n\nPortugal has no wood. To add to the problem, there are few livestock ranches. In order to expand the population to the point necessary to launch my military attack against Holland, I needed to build a port which provided 5 fish, but my shipping capacity was only 6. This meant I could only sell 1 cloth or buy 1 wood each turn. In addition, I could not afford a 2nd explorer or a single spy, as I needed all wood I could get to expand my roads, mines and farms.\n\nEarlier than I'd like, three countries other than Holland declared war on me. Because I had no colonies in the New World and no borders with any of these countries, this was easy to defend with a group of 8 cossacks. The occaisonal blockade stunted my growth (see precarious meat situation above). More importantly, this war precluded my declaring war on Holland, since I did not want to be fighting too many countries at once.\n\nAs a note, Holland did not have wood either. I was in a tough situation, because I knew I needed to fight through Holland to France before I could get wood through my road transport network. Meanwhile, I was falling desperately behind technologically, and too wood poor to build a navy that would threaten off aggressors and allow my to trade my way out of my money/wood problems.\n\nAfter frustrating the initial attack of three countries and the eventual peace settlement, I caught a break when those countries began attacking France. France had been the main sponsor of a neighboring minor power with wood, and it had even built a partial road complex through it. When France began losing, I realized I could attack this minor power and France would not declare war on me to defend it. \n\nThus, conquest of a minor power was the first opportunity I had to get wood on a regular basis. The looting of its treasury also financed spies and builders and the subsequent conquest of Holland.\n\nOne note on this conquest. England had purchased a property in one of its provinces. I left that province alone, captured all the other provinces besides the capitol, and then captured the capitol. I delayed capturing the capitol so that other Major Powers would not attack the provinces left in anarchy. After capturing the capitol, England's purchase of the resource no longer necessitated my declaring war on England before attacking that province.\n\nI think I still would have lost the game had the computer player Sweden been strategically better. It had captured some provinces of a minor power adjacent to me, and it had Light Artillery and Hussars while I still had Horse Artillery and Cossacks. For some reason, Sweden preferred to attack France and places in the New World rather than me.\n\nAnyways, as soon as I solved my wood problems, the game turned around. But it was a grind. I did not win until 1820 or so.","torrent":{"xt":"urn:btih:2ef6edc1a2712ac1c7ee736b3ac3aea7be0eb3b7","amp;dn":"20131025+Portugal+No+Wood","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ef6edc1a2712ac1c7ee736b3ac3aea7be0eb3b7","infoHashBuffer":{"type":"Buffer","data":[46,246,237,193,162,113,42,193,199,238,115,107,58,195,174,167,190,14,179,183]},"announce":[],"urlList":[]}}