{"title":"Raymond Brown - The Death of the Messiah, vol. 1 (pdf)","uid":9299481,"size":8168917,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f1eba127c44179737793b6579c356a46573d323&amp;dn=Raymond+Brown+-+The+Death+of+the+Messiah%2C+vol.+1+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1386219400,"description":"Raymond E. Brown - The Death of the Messiah: From Gethsemane to the Grave, Vol. 1 (Doubleday, 1994) 877 pages.\n\nCompletely reprocessed pdf based on an older scan. The source was very high quality, so this one is very nice as well. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nVolume One ends quite abruptly, but that is in fact the last page. Volume Two will pick up where it left off. I hope to come across a comparable version of that second volume soon.\n\n\ndescription:\n\n\nOver his illustrious career, Raymond E. Brown, S.S., Ph.D., was internationally regarded as a dean of New Testament scholars. He was Auburn Distinguished Professor Emeritus of Biblical Studies at Union Theological Seminary in New York City. He received over thirty honorary degrees from Catholic and Protestant universities worldwide, and was elected a (Corresponding) Fellow of the British Academy and a member of the American Academy of Arts and Sciences.In addition to serving as president of the Society of Biblical Literature, the Catholic Biblical Association, and the Society of New Testament Studies, two popes appointed Father Brown as the sole American on the Pontifical Biblical Commission. Some of the best known of his more than thirty-five books on the Bible are three volumes in the &quot;Anchor Bible&quot; series on the Gospel and Epistles of John, as well as the Anchor Bible Reference Library volumes &quot;The Birth of the Messiah&quot;, &quot;The Death of the Messiah&quot;, and &quot;An Introduction to the New Testament&quot;, winner of the 1998 Catholic Press Association Award for Biblical Studies. Father Brown's untimely death on August 8, 1998, saddened all who knew him.\n\n---\n\nBrown's Introduction to the NT is here:\n &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/8331269&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/8331269&lt;/a&gt;","torrent":{"xt":"urn:btih:2f1eba127c44179737793b6579c356a46573d323","amp;dn":"Raymond+Brown+-+The+Death+of+the+Messiah%2C+vol.+1+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f1eba127c44179737793b6579c356a46573d323","infoHashBuffer":{"type":"Buffer","data":[47,30,186,18,124,68,23,151,55,121,59,101,121,195,86,164,101,115,211,35]},"announce":[],"urlList":[]}}