{"title":"Creedence Clearwater Revival - Down On the Corner [Ed Sullivan, ","uid":8200729,"size":127211520,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2f8bbaa9a044b666443d0835063dc14bf32a1d11&amp;dn=Creedence+Clearwater+Revival+-+Down+On+the+Corner+%5BEd+Sullivan%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1362008579,"description":"Creedence Clearwater Revival - Down On the Corner [Ed Sullivan, 11-16-1969].VOB\n\n\nVery HQ rare promo music video from a promo DVD. &quot;Down on the Corner&quot; is a song by the American band Creedence Clearwater Revival. It appeared on their fourth studio album, Willy and the Poor Boys (1969). The song chronicles the tale of the fictional band Willy and the Poor Boys, and how they play on street corners to cheer people up and ask for nickels. The song peaked at #3 on the Hot 100 on 20 December 1969. The flip, &quot;Fortunate Son&quot;, reached #14 on the United States charts on 22 November 1969, the week before Billboard changed its methodology on double-sided hits. \n\nThe song makes reference to a gut bass in the line &quot;Blinky thumps the gut bass and solos for a while&quot;. In a 1969 appearance on The Ed Sullivan Show, the band performed the song as Willy and the Poor Boys. Stu Cook played a gut bass, which mimicked the appearance of the band as they appear on the album cover. ~.~performance mentioned- \n\nCreedence Clearwater Revival (sometimes shortened to Creedence or CCR) was an American rock band that gained popularity in the late 1960s and early 1970s with a number of successful singles drawn from various albums. \n\nThe band consisted of lead vocalist, lead guitarist, and primary songwriter John Fogerty, his brother and rhythm guitarist Tom Fogerty, bassist Stu Cook, and drummer Doug Clifford. Their musical style encompassed country rock and swamp rock genres. Despite their San Francisco Bay Area origins, they positioned themselves as Southern rock stylists, singing about bayous, the Mississippi River, catfish, and other popular elements of Southern iconography. \n\nCreedence Clearwater Revival's music is still a staple of American and worldwide radio airplay and often figures in various media. The band has sold 26 million albums in the United States alone. Creedence Clearwater Revival was inducted into the Rock and Roll Hall of Fame in 1993. They were ranked at 82 on Rolling Stone's list of the 100 greatest artists of all time. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Down_on_the_Corner&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Down_on_the_Corner&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/FajLAaAen&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/FajLAaAen&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:02:11\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.5\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:2f8bbaa9a044b666443d0835063dc14bf32a1d11","amp;dn":"Creedence+Clearwater+Revival+-+Down+On+the+Corner+%5BEd+Sullivan%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f8bbaa9a044b666443d0835063dc14bf32a1d11","infoHashBuffer":{"type":"Buffer","data":[47,139,186,169,160,68,182,102,68,61,8,53,6,61,193,75,243,42,29,17]},"announce":[],"urlList":[]}}