{"title":"Drishyam - Malayalam - 2014 - Central - DVD 5.1 - Esubs - MeN -","uid":10766358,"size":4495374554,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:301deb02b49530312a6355dcf342836db4dea65e&amp;dn=Drishyam+-+Malayalam+-+2014+-+Central+-+DVD+5.1+-+Esubs+-+MeN+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JaGaN-MeN","files":-1,"time":1408032851,"description":"Drishyam - Malayalam - 2013 - Central - DVD 5.1 - Esubs - MeN - MaJaaNet\n\n\n\nMovie Poster\n &lt;a href=&quot;\nhttp://i.imgur.com/gBNZyn8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/gBNZyn8.jpg&lt;/a&gt;\n\n\n\nMovie Information\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt3417422/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt3417422/&lt;/a&gt;\n\n\n\n\nPlot\n\nGeorgekutty (Mohanlal) is an orphan who had dropped out of school after the fourth grade. He has come up in life by tilling his land. Now he is a businessman running a cable TV service in a rural area. He is married to Rani (Meena) and they have two daughters, Anju (Ansiba), a Plus Two student, and Anu (Esther), a student of class sixth.[clarification needed] Georgekutty is stingy and does not like to spend money on anything beyond the basic necessities. His only interest apart from his family is watching films. He spends most of his time in front of the TV in his small office. He is so obsessed with movies that he makes every major decision in life by subconsciously taking an example from some film he has seen.\nToward the middle of the film, Georgekutty's teenaged daughter gets photographed in the bathroom at a nature camp by a hidden cell phone. The culprit, Varun (Roshan Basheer) is the son of police inspector general Geetha Prabhakar (Asha Sarath). Varun is accidentally killed by Rani and her daughter when he comes to blackmail them. They hide his body in a compost pit, which is witnessed by Anu. Rani tells Georgekutty about the incident and he devises a way to save his family from the law. He removes the broken cell phone and disposes of Varun's car, which is seen by Constable Sahadevan (Kalabhavan Shajon), who has a grudge against Georgekutty. Georgekutty takes them out on a trip to Thodupuzha to pray in a church, watch a movie and eat at a restaurant. Geetha, realising that her son has gone missing starts an investigation.\nAfter a preliminary investigation, Geetha calls Georgekutty and family for questioning. Georgekutty had predicted that this would happen and taught his family how to change their alibi at the time of murder. When questioned individually, they replied the same thing and they had also shown the bill of the restaurant,the movie ticket and the bus journeys' tickets as proof of their alibi. Geetha questions the owners of the establishments they have been to and their statements prove Georgekutty's alibi. Geetha realises that on the day of the incident, Georgekutty had taken the tickets and the bill, made acquaintance with the owners and had gone for the trip with his family the next day, thus proving his alibi and making the owners unwittingly tell the lie.\nGeetha arrests Georgekutty and family and Sahadevan uses brute force to beat the truth out of them. Eventually, Anu gives in and reveals the place where the body is buried. After digging the compost pit,they find the carcass of a calf, indicating that Georgekutty had moved the body. Anu reports to the media and complains against Sahadevan. The constable is suspended and Geetha resigns from her post. Geetha and her husband meet Georgekutty to ask forgiveness for their rude and violent behavior. But Georgekutty indirectly tells them that he had got rid of 'the uninvited guest'. Georgekutty, now in remand, signs a register at the newly constructed local police station. As he leaves, a flashback shows him leaving the incomplete police station with a shovel in hand, indicating that he has hidden Varun's body in the foundations of the police station itself.\n\n\n\n\nScreenshot\n &lt;a href=&quot;\nhttp://i.imgur.com/9lgYD1U.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/9lgYD1U.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgur.com/RUAiCz7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/RUAiCz7.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgur.com/xtXOnYK.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/xtXOnYK.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgur.com/oLLqUok.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/oLLqUok.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgur.com/0BMyiJv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/0BMyiJv.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:301deb02b49530312a6355dcf342836db4dea65e","amp;dn":"Drishyam+-+Malayalam+-+2014+-+Central+-+DVD+5.1+-+Esubs+-+MeN+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"301deb02b49530312a6355dcf342836db4dea65e","infoHashBuffer":{"type":"Buffer","data":[48,29,235,2,180,149,48,49,42,99,85,220,243,66,131,109,180,222,166,94]},"announce":[],"urlList":[]}}