{"title":"Greg Iles - The Quiet Game (Penn Cage #1)","uid":13142296,"size":576073316,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:31a3df52ddb608885823ce10bf1329d780591e55&amp;dn=Greg+Iles+-+The+Quiet+Game+%28Penn+Cage+%231%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":45,"time":1451995919,"description":"\nPenn Cage is no stranger to death. As a Houston prosecutor he sent 16 men to death row, and watched seven of them die. But now, in the aftermath of his wife's death, the grief-stricken father packs up his four-year-old daughter, Annie, and returns to his hometown in search of healing. But peace is not what he finds there.\r\nNatchez, Mississippi, is the jewel of the antebellum South, a city of old money and older sins, where passion, power, and racial tensions seethe beneath its elegant façade. After 20 years away, Penn is stunned to find his own family trapped in a web on intrigue and danger.\r\n\r\nDetermined to save his father from a ruthless blackmailer, Penn stumbles over a link to the town's darkest secret: the 30-year-old unsolved murder of a black Korean War veteran. But what drives him to act is the revelation that this haunting mystery is inextricably bound up in his own past. Under a blaze of national media attention, Penn reopens the case, only to find local records destroyed, the FBI file sealed, and the town closing ranks against him.\r\n\r\nPenn joins forces with Caitlin Masters, a beautiful young newspaper publisher, on a quest that will lead from the bayous of the South to the highest reaches of the U.S. government. His need to right a terrible wrong pits him against the FBI, the powerful judge who nearly destoyed his family, and his most dangerous adversary: a woman he loved more than 20 years before, and who haunts him still. His crusade for justice will ultimately lead him into a packed Mississippi courtroom, where he fights a battle that could end a decades-old silence and force the truth to be spoken at last.\r\n\r\n\r\nRead by Dick Hill\r\nFormat: MP3\r\nUnabridged","torrent":{"xt":"urn:btih:31a3df52ddb608885823ce10bf1329d780591e55","amp;dn":"Greg+Iles+-+The+Quiet+Game+%28Penn+Cage+%231%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31a3df52ddb608885823ce10bf1329d780591e55","infoHashBuffer":{"type":"Buffer","data":[49,163,223,82,221,182,8,136,88,35,206,16,191,19,41,215,128,89,30,85]},"announce":[],"urlList":[]}}