{"title":"AntispamSniper.for.Outlook.Express.3.2.0.1-MKDEV.TEAM","uid":4732948,"size":4709811,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:32b47bca567bf50decb9a4111d5db15f7fbc5ffb&amp;dn=AntispamSniper.for.Outlook.Express.3.2.0.1-MKDEV.TEAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ilefx","files":2,"time":1235136529,"description":"AntispamSniper.for.Outlook.Express.3.2.0.1-MKDEV.TEAM\n\ninstall the app\nCopy AntispamSniper.dll in the app folder\n\nseed/enjoy\n\n\nAntispamSniper for Outlook Express description   \n \n \nAn OE plugin that can delete spam right on the server by headers, using a list of account settings\nAntispamSniper for Outlook Express provides a professional anti-spam and anti-phishing protection for your mailbox. The unique combination of several methods for automatic email classification shows very good filtering quality for all kinds of spam, including the graphical spam with random text.\n\nThe plug-in has a built-in option allowing deleting spam from the server by headers and saves the traffic. The good messages, mistakenly deleted from server by header, may be restored. The plug-in supports POP3 and IMAP protocols.\n\nHere are some key features of &quot;AntispamSniper for Outlook Express&quot;:\n\nÃ‚Â· The statistical trainable classification algorithm has unique characteristics. It learns your private correspondence, extracts the distinguishing features from messages of different classes and uses this information for effective analysis of other incoming messages. The algorithm improves its classification quality continuously with each new learned message.\nÃ‚Â· The plug-in can delete spam right on the server by headers, using a list of account settings. The accounts for filtering are added manually or automatically for non-secure connections.\nÃ‚Â· The filtering log allows you to track back the history of classifying messages and training the plug-in.\nÃ‚Â· The messages from whitelisted senders are not filtered by other methods. The whitelist is updated on learning automatically.\nÃ‚Â· The blacklist of senders is used for blocking the messages from a defined list of email addresses. The blacklist is updated on learning automatically.\nÃ‚Â· The filtering rules are recognizing spam and ham by specific combinations of symbols in a body and headers of the email messages. The rules are optional, because the trained algorithm and a whitelist are very effective. But the accurately assembled lists of rules may improve the classification quality in cases when the algorithm is unable to select a certain class for a message with high probability.\nÃ‚Â· Anti-phishing module blocks most of the phishing attacks.\nÃ‚Â· DNSBL services are used for blocking spam by IP address of the sender.\nÃ‚Â· A list of black words is used for deleting spam by keywords in subject.\nÃ‚Â· It is possible to block the messages containing the certain types of attachments: animated GIF images, Windows executable modules, the files with some blacklisted extension.\nÃ‚Â· The plug-in optionally learns the outgoing messages as non-spam.\nÃ‚Â· The filtering statistics may be viewed as a table or as a chart.\n\n\nRequirements:\n\nÃ‚Â· Outlook Express 5.5/6.0\n\n\nLimitations:\n\nÃ‚Â· 30-day trial version\n\nWhat's New in This Release: [ read full changelog ]\n\nÃ‚Â· The additional internal whitelist of senders is added for preventing false positives. The plug-in updates this list automatically. It adds to new whitelist the senders of several messages, classified with low spam ratio. The senders of messages marked as spam are removed from the list permanently. The Reason field for the messages classified as non-spam by internal whitelist has a prefix [auto] in Filtering log.\nÃ‚Â· The automatic internal lists of exceptions for DNSBL and URIBL contain network subnets and domains from the messages marked as non-spam. The plug-in ignores them during classifying new mail.\n\n \n \n","torrent":{"xt":"urn:btih:32b47bca567bf50decb9a4111d5db15f7fbc5ffb","amp;dn":"AntispamSniper.for.Outlook.Express.3.2.0.1-MKDEV.TEAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32b47bca567bf50decb9a4111d5db15f7fbc5ffb","infoHashBuffer":{"type":"Buffer","data":[50,180,123,202,86,123,245,13,236,185,164,17,29,93,177,95,127,188,95,251]},"announce":[],"urlList":[]}}