{"title":"This Book is Full of Spiders: Seriously, Dude, Don't Touch It by","uid":10506780,"size":2344409,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32bd26c801d0cb326095def43428489db93c21bf&amp;dn=This+Book+is+Full+of+Spiders%3A+Seriously%2C+Dude%2C+Don%27t+Touch+It+by&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dogmatist","files":-1,"time":1404779168,"description":"This Book is Full of Spiders: Seriously, Dude, Don't Touch It (John Dies at the End)\nby David Wong\nFormats: .epub, .mobi, .awz3\n\nAs always, if you enjoy this work then consider buying it to support the artist.\n\n\nDescription:\n\n           \nWARNING:\n\n \n\nYou may have a huge, invisible spider living in your skull. THIS IS NOT A METAPHOR.\n\n \n\nYou will dismiss this as ridiculous fear-mongering. Dismissing things as ridiculous fear-mongering is, in fact, the first symptom of parasitic spider infection -- the creature secretes a chemical into the brain to stimulate skepticism, in order to prevent you from seeking a cure. That's just as well, since the &quot;cure&quot; involves learning what a chainsaw tastes like.\n\n \n\nYou can't feel the spider, because it controls your nerve endings. You can't see it, because it decides what you see. You won't even feel it when it breeds. And it will breed. So what happens when your family, friends and neighbors get mind-controlling skull spiders? We're all about to find out.\n\n \n\nJust stay calm, and remember that telling you about the spider situation is not the same as having caused it.  I'm just the messenger. Even if I did sort of cause it.\n\n \n\nEither way, I won't hold it against you if you're upset. I know that's just the spider talking.\n\n\n\nENJOY!!! (How could you not after an introduction like that)\n","torrent":{"xt":"urn:btih:32bd26c801d0cb326095def43428489db93c21bf","amp;dn":"This+Book+is+Full+of+Spiders%3A+Seriously%2C+Dude%2C+Don%27t+Touch+It+by","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32bd26c801d0cb326095def43428489db93c21bf","infoHashBuffer":{"type":"Buffer","data":[50,189,38,200,1,208,203,50,96,149,222,244,52,40,72,157,185,60,33,191]},"announce":[],"urlList":[]}}