{"title":"Keef Hartley (Band) - Halfbreed 1969","uid":3400724,"size":123365736,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:32d778db23d33359f6594ab65a397e38266e34aa&amp;dn=Keef+Hartley+%28Band%29+-+Halfbreed+1969&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"buzzard","files":13,"time":1130113218,"description":"Keef Hartley (Band) - Halfbreed 1969\n\n[IMG]http://img333.imageshack.us/img333/7194/keef10ml.jpg[/IMG]\n\nsize:           117 mb\nbitrate:       320\n\t  \t  \t\n\nPersonnel incl:\nMILLER ANDERSON \tgtr, vcls \tA \tB \tC\nPETER DINES \torgan \tA\nKEEF HARTLEY \tdrms \tA \tB \tC\nSPIT JAMES \tgtr \tA\nGARY THAIN \tbs \tA \tB \tC\nJOHNNY ALMOND \tsax \t\tB\nJIMMY JEWEL \thorns \t\tB\nHENRY LOWTHER \thorns \t\tB\nMICK WEAVER \tkeyb'ds \t\tB\nDAVE CASWELL \t\t\t\tC\nLYLE JENKINS \t\t\t\tC\nHARRY BECKETT \ttrumpet, trombone \t\nJON HISEMAN \tdrms \t\n \n\nALBUMS:\n1(A) \tHALFBREED \t(Deram SML 1037) \t1969 SC -\n2(B) \tTHE BATTLE OF NW6 \t(Deram SML 1054) \t1970 SC -\n3(C) \tTHE TIME IS NEAR \t(Deram SML 1071) \t1970 SC 41\n4( ) \tOVERDOG \t(Deram SDL 2) \t1971 -\n5( ) \tLITTLE BIG BAND \t(Deram SDL 4) \t1971 -\n6( ) \tSEVENTY SECOND BRAVE \t(Deram SDL 9) \t1972 -\n7( ) \tLANCASHIRE HUSTLER \t(Deram SDL 13) \t1973 SC -\n8( ) \tTHE BEST OF.... (dbl) \t(Deram DPA 3011/2) \t1974 -\n\nNB: CD reissues include (1) on Deram (820 978-2) 1992, (2) on Deram (820 931-2) 1992, (3) on (Deram 820 979-2) 1995, (4) on (Deram 820 974-2) 1995, (5) on (Deram 820 975-2) 1995 and (6) on (Deram 820 976-2) 1995.  \n\n45s:\n1. Leave It 'Til Morning/Just To Cry \t(Deram DM 250) \t1969\n2. Waiting Around/Not Foolish, Not Wise \t(Deram DM 273) \t1969\n3. Roundabout/Roundabout (different version) \t(Deram DM 316) \t1970\n4. Dance To The Music/You And Me \t(Deram DM 380) \t1973\n \n\nA Lancastrian - he was born in Preston during 1944 - Hartley first caught the public eye when he replaced Ringo Starr as drummer for Rory Storm and The Hurricanes. He later moved to London in 1964, hitting the skins first for The Artwoods and then for John Mayall's Bluesbreakers in April 1967. The following year, at Mayall's suggestion, he formed his own Keef Hartley Band. This had a rapidly fluctuating line-up but the personnel listed above were the nucleus of the band. They played a wide range of music but have tended to be most closely identified with the British blues scene. Hartley was a colourful figure who often dressed as an American Indian, sometimes with the head-dress and war-paint. All this helped make the band a popular attraction around the clubs. They were also one of the few British bands to appear at the Woodstock festival where they went down well.\nOn Halfbreed, they took the Chicago blues tradition and improvised mostly with their own compositions; relying quite heavily on solos. (The recent CD reissue on Deram also includes the non-album 45, Leave It 'Til Morning). By the time of The Battle Of NW6 they'd veered more towards jazz musically. The Time Is Near came with a lyrics/picture booklet. Miller Anderson wrote all but one track on the album.\nIn 1971, Hartley formed a new combo, The Keef Hartley Big Band, which featured an enlarged brass section. This outfit recorded Little Big Band live at the Marquee Club. The band proved to be a very short-term venture, mostly due to conflict between Hartley and Anderson, and his Seventy Second Brave and Lancashire Hustler albums were really solo efforts with various session musicians lending assistance.\nIn 1974, Hartley met up with Miller Anderson again in the States. The two of them having settled their differences, they returned to the UK to form Dog Soldier, although once again this proved to be a short-term venture.\nKeef Hartley Band can also be heard playing Not Foolish, Not Wise on Decca's Wowie Zowie! World Of Progressive Music compilation back in 1969 and the following year World Of Blues Power! Vol. 2, included Leavin' Trunk.\nThere is also an acetate version of Halfbreed with Owen Finnegan on vocals. He was a good live vocalist but couldn't do it in the studio so he was ousted in favour of Miller Anderson. Negotiations are apparently going on to get the original version released. \n\n[IMG]http://img333.imageshack.us/img333/3905/keef25fq.jpg[/IMG]","torrent":{"xt":"urn:btih:32d778db23d33359f6594ab65a397e38266e34aa","amp;dn":"Keef+Hartley+%28Band%29+-+Halfbreed+1969","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32d778db23d33359f6594ab65a397e38266e34aa","infoHashBuffer":{"type":"Buffer","data":[50,215,120,219,35,211,51,89,246,89,74,182,90,57,126,56,38,110,52,170]},"announce":[],"urlList":[]}}