{"title":"Subtle - For Hero For Fool [2006] MP3 320kbps","uid":4005908,"size":104289749,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3305a5920f9a6507235808c49f33cbc39af1d294&amp;dn=Subtle+-+For+Hero+For+Fool+%5B2006%5D+MP3+320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dkords","files":11,"time":1201822078,"description":"CMG Review\n\nThere?s a moment on ?Return of the Vein? that?s built to rip out your heart and experiment with different ways of putting it back in. Dose One / Adam Drucker writes you into a dream-scene that uses three different spins on the phrase ?Things are in black and white.? He sets you up with a young George Washington, who is towering above you, on stilts. He?s the host of a game show, you?re the contestant, and it seems like he?s using this shaky position of power to intimidate you. During your negotiations with the George, a lot of Nixon?s two-fingered victory salutes are flashed around, sometimes as a peace sign, but in one quick instant as a shadow-puppet, creating a pair of devil?s horns over George?s head. The peace / victory fingers that became horns then become a fork, and find their way into your mouth. Sure, this ?forked tongue? image is by far the most conventional ?symbol? you?ll probably ever get out of Drucker, but it yanks at your attention, and draws it towards the suggestion that there are at least two ways to look at a President?s ?Peace? and ?Victory,? but it?s hard to do so when you?re gagging on them. Finally, the fingers become fangs, which, we learn, belong to the audience watching the scene just described, and who have previously bitten out George?s appendix, leaving a coin slot in its place (but have not ?eaten his heart out,? exactly).\n\nRidiculous? Maybe. Pretentious? Only as described second-hand (sorry). Yes, it is some of the most abstracted imagery and symbolism you?ll probably ever get on a pop record; it?s Salvador Dali and Stan Lee and Escher and Murakami and Miyazaki set to music, with one of those Illuminati eyeball pyramids playing piano in the background. But the music is beautiful, and when we say ?beautiful,? we really, really mean it: in this one scene, the drums and guitars and blips and bass hums begin calmly, but become more manic as things unfold, all while Dose?s voice is machine-gunning the verse like Twista, but gradually piling on harmonies as things get more intense, in a soothing counter-balance to the panic-attack taking place in the scene, which gets more severe as the music/mood becomes more threatening and difficult to handle for our hero, the game show loser who, like in any hip-hop song, is a ?You.? The listener can read along with Dose?s ?poems? and get chills at the detail, or can just listen along and get chills at the arrangement, both of which are affecting enough on their own to cause physiological responses. Combined, they simply perpetuate the ongoing shudder that this album creates when played right through, especially when there?s a song called ?Bed to the Bills,? which is undeniably about Dax, the band-member-best-friend who is currently figuring out how to finance his paralysis by negotiation with a long line of passive aggressive, peacefully evil, and perpetually victorious dead men on stilts. Bob Barker, eat your appendix out.\n\nGet even closer: if you take the George Washington image on board and navigate back through the songs that came before ?Return of the Vein,? you get guided towards certain ideas, since the record is, really, simply about the rights and the wrongs surrounding the notion of ?status quo.? There are limbs holding limbs holding limbs on this record: Washington is the most famous president because he?s on the one dollar bill, which is the bill that the most people see the most -- it?s the democratic bill -- and, therefore, the founding forefathers, GW?s brand-extension team (charged with the task of ?popularizing? the best prez), knew what they were doing when they decided not to put him on the hundred (see ?Middleclass Stomp? and ?Middleclass Kill?). Throughout the record Drucker takes other such images and scatters them like stars onto a canvas, then sits back as the listener draws out constellations. Yes, of course some of the album is ?difficult.? Dose wrote it. Some of it even may require effort, but that?s basically just a furrowed way to say ?thought-provoking.&quot; And similar to how the best children?s fables and popular works of fiction or myth or science fiction or cinema flip your disbelief switch and create a place of intrigue and colour, of looming shadows and twinkling lights -- all as a means of sugaring the bitterest pills -- this new Subtle album contains music that is dazzling and arresting enough to make you forget that there?s a complicated, tear-jerking subtext running underneath, all the way through. It?s a deceptively fertile play-ground for us kids? imaginations. Like a lot of our other classicized, perfect pop art.\n\nIn the trilogy of full-lengths that Subtle is springing upon us, For Hero : For Fool plays The Empire Strikes Back to A New White?s (2004) A New Hope. And despite what the Anticon naysayers will tell you, that?s probably the only word association that Drucker didn?t intend. The band?s opening installment found Dose?s avatar on a quest of self-discovery, leading to tenuous social alignment, and the dissolution of that alignment helping to solidify the hero?s resolve. It?s impossible not to talk about these albums as movies and, as any good epic second act should do, For Hero : For Fool is an expansion onto a much broader canvas, a steep rise of scale and drama that drops the protagonist in a wide-open, dangerous space filled with increasingly complex plot cogs. But where so many second acts fail by losing touch with the inner conflict, For Hero : For Fool stands as the very definition of a superior Act II, blowing up its scope in all directions and deftly elevating the heroic nature of its protagonist, that waxing in direct proportion to the deepening, fateful barb of the hero?s folly.\n\nDose?s clever, rich, image-gorged writing is at that forefront more than ever, and, mercy, does he ever slam down the goods. On ?Midas Gutz? he details the rap battle scene through a Burroughsian filter, blowing his trademark fitful falsetto gusts up against a style that?s all dire machismo swagger, a reflection of his satire?s butt but continuous of the narrator?s voice -- Mystikal possessed by beat poetry and iambic pentameter. Lyrically, the song?s equally indicative of the fine balance Dose achieves between humor and commentary, abstraction the tight-rope walker?s pole that connects those two weights. Poker-faced contestants compete by displaying their guts, vainly searching for self-worth in their own bowels, and for anyone who?s seen an emcee battle (how?d dude just drop twenty bars about his dick stature?), the metaphor is dead-on. Which also brings up the point that, whatever this album?s conceptual conceits, Dose is still very much writing what he knows. This is, after all, the man who joined Eminem, Juice, and Rhymefest in 1997?s famous Scribble Jam battle semifinals.\n\nRare to find in contemporary music words that are so essential to the work, even words as bright and bottomless as these, but Subtle don?t let the text fly out of their music?s reach, which instead catches those letters and holds them up, sustaining their resonance. On ?Middleclass Stomp? the band invents a clomping new Failure riff to sublimate Dose?s buzzing into an indie rock bark before ?middle class? is dropped, a bombshell shrouded in clouds of cello. Following suit, ?Middleclass Kill? flips what might be an actual Failure riff, this time molding such clamor into the bad twin of Rich Harrison?s ?Get Right? remix loop; the effect stencils a cryptic figure in the margins of Dose?s free verse on the middle class grind and consummation, its menace dissolved in a coda of keys and chimes that blot in the space where writ once placed, ?Never young and tall feared / in the cold grand code of collapse.? No surprise, then, that ?The Mercury Craze? touches upon themes of self-commodification with the same careful hands it uses to cut open and inhabit trend?s hide, one hell of a wolf donning sheep cloth by sounding like a musical autopsy of, oh, say, Gnarls Barkley?s ?Gone Daddy Gone? cover. It?s not contrivance but elaborate planning that has that be-bopping single tailed by, remember, ?Bed to the Bills,? where a mid-&amp;#039;90s Touch and Go guitar rivulets out from blasts of white noise and Jel?s rib-rattling drum kicks, all of which sinks to the terrifying suggestion of synths murmuring within a legion of congruent Doses chanting, ?A honey-smothered hand gun all covered in ants / trembles on a three-quarter length Corinthian column.? The statement?s phrased in steely Videodrome speak, but its implied antithesis, its sentiment, pleads long life to Dax.\n\nWhile it navigates a vertical line up the ocean between explosive absurdity and choking intimacy, For Hero : For Fool?s coup de grace is that the ominous destination of its fantastic voyage is not fantasy in the slightest, but something far more relevant and real. This album?s crossroads, its confrontation with the dark side of its patriarchy, is a question, an acceptance or rejection of class, and on a much larger level, a decision between two ways of life; it?s a decision that tasks all of us who are consumed by beauty yet faced by a world consumed by ugliness. When FH:FF finally arrives at its epiphany in ?The Ends,? a beatbox-and-piano sublimity lands a stark spotlight on our hero, victim to the ?most gross of concerns? but also clinging to the hope that there?s something miraculous in just passing ?to and from sleep / in calendrical waltz / all to feel aimed.? How do we embrace ideals or faith or nobility or all of the above when to live requires practicality, cynicism, selfishness? The answer of religions and epics and myths, pretty much across the board, is Sacrifice, with life itself the gift laid up on altar. At this point in their trilogy it doesn?t seem that Subtle are deviating from that truism, but they are bringing its application into a different art clique, a different intelligence, and a different cultural context. In a modern tome where Dreyer?s Ordet and Kubrick?s 2001: A Space Odyssey and Tarkovsky?s Offret are the classic Passions, sacrifice is something both willed and forced, and its transformative power is underlined while its results are made entirely more ambiguous.\n\nAt the end of For Hero : For Fool, Subtle teeter on that precipice, ready to pass on into the final phase of their adventure -- a quantum leap that?s going to ask much of even their ample imaginations. In the process of reaching that point, they have done something kind of, maybe, dare we say it, ?important.? They?ve begun scrawling their own personal testament to music as a symbiotic medium for dense poetry, started raising a genre-smashing imp of post-modern myth-making that?s learned how to laugh at and see through and catapult over the post-modern null, and, most importantly of all, made a bracing, thrilling, thought-provoking piece of music. Because that special moment in ?Return of the Vein? is only a microcosm of a whole, and that whole?s not just more than the sum of its parts, but exponentially so. This is a complex of modal vessels and emotional blood and cerebral synapses, organized and destined for life, destined to speak. This is how ?You? make a great Album.\n\nChet Betz &amp; Aaron Newell\nSeptember 29, 2006","torrent":{"xt":"urn:btih:3305a5920f9a6507235808c49f33cbc39af1d294","amp;dn":"Subtle+-+For+Hero+For+Fool+%5B2006%5D+MP3+320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3305a5920f9a6507235808c49f33cbc39af1d294","infoHashBuffer":{"type":"Buffer","data":[51,5,165,146,15,154,101,7,35,88,8,196,159,51,203,195,154,241,210,148]},"announce":[],"urlList":[]}}