{"title":"What Makes Business Rock Building the Worlds Largest Global Netw","uid":7211802,"size":3108396,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:33b934f835542c1e0bde05fe11d192f0567ac7be&amp;dn=What+Makes+Business+Rock+Building+the+Worlds+Largest+Global+Netw&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OnlyGill","files":3,"time":1335262868,"description":"What Makes Business Rock - Building the Worlds Largest Global Networks\n\nPublication Date:2011 \nPages:320 Pages\nISBN: 1118004760\nFormat:PDF \nSize:3 MB\n\nGlobal business lessons from Bill Roedy, the man who built the world's largest entertainment network\nWhat Makes Business Rock is the compelling story of how Bill Roedy, the Chairman and CEO of MTV International, built the largest international entertainment network in existence, much of the time having to make up answers for questions which had never before been asked.\nIt's a free-wheeling, rock and rolling tale filled with a fascinating cast of characters including British entrepreneur Robert Maxwell, Rupert Murdoch and Sumner Redstone, Bono, the Pope, and a range of legendary politicians such as Nelson Mandela, Vladimir Putin, and Fidel Castro.\nAn important primer on how to build and manage a business in an environment of continually evolving and developing communications platforms\nDeals with the cultural demands of countries as diverse as China, Zambia, and Ireland\nA business book masquerading as the memoir of one of the most important people in the music industry\nEntertaining and engaging, What Makes Business Rock offers an up close look at Bill Roedy the person and professional, and uncovers the innovative strategies he used to help make MTV the most successful, and best known, media brand in the world.\n\n","torrent":{"xt":"urn:btih:33b934f835542c1e0bde05fe11d192f0567ac7be","amp;dn":"What+Makes+Business+Rock+Building+the+Worlds+Largest+Global+Netw","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33b934f835542c1e0bde05fe11d192f0567ac7be","infoHashBuffer":{"type":"Buffer","data":[51,185,52,248,53,84,44,30,11,222,5,254,17,209,146,240,86,122,199,190]},"announce":[],"urlList":[]}}