{"title":"Kula Shaker - Hey Dude CDS - (1996)[EAC-MP3@320KBPS]","uid":4901659,"size":35852722,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:357c11761e8af8da5ed9b303d6eeb7646f2d0445&amp;dn=Kula+Shaker+-+Hey+Dude+CDS+-+%281996%29%5BEAC-MP3%40320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"seanprince","files":11,"time":1242665951,"description":"Kula Shaker - Hey Dude CDS - (1996)[EAC-MP3@320KBPS]\n\nKula Shaker - Hey Dude CDS\n\nTrack List\n\n01. Hey Dude 04:11\n02. Troubled Mind 03:12\n03. Grateful When You're Dead 03:22\n04. Into The Deep 04:08\n\nBiography by Stephen Thomas Erlewine\n\nBy reviving the swirling, guitar-heavy sounds of late-'60s psychedelia and infusing it with George Harrison's Indian mysticism and spirituality, Kula Shaker became one of the most popular British bands of the immediate post-Britpop era. More musically adept and experimental than Cast, Kula Shaker nevertheless worked the same vaguely spiritual lyrical territory, but musically they brought the overpowering rush of Oasis to psychedelia, a genre that the Mancunians had previously avoided. The band's classicist approach to rock &amp; roll earned them both critical praise and derision, as they quickly rocketed to the top of the British charts.\n\nLed by vocalist/guitarist Crispian Mills (born January 18, 1973; the son of '60s actress Hayley Mills and film director Roy Boulting), Kula Shaker was initially a psychedelic quartet called the Kays, which formed in 1993. In addition to Mills, the Kays featured his teenage friend Alonza Bevan. The two had previously played together in a band named Objects of Desire; during that time they also ran a psychedelic nightclub in the back of an ice rink. Following the dissolution of Objects of Desire, Mills made a spiritual pilgrimage to India, and upon returning he formed the Kays with bassist Bevan, drummer Paul Winter-Hart, and vocalist Saul Dimont. Within a year, Dimont had left and organistist Jay Darlington had joined the band; prior to joining the group, Darlington had played in several mod revival bands. After spending two years touring and recording, releasing two EPs on Gut Reaction Records, the group had not made any headway. According to Mills, the band changed their name and direction in the spring of 1995, when he had an epiphany that the group should be called Kula Shaker after a ninth century emperor and pursue a more spiritual direction. For the next three months, they performed as Kula Shaker, and they quickly received a record contract with Columbia, which was eager to sign another band that had the multi-platinum, crossover appeal of Oasis.\n\n&quot;Grateful When You're Dead,&quot; Kula Shaker's debut single, was released in the spring of 1996 to moderate success, but it was the follow-up single, &quot;Tattva,&quot; that established the band. Peaking at number four on the charts, &quot;Tattva&quot; had a chorus that was adapted from an ancient Sanskrit text and a colorful organ and guitar riff, which essentially encapsulated the band's sound. The single also set the stage for the band's debut, K, which appeared in September of 1996. Upon its release, K entered the charts at number one, becoming the fastest-selling British debut album since Oasis' Definitely Maybe. The album received reviews that ranged from enthusiastic to derisive, but the band continued to gain momentum, which eventually translated to a strong word of mouth in America. Kula Shaker wasn't able to replicate their British success in America, but &quot;Tattva&quot; became a Top Ten modern rock hit in late 1996, and the group received uniformly positive reviews. Peasants, Pigs &amp; Astronauts followed in 1999.","torrent":{"xt":"urn:btih:357c11761e8af8da5ed9b303d6eeb7646f2d0445","amp;dn":"Kula+Shaker+-+Hey+Dude+CDS+-+%281996%29%5BEAC-MP3%40320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"357c11761e8af8da5ed9b303d6eeb7646f2d0445","infoHashBuffer":{"type":"Buffer","data":[53,124,17,118,30,138,248,218,94,217,179,3,214,238,183,100,111,45,4,69]},"announce":[],"urlList":[]}}