{"title":"Serge Gainsbourg - Mauvaises Nouvelles Des Etoiles (Deluxe Editi","uid":11279640,"size":761461434,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:369f36b2f7e6578770b1b19d5ad346051c827dea&amp;dn=Serge+Gainsbourg+-+Mauvaises+Nouvelles+Des+Etoiles+%28Deluxe+Editi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":41,"time":1414201486,"description":"'Aux Armes Et Caetera' is usually cited as Gainsbourg's most celebrated foray into reggae but this superb album - not even given a UK or US release when it was recorded in 1981 - is arguably superior. Sly &amp; Robbie are at their majesterial best and the I-Threes - Judy Mowatt, Rita Marley and Marcia Griffith - provide sumptuous backing vocals throughout (and on the final track, lead vocals). It's hard to fathom quite how seriously Gainsbourg himself was taking it all when he recorded this masterpiece in the Bahamas. Most of the time he sounds so laid-back as to be virtually horizontal and track 9 is a typical slice of puerile Serge mischief (three minutes of farting). But that driving rhythm section and the beautiful female harmonies turn every other track into a gem. I don't speak fluent French so I can't testify to the lyrical profundity or lack of it, but the album's title translates as 'Bad News From The Stars'. The cover portrait on the original issue (white) sleeve is by celebrated UK fashion/portrait photographer David Bailey.\n\nThis is brilliant dinner party backing music, guaranteed to relax even the most stressed-out hyperactive. A magical album to pick up if you can find a copy.\n\nKOS","torrent":{"xt":"urn:btih:369f36b2f7e6578770b1b19d5ad346051c827dea","amp;dn":"Serge+Gainsbourg+-+Mauvaises+Nouvelles+Des+Etoiles+%28Deluxe+Editi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"369f36b2f7e6578770b1b19d5ad346051c827dea","infoHashBuffer":{"type":"Buffer","data":[54,159,54,178,247,230,87,135,112,177,177,157,90,211,70,5,28,130,125,234]},"announce":[],"urlList":[]}}