{"title":"Girls.Can.Code.s01e02.EN.SUB.WEBRIP.[MPup]","uid":12476182,"size":1028981316,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:36d2529b626ec92ac7d76c442c9080224be769db&amp;dn=Girls.Can.Code.s01e02.EN.SUB.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1442988583,"description":"Girls.Can.Code.s01e02.EN.SUB.WEBRIP.[MPup]\n\nFormat: MPEG-4\nSize: 1280x720\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\n[b]2 of 2[/b]\n\nFive girls with a hidden talent for computer coding take on the male-dominated digital world. The girls must turn their cutting-edge coding brainwave into a prototype product.\n\n[img]http://extraimago.com/images/2015/09/23/e34d9550a199ed267f87f3cffddcd993.jpg[/img]\n\nRadio 1's Alice Levine takes five girls who can take selfies and finds out if they can take on and take over the male-dominated digital world.\n\nHalf of all gamers are women - but only 4 per cent code them. Only seven of the richest 100 tech billionaires are women.\n\nAlice Levine is outraged! So she's pushing East End Ellie, ditzy art student Daisy, science boffin Neelam, fashion grad Tolani and wannabe millionaire Arooj into the testosterone-fuelled worth of tech.\n\nIn episode two, the girls must take their cutting-edge coding brainwave and learn how to turn it into a prototype product and a perfect pitch to the great and good of the UK tech world.\n\nIf they can convince the cream of the coding world that they've gone from zeroes to heroes in just a week, their lives might just change forever.\n\nBut along the way, the girls find out that it's not just about a cool idea: the gloves are off as they learn to code, get down and dirty with big data and - toughest of all - overcome their own fears and failures to stand a chance when they pitch their digital product.\n\nWho'll come out on top, and who'll blow a fuse?\n\nAnd as the girls laugh, cry, scream with joy and frustration along the way, they don't know that this is not a rehearsal, and that their lives could be about to change.\n\nFor real","torrent":{"xt":"urn:btih:36d2529b626ec92ac7d76c442c9080224be769db","amp;dn":"Girls.Can.Code.s01e02.EN.SUB.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36d2529b626ec92ac7d76c442c9080224be769db","infoHashBuffer":{"type":"Buffer","data":[54,210,82,155,98,110,201,42,199,215,108,68,44,144,128,34,75,231,105,219]},"announce":[],"urlList":[]}}