{"title":"PetiteHDPorn - Stefany (New Comer) NEW 02 November 2015","uid":12672787,"size":336856360,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:36e05745e1379319baf601e098655fccaebd1066&amp;dn=PetiteHDPorn+-+Stefany+%28New+Comer%29+NEW+02+November+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1446468344,"description":"Hot coed Stefany is a short teen with a taste for cock! She lures Vega into her apartment and then gets started peeling off her clothes in preparation to drop to her knees and give Vega the cock sucking of a lifetime. Although her soft lips and expert blowjob skills make it difficult, Vega eventually pulls himself away so that he can repay the favor with a pussy licking and fingering that gets Stefany wet and wild for more.Now that she's all warmed up, Stefany is happy to roll onto her back and lift her legs in the air so that Vega can slam into her for a tight pussy pounding. Her moans fill the room, and then get louder when she climbs onto Vega's dick for a stiffie ride in her creamy bald twat. While Stefany is grinding away, Vega preps her ass by sliding his finger into her anus.Finally ready for an anal fuck fest, Stefany gets on her hands and knees and offers her bubble butt up to Vega for the taking. He's glad to accept her invitation, pushing himself deep and then going to town on Stefany's juicy bum until they are both moaning their pleasure. When Stefany is totally satisfied, she turns around and puts her mouth back to work sucking and slurping until Vega explodes all over her face and small tits.\r\nCategories: Small Boobs, Shaved Pussy, Short Girls, Brunette, Long hair, Hardcore, Petite, Anal Sex, Blowjob, European, Deep Throat\r\n \nhttp://imgdone.com/viewer.php?file=09171918060761662230.jpg\r\n \nhttp://imgdone.com/viewer.php?file=67606805227640040220.jpg","torrent":{"xt":"urn:btih:36e05745e1379319baf601e098655fccaebd1066","amp;dn":"PetiteHDPorn+-+Stefany+%28New+Comer%29+NEW+02+November+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36e05745e1379319baf601e098655fccaebd1066","infoHashBuffer":{"type":"Buffer","data":[54,224,87,69,225,55,147,25,186,246,1,224,152,101,95,204,174,189,16,102]},"announce":[],"urlList":[]}}