{"title":"The Black Lamb","uid":8682265,"size":56670201,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:38809b9d84639a8dc8b89a67f7786e177efccf97&amp;dn=The+Black+Lamb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fudoh101","files":7,"time":1373728995,"description":"The Black Lamb is a six-issue comic book limited series that takes place in a science fantasy setting. Published in late 1996 and early 1997 by DC Comics as part of their now defunct Helix imprint, the series was written and drawn by Tim Truman.\nSet in an unnamed near future city that has a cyberpunk appearance and feel, The Black Lamb stars a character named Diarmaid Donn, a centuries old vampire who is originally from medieval Ireland. Donn, known as the Black Lamb, is a figure authorized by the supernatural elements of the city, known collectively as the Tribes of the Night, as judge, jury and executioner in matters pertaining to the protection of the Tribes of the Night\n\nTold mostly from the point of view of the title character, a significant amount of time also finds the story told from the point of view of a supporting character named Commissioner Damn. Damn is a police officer who has the ability to sense supernatural beings.\nAlthough some members of the Tribes of the Night live above ground, the majority reside, hidden in secret, in a huge maze of underground caverns beneath the city","torrent":{"xt":"urn:btih:38809b9d84639a8dc8b89a67f7786e177efccf97","amp;dn":"The+Black+Lamb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38809b9d84639a8dc8b89a67f7786e177efccf97","infoHashBuffer":{"type":"Buffer","data":[56,128,155,157,132,99,154,141,200,184,154,103,247,120,110,23,126,252,207,151]},"announce":[],"urlList":[]}}