{"title":"Sade - Babyfather (Xvid-2nafish) 1080p","uid":5540883,"size":165066724,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3948ec0bfd6789a69b3ec68e19a788ccf552c5bf&amp;dn=Sade+-+Babyfather+%28Xvid-2nafish%29+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1273227881,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:09\n\n[Video]\nResolution : 1920x1080\nCodec : XviD MPEG-4 codec\nFPS : 23.98\nBitRate : 4966 Kbps\nQuality Factor : 0.10 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Babyfather&quot; is a song from the English soul  and R&amp;B group Sade. It is the second single from their sixth studio album, Soldier Of Love.\n\nThe music video which sees people wearing bright-colored outfit is directed by Sophie Muller who also took picture for the single's cover art. It premiered on May 4, 2010 and it features frontwoman Sade Adu  as a homemaker who is doing daily chores from cooking to washing dishes to doing the laundry. \n\nIn this Reggae-flavored number, Adu sings of a male figure who can be the father of a woman's child and a strong male role model, without necessary being a life mate. Frontwoman Sade Adu told to People that &quot;Babyfather,&quot; is &quot;about how great it is to be a parent, what a great honor and privilege that is, and what a terrible thing that is to waste,&quot;. &quot;As long as you feel good about yourself, you can be a good parent, and then it becomes an endless fruitful cycle,&quot; she says. As for the sound of the new song, &quot;I wanted it to sound quite rough and scrappy, not too honed,&quot; says the Grammy-winning singer, 51. With a little whimsy mixed in, too. &quot;The beginning,&quot; says Sade, &quot;feels like the ice cream van coming down the street&quot;.\n\nSoldier of Love is the sixth studio album by the English group Sade. It is their first album of original material since Lovers Rock (2000). The album was initially released on 5 February 2010 in Germany, and it was released worldwide on 8 February 2010 and in the United States on 9 February 2010. The first single &quot;Soldier of Love&quot; premiered on 8 December 2009 on the group's official website.\n\nThe album debuted at number four on the UK Albums Chart, becoming their highest debut since Stronger Than Pride (1988). It also debuted at number one on the U.S. Billboard 200 with first-week sales of 502,000 copies in the United States, making it Sade's first U.S. number-one debut. Upon its release, Soldier of Love received generally positive reviews from most music critics.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:3948ec0bfd6789a69b3ec68e19a788ccf552c5bf","amp;dn":"Sade+-+Babyfather+%28Xvid-2nafish%29+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3948ec0bfd6789a69b3ec68e19a788ccf552c5bf","infoHashBuffer":{"type":"Buffer","data":[57,72,236,11,253,103,137,166,155,62,198,142,25,167,136,204,245,82,197,191]},"announce":[],"urlList":[]}}