{"title":"Bagdad.La vida continua.(Docu.Spanish).WTorents.Com","uid":5520149,"size":587216896,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:394d93578f62fe77b4483860ffbc85ba95d73413&amp;dn=Bagdad.La+vida+continua.%28Docu.Spanish%29.WTorents.Com&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"cholo24","files":1,"time":1272570256,"description":"Bagdad la vida continua\n\nUn documental de 56 minutos dirigido por Marie Ange Poyet y Louis AndrÃƒÂ© Morand, una co-produciÃƒÂ³n francesa Agat Films &amp; Cie / ARTE France que nos ofrece la vida cotidiana de una familia en una ciudad como Bagdad de la que solo se ve guerra. SegÃƒÂºn muestra este documental, aÃƒÂ±os despuÃƒÂ©s de la intervenciÃƒÂ³n militar americana y la caÃƒÂ­da de Bagdad el 9 de abril de 2003, Iraq oficialmente ya no esta en guerra. Es simplemente un paÃƒÂ­s ocupado por las fuerzas de la coaliciÃƒÂ³n que han decidido imponer una democracia a su elecciÃƒÂ³n. Lejos de las historias de los medios de comunicaciÃƒÂ³n occidentales, llenas de ataques terroristas, los nÃƒÂºmeros de muertos y la caÃƒÂ­da de un tirano, la vida de los iraquÃƒÂ­es continÃƒÂºa. En Bagdad, una mujer, ZouaÃƒÂ¯da Yacine Nasser, intenta proteger a su familia contra el caos. Y a pesar del peligro para su familia y ella misma, ZouaÃƒÂ¯da dejÃƒÂ³ permanecer en su hogar a un equipo de televisiÃƒÂ³n para realizar este documental. Viviendo en el mismo edificio se encuentran parados, un oficial ex-militar que es conductor de taxi para alimentar a sus cinco niÃƒÂ±os, una estudiante de universidad, un alumno de secundaria, miembro del ejÃƒÂ©rcito de Mahdi, las mujeres que nunca salen del hogar, niÃƒÂ±os, bebÃƒÂ©s: Iraq shiita tradicional en dos pisos de un edificio en el distrito de Amin 2 del Al, un suburbio de clase baja de Bagdad suroriental.\n","torrent":{"xt":"urn:btih:394d93578f62fe77b4483860ffbc85ba95d73413","amp;dn":"Bagdad.La+vida+continua.%28Docu.Spanish%29.WTorents.Com","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"394d93578f62fe77b4483860ffbc85ba95d73413","infoHashBuffer":{"type":"Buffer","data":[57,77,147,87,143,98,254,119,180,72,56,96,255,188,133,186,149,215,52,19]},"announce":[],"urlList":[]}}