{"title":"System Shock 2 GoG","uid":8143893,"size":721775643,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:397d0e513e4f091be9410eeb64f63f39b7cfaca4&amp;dn=System+Shock+2+GoG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1360864464,"description":"    genre     rpg / fpp / sci-fi\n    download size     363 MB\n    release date     August 11, 1999\n    compatible with     Windows (XP, Vista, 7, 8)\n    languages     English, German\n    developer / publisher     Irrational Games and Looking Glass / Night Dive Studios\n    game modes     single-player, co-op\n\nThe most requested game on the GOG.com wishlist has arrived at last!\nThree character profiles to choose from, each with its own strengths and weaknesses: the psionic power-wielding agent, the naval officer--a masterful hacker, and the marine, a combat specialist.\nYou don't have to face the horror alone. Play the story with up to three friends in the co-op multiplayer mode.\n\nThe second--and best!--game in the series stands all on its own as a masterpiece of gaming history. The starship Von Braun took a giant leap for mankind as it made its first interstellar journey. The mission was going as planned until a lone distress call from the Tau Ceti V sector was picked up. An away team was sent on a rescue mission, but once it arrived at its destination, there was no sign of any humans and the source of the signal remained unclear. They didn't realize something crucial, though: they brought something back with them when they returned. Now, you--a member of the ship's security team--awake from cryostasis to the sounds of screams of pain and horror as everything falls apart. The state-of-the-art spaceship becomes a deathtrap, and the only hope you have is the contemptuous whisper of a voice guiding you through the dark corridors, leading you towards the ominous secrets that lurk in the shadows.\n\nA game like this is a masterpiece; you must experience it firsthand. System Shockï¿½ 2 arguably offers the most intense storytelling in the history of computer games. It perfectly splices Sci-Fi with survival horror, FPS gameplay with character stats, upgrades, and inventory system of the role-playing genre, fast paced action with chilling terror. As you slowly and carefully explore your surroundings, the game begins to swallow you whole, and soon enough you feel completely immersed in the terrifying reality of an interstellar ghost-ship. Then, even years after your first contact with the game, just hearing the words &quot;System Shockï¿½ 2&quot; will make your heart race. This is going to be a hell of a journey, for a pathetic creature of meat and bone such as yourself.\n\n-&quot;10 out of 10&quot; - Computer Games Magazine\n-&quot;An advanced, progressive spin on first-person gaming&quot; - Edge Online\n-&quot;One of the 100 best games of all time&quot; - Empire Online\n-&quot;95%&quot; - PC Gamer\n-&quot;Greatest Games of all Times&quot; list - Gamespot\n-&quot;Top 50 Greatest Games of All Time&quot; list - Gamespy\n\nAge requirements: ESRB Rating: MATURE with Animated Blood and Gore, Animated Violence.\n\nMinimum system requirements: Windows XP / Vista / 7 / 8, 1.8 GHz Processor, 2 GB RAM, 3D graphics card compatible with DirectX 9.0c, 2GB HDD, Mouse, Keyboard. \n\nInstall and Play.","torrent":{"xt":"urn:btih:397d0e513e4f091be9410eeb64f63f39b7cfaca4","amp;dn":"System+Shock+2+GoG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"397d0e513e4f091be9410eeb64f63f39b7cfaca4","infoHashBuffer":{"type":"Buffer","data":[57,125,14,81,62,79,9,27,233,65,14,235,100,246,63,57,183,207,172,164]},"announce":[],"urlList":[]}}