{"title":"DarkComet RAT v5.3 -- No Longer Avail From Developer","uid":7409429,"size":27153419,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3997498ce5a1ad526216307b11d523d828529458&amp;dn=DarkComet+RAT+v5.3+--+No+Longer+Avail+From+Developer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"js3","files":190,"time":1341339335,"description":"I'm uploading this here myself for the sake of anyone who still finds a use for it. The program in question is DarkComet RAT v5.3, a relatively up-to-date (as in a few weeks ago from this upload) Backdoor Trojan. For anybody (hackers!) who could find a use for this piece of software, it's now available here on TPB. I will seed this for as long as I need to. Please splatter further across the net (cyberlockers, etc) for further availability.\n\nThe reason for uploading this is that after it was revealed that the Syrian government had used this to spy on their own people. That's not good, naturally, but it prompted the developer to remove the software from his website and shut down the project. The software is no longer available for download from the official source.\n\nHowever, it's stupid to assume that just because evil people use something, that it can only therefore be used for evil purposes. I feel the developer was rather rash in taking his software down, and thus, me having a rather updated copy lying around on my computer, I'm putting it back onto the web.\n\nNaturally having a good claim to being classed as malware, this software could be used for rather...uncouth purposes. I'm putting the original's dev's TOS below, which somes up what his original intentions for the software's use were. I'm not however saying anything from a personal point of view-- I don't really care what you use this for, just generally that's not towards TOO bad of a cause. The TOS is only added for the sake of demonstrating what DarkCoderSC's wishes were while he still distributed this program himself, and cannot be considered at all binding from my end of things.\n\nIf your anti-viral programs flags this as malicious software-- that's because it is.\n\nThe original TOS was going to be included in the desc, but TPB had some technical issues so I uploaded it to http://pastebin.com/UUW2L2HP\n\nDarkCoderSC also asked that:\n\n* You Promised you will never spread this tool and use it only inside your own network.\n* You admit to be the single responsible person in case of damage or pursuit.\n\n------------------------------------------------------------------------------\n\nAgain, these were his views, not mine, so please note that. I'm sharing this software out to everyone regardless, in the name of information freedom and free speech.\n\nUse responsibly, JS3.","torrent":{"xt":"urn:btih:3997498ce5a1ad526216307b11d523d828529458","amp;dn":"DarkComet+RAT+v5.3+--+No+Longer+Avail+From+Developer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3997498ce5a1ad526216307b11d523d828529458","infoHashBuffer":{"type":"Buffer","data":[57,151,73,140,229,161,173,82,98,22,48,123,17,213,35,216,40,82,148,88]},"announce":[],"urlList":[]}}