{"title":"Pete Townshend - Let My Love Open the Door [promo].VOB","uid":9282070,"size":140335104,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3a7d629a6e134f364a5a4aaed7a552447abdd65b&amp;dn=Pete+Townshend+-+Let+My+Love+Open+the+Door+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1385952496,"description":"Pete Townshend - Let My Love Open The Door [promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Let My Love Open the Door&quot; is a song written and performed by Pete Townshend from his 1980 album  Empty Glass. It reached the top ten in America in that same year, reaching number nine.\n\nThis was Pete Townshend's only solo American Top 10 hit, but it charted as high as any single by The Who released in America - &quot;I Can See For Miles&quot; also hit #9\n\nPeter Dennis Blandford &quot;Pete&quot; Townshend (born 19 May 1945) is an English rock musician, composer, multi-instrumentalist, vocalist, songwriter and author, known principally as the guitarist and songwriter for the rock group The Who, as well as for his own solo career. His career with The Who spans more than 40 years, during which time the band grew to be considered one of the most influential bands of the 1960s and 1970s.\n\nTownshend is the primary songwriter for The Who, having written well over 100 songs for the band's 11 studio albums, including concept albums and the rock operas Tommy and Quadrophenia, plus popular rock and roll radio staples such as Who's Next, and dozens more that appeared as non-album singles, bonus tracks on reissues, and tracks on rarities compilations such as Odds &amp; Sods. He has also written over 100 songs that have appeared on his solo albums, as well as radio jingles and television theme songs. Although known primarily as a guitarist, he also plays other instruments such as keyboards, banjo, accordion, harmonica, ukulele, mandolin, violin, synthesiser, bass guitar and drums, on his own solo albums, several Who albums, and as a guest contributor to a wide array of other artists' recordings. He is self-taught on all of the instruments he plays and has never had any formal training.\n\nTownshend has also been a contributor and author of newspaper and magazine articles, book reviews, essays, books, and scripts, as well as collaborating as a lyricist (and composer) for many other musical acts. Townshend was ranked No. 3 in Dave Marsh's list of Best Guitarists in The New Book of Rock Lists, No. 10 in Gibson.com's list of the top 50 guitarists, and No. 10 again in Rolling Stone magazine's updated 2011 list of the 100 greatest guitarists of all time. Townshend was inducted into the Rock and Roll Hall of Fame as a member of The Who in 1990.\n(video does not have any logos)\n\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Let_My_Love_Open_the_Door&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Let_My_Love_Open_the_Door&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/PacoFAaFj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/PacoFAaFj&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:02:44\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.1\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:3a7d629a6e134f364a5a4aaed7a552447abdd65b","amp;dn":"Pete+Townshend+-+Let+My+Love+Open+the+Door+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a7d629a6e134f364a5a4aaed7a552447abdd65b","infoHashBuffer":{"type":"Buffer","data":[58,125,98,154,110,19,79,54,74,90,74,174,215,165,82,68,122,189,214,91]},"announce":[],"urlList":[]}}