{"title":"Overcome Masturbation Addiction","uid":4583445,"size":10124742,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3aca791d80e439b09ed23792fcd4b51fc4364e6a&amp;dn=Overcome+Masturbation+Addiction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prince213","files":2,"time":1229525861,"description":"Product Details\n\n    * Language: English\n    * Type: Audio Book\n    * Format: MP3 @ 64 Kbps\n    * Publisher: Uncommon Knowledge\n\nProduct Description\n\nExcessive masturbation can leave you feeling tired and washed out. Masturbation addiction can get in the way of you living a normal life, leave you feeling ashamed and impact your self esteem.\n\nMasturbation addiction steals from you\n\nWhen masturbation becomes a compulsion and starts taking over your life then it becomes a problem. Maybe you've found that you have had to stop what you are doing to go and whack off? Perhaps it feels like something you must go and do like getting the fix from a drug.\n\nIf you are experiencing masturbation addiction you'll have been unconsciously using masturbation as an attempted solution to stress, boredom, loneliness or low self-esteem.\n\nMasturbation like any 'fix' can be used as a way of escaping reality. But masturbation never really solves what it seems to promise to fix. Of course it doesn't prevent loneliness, life dissatisfaction, or other worries.\n\nWhen you suffer from masturbation addiction then you get to the point where you have to masturbate just to feel normal!\n\nWhen you cut your masturbation frequency down to a level that feels right, that doesn't take up unnecessarily large chunks of time or sap your energy then you really feel back in control.\n\nImagine having control back and really starting to meet some of your needs in genuinely successful ways.\n\nDownload Overcome Masturbation Addiction now and get your life back on track. \n\n\nVisit http://prince213.blogspot.com/ for more...","torrent":{"xt":"urn:btih:3aca791d80e439b09ed23792fcd4b51fc4364e6a","amp;dn":"Overcome+Masturbation+Addiction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3aca791d80e439b09ed23792fcd4b51fc4364e6a","infoHashBuffer":{"type":"Buffer","data":[58,202,121,29,128,228,57,176,158,210,55,146,252,212,181,31,196,54,78,106]},"announce":[],"urlList":[]}}