{"title":"Coast to Coast AM December 10 2012","uid":7911959,"size":56330809,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3b46360cbec72c8bc46304e7a8275dc72492e218&amp;dn=Coast+to+Coast+AM+December+10+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1355242391,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t12-10-12\nHost: \tGeorge Noory\nGuests: \tCatherine Austin Fitts, Loren Coleman\n\nInvestment advisor Catherine Austin Fitts offered analysis and commentary regarding the current 'fiscal cliff' that the United States is facing. If Congress doesn't act, the Bush era tax cuts, and the payroll tax decrease will end on January 1st, possibly sending the US economy into a tailspin. If this happens, the average household would experience a $2200 to $3500 tax increase, as well as govt. spending cuts that could impact their revenue in a variety of ways, she reported. However, if the US does go 'over the cliff,' come January, she believes Congress will face tremendous pressure to remedy the situation quickly.\n\nFitts considers the fiscal cliff to be symptomatic of a deeper problem-- structural issues in the US economy that haven't been addressed, and a populace that has grown to mistrust a system that's encouraged questionable financial behavior. The US shifted to become a global empire through siphoning off the retirement savings of the Baby Boomer generation, she declared. But we could restore the American economy in 5-10 years, if we took, for example, just 50% of the money that was spent on lotteries and hard narcotics, and put it into rebuilding small businesses and farms, with new technology, she suggested.\n\nThe economic pie has been shrinking because of increased centralized control, and one way that's accomplished is through less cash, and more digital technology and currency, she cautioned. We're also seeing a kind of &quot;global re-balancing&quot; taking place. As the middle class grows in countries like China, America will be more evenly balanced between population and resources (at the end of WWII, it had 6% of the people and a staggering 50% of the resources), which could be a boon to those involved in growing emerging markets, Fitts pointed out.\nBigfoot DNA Update\n\nFirst hour guest, cryptozoologist Loren Coleman responded to the latest Bigfoot news, including the story regarding Dr. Melba Ketchum's purported sequencing of Bigfoot DNA. He expressed frustration that the controversial story was leaked to the public before the publishing of her research, and noted that the topic is stirring up premature arguments amongst various Bigfoot researchers. Coleman also talked about his International Cryptozoology Museum, which has been in operation for 10 years and recently moved to larger quarters.\n\nNews segment guest: Mitch Battros\nWebsite(s):\n\n    solari.com\n    cryptomundo.com\n    lorencoleman.com\n\nBook(s):\n\n    Bigfoot! The True Story of Apes in America\n    True Giants: Is Gigantopithecus Still Alive?\n    Cryptozoology A to Z\n    Tom Slick: True Life Encounters in Cryptozoology\n","torrent":{"xt":"urn:btih:3b46360cbec72c8bc46304e7a8275dc72492e218","amp;dn":"Coast+to+Coast+AM+December+10+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b46360cbec72c8bc46304e7a8275dc72492e218","infoHashBuffer":{"type":"Buffer","data":[59,70,54,12,190,199,44,139,196,99,4,231,168,39,93,199,36,146,226,24]},"announce":[],"urlList":[]}}