{"title":"When The Wind Blows - James Patterson.epub","uid":8951062,"size":411420,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3be1928147d0085be5a934dacc4a99a93d31d2f1&amp;dn=When+The+Wind+Blows+-+James+Patterson.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1379886877,"description":" With five previous number one megabestsellers to his name, James Patterson can take some risks. Acclaimed for his Alex Cross series Â— Along Came a Spider, Kiss the Girls, Jack &amp; Jill, Cat &amp; Mouse Â— Patterson strikes an entirely new chord with When the Wind Blows. A chilling suspense novel Â— perhaps too realistic for comfort Â— Patterson combines jaw-dropping scenes, heart-pounding plot twists, and memorable characters in one unforgettable package.\n\nSet against a sinister backdrop of genetic engineering and illegal scientific experimentation, When the Wind Blows dares readers to test their notions of human evolution and medical science. Frannie O'Neill is a caring young veterinarian living in the Colorado Rockies, trying to erase the memory of her beloved husband's mysterious murder. It is not long before another neighbor suddenly dies, and FBI agent Kit Harrison arrives at Frannie's doorstep. Kit is hell-bent on solving the heinous case despite resounding protests from the FBI and the thrashing of his own internal demons.\n\nKit secretly pursues the investigation, yet witnesses keep turning up dead. Then Frannie stumbles upon an astonishing discovery in the nearby woods, and their lives are altered in ways they could never have imagined. Simply knowing the secret of Max Â— the terrified 11-year-old girl with an amazing gift Â— could mean death.\n\nAs more and more diabolical details are unearthed, the murderer's bloody trail ultimately leads the trio to an underground lab network, known as &quot;the School.&quot; Herescientistsconduct shockingly incomprehensible experiments involving children and genetic alteration.\n\nBut perhaps not so unfathomable: Doctors and medical researchers who have read Where the Wind Blows say the events described in this book could actually be a reality in the next 20 to 30 years. If not before.","torrent":{"xt":"urn:btih:3be1928147d0085be5a934dacc4a99a93d31d2f1","amp;dn":"When+The+Wind+Blows+-+James+Patterson.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3be1928147d0085be5a934dacc4a99a93d31d2f1","infoHashBuffer":{"type":"Buffer","data":[59,225,146,129,71,208,8,91,229,169,52,218,204,74,153,169,61,49,210,241]},"announce":[],"urlList":[]}}