{"title":"Vagrant.Hearts.v1.0-TE","uid":6322201,"size":90144460,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3c4509a5269b35b0e578eb09da164f008d190037&amp;dn=Vagrant.Hearts.v1.0-TE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MAFIAA.","files":21,"time":1302974215,"description":"TE 2011 PRESENTS\n\nANOTHER FINE RELEASE\n\nRelease: Vagrant Hearts v1.0 (c) 2011 Warfare Studios\n\nDate: 04/16/2011\n\nCracked By: Twisted EndZ\n\nRelease Type\nRegistration/Serial Crack\nActivation Crack\nTrial Crack\nServer Check Crack\nSerial\nHidden/Added Features Enabler\nX Other: Armadillo\n\nLoader Patcher        Patch      X Precracked        RegFile\nKeygen\n\nRELEASE NOTES\n\nIn a world scared by wars and conflicts, where power is the\nultimate solution for lords and kings, the people have always\nbeen left behind, their interest and beliefs is of no\nsignificance in times of war. There is one organization, called\nThe Brotherhood, which was built by wise individuals with the\npurpose of the aiding the people, to satisfy it's needs. After\nmany years of struggling, the people of Azulel can finally see a\ntiny light at the end of the tunnel\n\nStoryline\n\nThe sisters Scarllet and Beatrice have lived their entire life in\ntheir hometown Ganto. After their mother passed away due to a\nfatal illness, they both became even closer to each other. As the\nyears went by Beatrice started to discover her &quot;gift&quot;, the\nability to heal anyone from anything with a simple touch, she\nbecame the village's healer and such ability eventually caught\nthe interest of the Brotherhood. A guardian from the organization\nwas sent to Ganto Village, where Scarllet and Beatrice are\nwaiting to start a journey that will change their lives\nforever\n\nCharacters\n\nScarllet - The older sister, and as such, after their mother\npassed away Scarllet always believed that she was the\none who had to protect Beatrice, and that is what she\ndoes. Obstinated and fearless, Scarllet has always\nbeen a little skeptical about the Brotherhood\n\nBeatrice - She always looked up to her sister, even though she\nwrongly created the idea on her mind tha she will\nnever be as strong as her. Beatrice is deeply grateful\nto Scarllet and would follow her in whatever she\ndecides. Her gift consists of healing people with a\nsimple touch\n\nWyatt - Childhood friend of Scarllet and Beatrice, Wyatt is a\nsincere and honest man, from the very first time he saw\nScarllet he always recognized in her traits that he\nwished to see on himself, which created in him a deep\nfeeling of admiration for her or perhaps, something\nelse\n\nRazima - A brave and powerful warrior at the Brotherhood\nservice. He became a guardian while still a young boy,\nhis dedication and honor to the duty made him the best\nRazima was recently assigned to guard Beatrice after his\nlonglife protegee no longer needed his services\n\nSylph - A former member of the Radicals, a group of anarchists\nthat opposes the aristocracy. Sylph was recruited by\nElijah himself, the leader of the Brotherhood, he saw\npotential in her. She will do anything for him, Elijah is\nlike a father for Sylph and her loyalty to him is\nsupreme\n\nJansen - While being a very valuable ally for the Brotherhood due\nto his capabilities, Jansen is oftenly mocked and judged\nby his late father's actions, he is the son of Valmor,\nthe one that started the &quot;Divine War\n\nUhra - She is a proud member of the Ful'qa Tribe, perhaps the\noldest civilization in Azulel, while not as strong as it\nused to be, the tribe still stands fiercely for it's\nprinciples and Uhra makes that the Ful'qa are always\ngetting what they want, even if it means getting her hands\ndirty\n\nHellius - A powerful and respected Sorcerer, Hellius tries to\nlive his life quietly and peacefully in an attempt to\nmake up for all his lost time in the battlefields, at\nleast that is how he sees it. A former member of the\nBrotherhood, the reasons of his departure remains\nunknown\n\nLynch - Feared by both allies and enemies, Lynch is a knight of\nthe Brotherhood, very little is known about his past and\nwhat really motivates him. Lynch finds pleasure in a good\nbattle which makes of the battlefield, his home\n\nFeatures\n\n- 10 Optional Bosses\n- Special Crests\n- Hidden Dungeons\n- Hidden Characters\n- Ultimate Weapons\n\nSystem Requirements\n\nDownload Size: 85 MB\nOperating System: Windows XP/2k/Vista/Win7\nRAM: 256 MB\n\nFor More Info on Vagrant Hearts Visit &lt;a href=&quot;\nhttp://warfarestudios.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://warfarestudios.com&lt;/a&gt;\n\nTE Release Filename: tvahe10x.zip\n\nINSTALLATION NOTES\n\nInstall VG.exe.  Copy precracked exe from the Crack folder to the\ninstalled folder of Vagrant Hearts, making sure to overwrite the\nexisting file.  You now have a fully activated version of Vagrant\nHearts\n\nThats it  Enjoy\n\nT E  2 0 1 1\n\nascii\nby mx\n\nDon't Hate The Hacker,  Hate The Code","torrent":{"xt":"urn:btih:3c4509a5269b35b0e578eb09da164f008d190037","amp;dn":"Vagrant.Hearts.v1.0-TE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c4509a5269b35b0e578eb09da164f008d190037","infoHashBuffer":{"type":"Buffer","data":[60,69,9,165,38,155,53,176,229,120,235,9,218,22,79,0,141,25,0,55]},"announce":[],"urlList":[]}}