{"title":"The Beatles -  Baby It's You [original promo].VOB","uid":8699923,"size":97921024,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:3e01ca17c8e561c2b04b0d1a9d91471c389b4645&amp;dn=The+Beatles+-++Baby+It%27s+You+%5Boriginal+promo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1374038780,"description":"The Beatles -  Baby It's You [original promo].VOB\n\n\nHQ very rare promo music video.  &quot;Baby It's You&quot; is a song written by Burt Bacharach (music), and Luther Dixon (credited as Barney Williams) and Mack David (lyrics). It was recorded by the Shirelles and the Beatles, and became hits for both. The highest-charting version of &quot;Baby It's You&quot; was by the band Smith, who took the song to number five on the US charts in 1969.\n\nThe Beatles version:\nThey performed &quot;Baby It's You&quot; as part of their stage act from 1961 until 1963, and recorded it on February 11, 1963 for their first album, Please Please Me, along with &quot;Boys&quot;, another song by the Shirelles. American label Vee-Jay Records included it on Introducing... The Beatles and Songs, Pictures and Stories of the Fabulous Beatles. Capitol included it on The Early Beatles.\n\nA live version was released on Live at the BBC in 1994. The song was issued as a CD single and a vinyl single in 1995 in both the UK and the US, the Beatles' first in nearly a decade. Both versions have four tracks, making it an EP instead of a regular issue single. It reached number seven in the UK and number 67 on the Billboard Hot 100.\n\nThe Beatles were an English rock band formed in Liverpool in 1960. They became the most commercially successful and critically acclaimed act in the rock music era. The group's best-known lineup consisted of John Lennon, Paul McCartney, George Harrison, and Ringo Starr. Rooted in skiffle and 1950s rock and roll, the Beatles later utilized several genres, ranging from pop ballads to psychedelic rock, often incorporating classical and other elements in innovative ways. In the early 1960s, their enormous popularity first emerged as &quot;Beatlemania&quot;, but as their songwriting grew in sophistication, they came to be perceived by many fans and cultural observers as an embodiment of the ideals shared by the era's sociocultural revolutions. \n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Baby_It's_You&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Baby_It's_You&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/KANLfAAEM&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/KANLfAAEM&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 4000kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 448kbps\n   Duration: 00:02:54\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.6.8\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:3e01ca17c8e561c2b04b0d1a9d91471c389b4645","amp;dn":"The+Beatles+-++Baby+It%27s+You+%5Boriginal+promo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e01ca17c8e561c2b04b0d1a9d91471c389b4645","infoHashBuffer":{"type":"Buffer","data":[62,1,202,23,200,229,97,194,176,75,13,26,157,145,71,28,56,155,70,69]},"announce":[],"urlList":[]}}