{"title":"Love Thy Neighbour S01 Complete","uid":4838426,"size":1413984561,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3e0c1ac9b89c2ad49d6c402fb9a1941854abdfcb&amp;dn=Love+Thy+Neighbour+S01+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Osoph92","files":8,"time":1239406262,"description":"Love Thy Neighbour was hugely popular in the 1970s. During that era, Britain struggled to come to terms with its recently arrived population of black immigrants, and Love Thy Neighbour exemplified this struggle. It aroused great controversy for many of the same reasons as the earlier Till Death Us Do Part. The views of the white male character (Eddie Booth, played by Smethurst) were presented in such a way as to make him appear stupid and bigoted, and were contrasted with the more tolerant attitude of his wife. His use of terms such as nig-nog to refer to his black neighbour, despite being intended as ironic by the script-writers, attracted considerable criticism from viewers. The male black character was, in contrast educated and sophisticated, although stubborn and also capable of racism using the terms Honky, Snowflake, Paleface or Big White Chief to describe his white neighbour.\n\n\nThe first series was however released on a Region 2 DVD in October 2003, with series 2 following in May 2004. The film version was also released on DVD in 2004. In the original version of the pilot episode, which has never been screened, the role of Joan was played by Gwendolyn Watts. It is featured on the Series One DVD (disc four).\n\n\nThe series has since been shown in the UK on satellite television with warnings about content at the start of each show.","torrent":{"xt":"urn:btih:3e0c1ac9b89c2ad49d6c402fb9a1941854abdfcb","amp;dn":"Love+Thy+Neighbour+S01+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e0c1ac9b89c2ad49d6c402fb9a1941854abdfcb","infoHashBuffer":{"type":"Buffer","data":[62,12,26,201,184,156,42,212,157,108,64,47,185,161,148,24,84,171,223,203]},"announce":[],"urlList":[]}}