{"title":"Band Of Brothers - (2001) DVDRip Eng Xvid AC3 AVI [Bigjazz]","uid":5154326,"size":6815230853,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3f08d60eace1b1e9e0e197625aba6d7070fb5ed6&amp;dn=Band+Of+Brothers+-+%282001%29+DVDRip+Eng+Xvid+AC3+AVI+%5BBigjazz%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bigjazz.h33t","files":32,"time":1257760932,"description":"-------------------------------------------------------------------\n-------------------------------------------------------------------\n\nBand Of Brothers - (2001) DVDRip Eng Xvid AC3 AVI\n\nTitle:\t\tBand Of Brothers\nRelease:\t2001 (DVD: 2002)\nIMDb Rating:\t9.6, 65,822 votes\nIMDB Link:\thttp://www.imdb.com/title/tt0185906/\n\nEncoding\n\nResolution:\t576x320\nBitrate:\t~1120kbps @ 25fps\nCodec:\t\tXvid, v1.2.2\nFormat:\t\tAudio Video INterleave (.avi)\n\nAudio;\nTrack 1:\t5.1 Channel AC3 @ 384kbps, English\n\nSubtitles:\tEnglish\n\nSource:\t\tPAL DVD, Region 4\n\nThe story of Easy Company of the US Army 101st Airborne division and their mission in WWII Europe from Operation Overlord through V-J Day.\n\nCast:\nScott Grimes ...  Sgt. Donald Malarkey\nDamian Lewis ...  Maj. Richard D. Winters\nRon Livingston ...  Capt. Lewis Nixon\nDonnie Wahlberg ...  2nd Lt. C. Carwood Lipton\nShane Taylor ...  Cpl. Eugene Roe\nPeter Youngblood Hills ...  Sgt. Darrel 'Shifty' Powers\n\nBand Of Brothers - Disc 1\n01 - Currahee\nEasy Company is introduced to Captain Sobel, who has the group undergo hard and unfair training. As a result, Sobel comes into conflict with his men, including Richard Winters, his executive officer. The company is shipped to England to prepare for D-Day. After displaying a lack of leadership ability in the field, Sobel is reassigned.\nRuntime:\t71mins\nFile Size:\t760.MB\n\n02 - Day Of Days\nEasy Company lands in Normandy, scattered all across and away from their drop zone. 1st Lt. Meehan, commander of Easy, is killed when his plane suffers a direct hit and 1st Lt. Winters must take command. With a small group of men, Winters takes out a set of guns at Bracourt and thereby wins the respect of his fellow soldiers as a leader. 1st Lt. Speirs is introduced, around whom rumours start to circulate after he is believed to have massacred a group of German prisoners of war.\nRuntime:\t50mins\nFile Size:\t541MB\n\n03 - Carentan\nEasy Company are sent to liberate the French village of Carentan, where they lose several men in heavy fighting. The episode focuses on Private Albert Blithe, who struggles with crippling anxiety following the battle. After he is finally spurred into action by Winters during a German counterattack, Blithe overcomes his fears but days later gets shot in the neck by a German sniper after volunteering to be lead scout in a patrol.\nRuntime:\t63mins\nFile Size:\t634.4MB\n\n04 - Replacements\nNew characters are introduced when replacements join Easy Company, who struggle to be accepted by the veterans who fought at Normandy. The Company is sent to parachute into and fight in the Netherlands as part of Operation Market Garden, where they liberate Eindhoven. During combat in Nuenen, the replacements integrate themselves with the Company, but the Company is forced to retreat. The episode follows Sergeant Denver &quot;Bull&quot; Randleman, the replacements' immediate superior, as he evades German soldiers in Nuenen after being cut off and forced to stay there and must wait until the enemy leaves in the morning.\nRuntime:\t57mins\nFile Size:\t619.3MB\n\n05 - Crossroads\nWinters writes a report on the challenge of an unexpected resistance to a German attack, and is haunted by his conscience after shooting a teenage German soldier; this flashback occurs several times in later episodes. Operation Pegasus is depicted. Easy Company is called to Bastogne to repel the sudden German counterattack.\nRuntime:\t54mins\nFile Size:\t578.5MB\n\n06 - Bastogne\nEasy Company experiences the Battle of the Bulge and have to hold ground near Bastogne while running low on ammunition and other supplies. The episode focuses on medic Eugene &quot;Doc&quot; Roe as he helps out his fellow soldiers where he can, while also scrounging for medical supplies, of which the Company is dangerously low. He also befriends a Belgian nurse in Bastogne, who is later killed during a German bombing raid.\nRuntime:\t65mins\nFile Size:\t698.1MB\n\n07 - The Breaking Point\nEasy Company battles near Foy, Belgium, losing numerous men. In the episode, the actions of 1st Lt. Norman Dike, the Company's commander, are examined and questioned. He is eventually relieved by 1st Lt. Ronald Speirs, who becomes the Company's new leader. Serving as narrator is 1st Sgt. Carwood Lipton, who attempts to keep the morale of the men up as they endure their trials in the forest near Foy, earning him a pending field promotion to 2nd. Lt. for his leadership ability.\nRuntime:\t70mins\nFile Size:\t756.2MB\n\n08 - The Last Patrol\nEasy Company carries out a dangerous mission in Haguenau as David Webster (who narrates this episode) returns from a hospital. Together with new replacement 2nd Lt. Jones, he eventually (re)integrates with the other soldiers, whose experiences at Bastogne have made them weary and closed off from Webster due to the fact he didn't try to leave hospital early unlike other soldiers in the company. At the end of the episode, Captain Winters is promoted to Major, and Lipton is promoted to 2nd Lt.\nRuntime:\t57mins\nFile Size:\t612.3MB\n\n09 - Why We Fight\nAs Nixon battles alcoholism, Easy Company enters Germany. A concentration camp near Landsberg is discovered by a patrol. This site leaves many soldiers both shocked and disgusted at what they're witnessing at the hands of the Nazi Germans. The episode was based on the liberation of Kaufering IV in the area of Hurlach.\nRuntime:\t56mins\nFile Size:\t604.2MB\n\n10 - Points\nThe company captures Eagle's Nest in Berchtesgaden, and also discover Hitler and Goering's large supply of liquor. The end of the war is announced. While those with enough points go home, the remainder of Easy Company stays behind until the end of the Pacific War is declared.\nRuntime:\t60mins\nFile Size:\t647.2MB\n\n-------------------------------------------------------------------\nPlease share....Don't hit and run...Seed it back at least once.\n\nOf course, if you want to seed it back more than once, that would be ok too :)\n-------------------------------------------------------------------","torrent":{"xt":"urn:btih:3f08d60eace1b1e9e0e197625aba6d7070fb5ed6","amp;dn":"Band+Of+Brothers+-+%282001%29+DVDRip+Eng+Xvid+AC3+AVI+%5BBigjazz%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f08d60eace1b1e9e0e197625aba6d7070fb5ed6","infoHashBuffer":{"type":"Buffer","data":[63,8,214,14,172,225,177,233,224,225,151,98,90,186,109,112,112,251,94,214]},"announce":[],"urlList":[]}}