{"title":"Elvis Presley Unedited Masters Hollywood To Nashville 1972-1980","uid":8814360,"size":433866164,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3f3a596dee7a136f2a8e8daf4e1cbc0b5982920a&amp;dn=Elvis+Presley+Unedited+Masters+Hollywood+To+Nashville+1972-1980&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mileyc.rox","files":34,"time":1376542798,"description":"\n\nThis new Venus CD release, Unedited Masters : Hollywood To Nashville 1972-1980, offers several very satisfying recordings in terrific quality, with the highlights mostly deriving from Presley's last great studio session, March 27-29, 1972 at RCA Hollywood. The best cut leads it off, takes 5 (false start) and 6 (master) of 'Burning Love'. It's really cool to hear how Elvis remains engaged all the way to the outro, well after the official fade, and Felton Jarvis cutting in with his standard exclamation of how the performance is 'a gas'. This was the last #1 of Elvis' career, and remains a classic to this day. Wish there could have been more.\n\nOther semi- or completely undubbed/unedited numbers from March 1972 that are worthy include 'For The Good Times', 'Separate Ways' and 'Always On My Mind'. Elvis always delivered on a quality song that he believed in, and these are perfect, intimate examples.\n\nTwo more Graceland tracks that sound good are 'Pledging My Love' and 'Way Down', which made up the last single released in his lifetime. His voice is deep, and sounds 'thick', but he still delivers, and I can still remember hearing 'Way Down' blasting out of someone's radio, tuned to a country radio station, in July of 1977. The vocals are dry on these cuts, and it is very cute someone (at Venus?) pushed the legendary barking dog caught on tape at the end of 'Way Down' way up in the mix. Woof-woof-woof!\n\nA surprise (as everyone now knows) is hearing the posthumous, 1980 remake of 'For Ol' Times Sake'. It's a great song, and it's a beautiful piece of work. It's surprising Felton left it off of 1981's 'Guitar Man'. ['For Ol' Times Sake' features feature Tony Joe White on harmonica and harmony vocals.] The 1980 re-do of 'Bitter They Are, Harder They Fall' is also very noteworthy, as Elvis' vocal is to the fore, and far superior to what I remember. It may be one of his best vocal performances from the Graceland sessions, with no flatted or missed notes, a command of the material, and a deep feeling that were all buried in the LP track mix released in 1976.\n\nI have not been able to keep this out of the CD player. There are so many things about it that I like. FTD definitely needs to release uncensored material like 'Fool' and 'Hey Jude'. I loved hearing 'Hey Jude', something about it made it sound like I was hearing it brand new for the first time.\n\nAnd I have never heard 'Bitter They Are, Harder They Fall' like this before.\n\nI love hearing Elvis up front like this. So many 70's masters need to be stripped of overdubs and background singers and bring Elvis fantastic vocals up front! We definitely need an uncensored two CD set from someone to wrap up the overdubs from the 80's (There are quite a bit more left in the vaults).\n\nOverall, this one should find a place in your collection. No one else is doing it like the Venus label these days.\nUnedited Masters : Hollywood To Nashville 1972-1980\n\nThe fourth volume in the 'Unedited Masters' series sub-titled 'Hollywood To Nashville 1972-1980' is out now. According to the flyer this is the best of that series with several 'firsts' such as the overdubbed version of 'It's A Matter Of Time' taken directly from studio tape instead of a scratchy acetate, an X-rated ending of 'the first take' of 'Fool', first release of the re-recording of 'For Ol' Times Sake' from the 1980 Felton Jarvis held sessions that produced the 'Guitar Man' album, which is one of their best re-recording but still unreleased to this day. ","torrent":{"xt":"urn:btih:3f3a596dee7a136f2a8e8daf4e1cbc0b5982920a","amp;dn":"Elvis+Presley+Unedited+Masters+Hollywood+To+Nashville+1972-1980","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f3a596dee7a136f2a8e8daf4e1cbc0b5982920a","infoHashBuffer":{"type":"Buffer","data":[63,58,89,109,238,122,19,111,42,142,141,175,78,28,188,11,89,130,146,10]},"announce":[],"urlList":[]}}