{"title":"James Bowen - BOB de straatkat (E-Book)NLtoppers","uid":8048153,"size":851956,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3fdf95dc012e9736324546f3ffc7de4bd57781c9&amp;dn=James+Bowen+-+BOB+de+straatkat+%28E-Book%29NLtoppers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ChickieChicken","files":-1,"time":1358799177,"description":"\n\nAlle productspecificaties\n\nJames, een straatmuzikant in Londen, vindt een gewonde kat. Hoewel James nauwelijks voor zichzelf kan zorgen, neemt hij hem mee naar de dierenarts en verzorgt hem tot hij weer op eigen poten kan staaan. Maar Bob besluit te blijven en de twee worden onafscheidelijk. Samen verdienen ze hun kostje op straat en worden al gauw beroemd. Zo kunnen ze allebei hun moeilijke verleden achter zich laten.\nRecensie(s)\n\nEen autobiografisch boek van een ex-verslaafde Londenaar die zijn leven weer op de rails krijgt doordat een zwerfkat hem uitkiest als 'baas'. James werkt als straatmuzikant. Hij bewoont een kleine flat in Tottenham in het kader van een begeleid-wonen-project. In het trappenhuis ervan vindt hij in het begin van 2007 een gewonde rode kater. Hij verzorgt hem en noemt hem Bob. De kater blijft bij hem. In dit boek vertelt James op een heldere manier over de lotgevallen van Bob en hemzelf. De kat volgt hem overal, ook naar zijn werkplek op straat. Door de aanwezigheid van Bob krijgt James meer aandacht en worden zijn dagopbrengsten groter. Dat blijft ook zo wanneer James overstapt op de verkoop van 'Big Issue', de Londense variant van onze Straatkrant. Als enkele Spaanse kinderen Bob herkennen van YouTube begrijpt James dat zijn kat en hij ook ver buiten Londen bekend zijn geworden. Een boek waarin we een idee krijgen over de invloed die een huisdier op een mens kan hebben, maar waarin we ook een indruk krijgen van het leven op straat en van de inspanning die het afkicken kost. Een goed geschreven boek over liefde van kat en mens in een herkenbaar decor. Feelgood boek voor een groot publiek.\n\nBy Chickie!","torrent":{"xt":"urn:btih:3fdf95dc012e9736324546f3ffc7de4bd57781c9","amp;dn":"James+Bowen+-+BOB+de+straatkat+%28E-Book%29NLtoppers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fdf95dc012e9736324546f3ffc7de4bd57781c9","infoHashBuffer":{"type":"Buffer","data":[63,223,149,220,1,46,151,54,50,69,70,243,255,199,222,75,213,119,129,201]},"announce":[],"urlList":[]}}