{"title":"Say You Will (Summerhill #1) (2013) Kate Perry","uid":9329941,"size":1242068,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:403da22d2750f7b101a769c9b13aebe45c09d250&amp;dn=Say+You+Will+%28Summerhill+%231%29+%282013%29+Kate+Perry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":3,"time":1386708760,"description":"Say You Will (Summerhill #1) by Kate Perry\n\n\nFormat: mobi/epub/azw3\nLength: 200 pages\nGenre: Contemporary Romance\nDate: 4 December 2013\n\nOver 3 million readers have fallen in love with the women of Kate Perry's bestselling Laurel Heights series. Now meet her Summerhill sisters...\n\nRosalind Summerhill is on the verge of becoming the next Vera Wang, as far away from her family and their drama as she can get. The last thing she wants is to leave San Francisco for London, especially not to deal with her father's latest scandal - dying in his mistress's arms. At least she can find comfort in knowing she can leave after the memorial.\n\nLittle did she know.\n\nNot only is her father's will missing but, according to his lawyer, her mother will lose everything if it's discovered. Reluctantly joining forces with her sisters to seek and destroy the will is the only way of ensuring her father doesn't win in the end.\n\nEnter Nick Long, the one bright spot about being in London. Nick's everything she's ever dreamed of in a man - supportive, eager to help, and bone-meltingly hot. But Nick's motives aren't as pure as they seem, and the secret he's keeping may tear Rosalind's family and fortune apart.\n\nAuthor:\n\nKate's the bestselling author of the Laurel Heights Novels, as well as the Family and Love and Guardians of Destiny series. She's been translated into several languages and is quite proud to say she's big in Slovenia. All her books are about strong, independent women who just want love.","torrent":{"xt":"urn:btih:403da22d2750f7b101a769c9b13aebe45c09d250","amp;dn":"Say+You+Will+%28Summerhill+%231%29+%282013%29+Kate+Perry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"403da22d2750f7b101a769c9b13aebe45c09d250","infoHashBuffer":{"type":"Buffer","data":[64,61,162,45,39,80,247,177,1,167,105,201,177,58,235,228,92,9,210,80]},"announce":[],"urlList":[]}}