{"title":"A Swamp Full of Dollars: Pipelines and Paramilitaries at Nigeria","uid":6976280,"size":1943465,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:415034e84ca12c9b078111203184504a9d8b60cf&amp;dn=A+Swamp+Full+of+Dollars%3A+Pipelines+and+Paramilitaries+at+Nigeria&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Djofullinn","files":1,"time":1327266208,"description":"The largest U.S. trading partner in sub-Saharan Africa, petroleum-rich Nigeria exports half its daily oil production to the United States. Like many African nations with natural resources coveted by the world's superpowers, the country has been shaped by foreign investment and intervention, conflicts among hundreds of ethnic and religious groups, and greed. Polio has boomed along with petroleum, small villages face off with giant oil companies, and scooter drivers run their own ministates. The oil-rich Niger Delta region at the heart of it all is a trouble spot as hot as the local pepper soup.\n\nBlending vivid reportage, history, and investigative journalism, in A Swamp Full of Dollars journalist Michael Peel tells the story of this extraordinary country, which grows ever more wild and lawless by the day as its refined petroleum pumps through our cities. Through a host of colorful characters--from the Area Boy gangsters of Lagos to a corrupt state governor who stashed money in his London penthouse, from the militants in their swamp forest hideouts to oil company executives--Peel makes the connection between Western energy consumption and the breakdown of the Nigerian state, where the corruption of the haves is matched only by the determination and ingenuity of the have-nots. What has happened to Nigeria is a stark warning to the United States and other economic powers as they grow increasingly frantic in their search for new oil sources: unbridled plunder eventually rebounds on those who have done the taking.\n\nA Swamp Full of Dollars--shortlisted for the Guardian First Book Award--shows that if the Arab world is the precarious eastern battle line in an intensifying world war for crude, then Nigeria has become the tumultuous western front.\n &lt;a href=&quot;\nhttp://www.amazon.com/Swamp-Full-Dollars-Pipelines-Paramilitaries/dp/1569762864/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1327263578&amp;sr=1-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Swamp-Full-Dollars-Pipelines-Paramilitaries/dp/1569762864/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1327263578&amp;sr=1-1&lt;/a&gt;","torrent":{"xt":"urn:btih:415034e84ca12c9b078111203184504a9d8b60cf","amp;dn":"A+Swamp+Full+of+Dollars%3A+Pipelines+and+Paramilitaries+at+Nigeria","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"415034e84ca12c9b078111203184504a9d8b60cf","infoHashBuffer":{"type":"Buffer","data":[65,80,52,232,76,161,44,155,7,129,17,32,49,132,80,74,157,139,96,207]},"announce":[],"urlList":[]}}