{"title":"J.D. Robb - Eve Dallas 20 - Remember When-viny","uid":6426391,"size":1905795,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:417d5972d7d25fc37f15ea95ae2194a601637fba&amp;dn=J.D.+Robb+-+Eve+Dallas+20+-+Remember+When-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1306492220,"description":"J.D. Robb - Eve Dallas 20 - Remember When-viny\n\nIn Part One #1 New York Times bestselling author Nora Roberts introduces us to Laine Tavish, known to the folks in Angel's Gap, Maryland as the proprietor of Remember When, an antique treasures and gift shop. They have no idea that she used to be Elaine O'Hara, daughter of the notorious con man Big Jack O'Hara...or that she grew up moving from place to place, one step ahead of the law. But Laine's past has just caught up with her. Her long-lost uncle has visited her shop, leaving a cryptic warning before dying in the street, run down by a car. Soon afterward, Laine's home is ransacked. Now it's up to her, and an enigmatic stranger named Max Gannon, to find out who's chasing her, and why. The answer lies in a hidden fortune that will change Laine's life.\n\nIn Part Two, J.D. Robb takes us to New York City in 2059, and puts Detective Lieutenant Eve Dallas on the case. The treasure that Laine and Max sought has never been fully recovered. And now someone else is pursuing the missing gems...someone who's willing to kill for them. Sharp-witted and sexy, Eve is used to traveling in the shadowy corners outside the law, in a future where crime meets cutting edge technology. She will attempt to track down the diamonds once and for all - and stop the danger and death that has surrounded them for decades","torrent":{"xt":"urn:btih:417d5972d7d25fc37f15ea95ae2194a601637fba","amp;dn":"J.D.+Robb+-+Eve+Dallas+20+-+Remember+When-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"417d5972d7d25fc37f15ea95ae2194a601637fba","infoHashBuffer":{"type":"Buffer","data":[65,125,89,114,215,210,95,195,127,21,234,149,174,33,148,166,1,99,127,186]},"announce":[],"urlList":[]}}