{"title":"Without Copyrights - Robert Spoo","uid":15040275,"size":4070047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:42a1d2276411aaa93735fe8d8d6be71b09a977e6&amp;dn=Without+Copyrights+-+Robert+Spoo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MashTaters","files":1,"time":1466614060,"description":"Without Copyrights: Piracy, Publishing, and the Public Domain (Modernist Literature and Culture) - Robert Spoo\r\n\r\n\r\nThe names of James Joyce and Ezra Pound ring out in the annals of literary modernism--that of Samuel Roth, less so. A Jewish immigrant from Eastern Europe, Roth attended Columbia University and both wrote and published poetry. In the 1920s he founded literary and men's magazines. He published selections from foreign novels-including the risqu parts, and without permission. When he reprinted segments of Ulysses, James Joyce took him to court.\r\n\r\nTheir battle, writes Robert Spoo, influenced both American copyright law and modernism itself. Spoo, professor of law at the University of Tulsa and former editor of James Joyce Quarterly, tells the story in Without Copyrights. From its inception in 1790, he writes, American copyright law offered no or less-than-perfect protection for works published abroad--to the fury of Charles Dickens, among others, who often received no money from sales in the United States. American publishers avoided ruinous competition with each other through &quot;courtesy of the trade,&quot; a code of etiquette that gave informal, exclusive rights to the first house to announce plans to issue a foreign work. American piracy and copyright law deeply affected transatlantic modernist writers. Spoo draws on previously unknown legal archives to recount Joyce's lawsuit, his campaign to discredit Roth through an international protest, and efforts to free Ulysses from an obscenity ban that prevented a legitimate release by an American publisher. Ezra Pound plays a role in the story with his attempts to reform U.S. copyright law, as does Bennett Cerf, founder of Random House, who finally issued an authorized edition of Ulysses in 1934, reviving trade courtesy to protect it from pirates.\r\n\r\nMore than the tale of one book, Without Copyrights offers a new look at the history of the American public domain, a commons shaped by custom as much as by law, and of piracy's crucial role in literary history.\r\n\r\nPublished by Oxford University Press in 2013\r\n\r\nEnglish, 371 pages, retail epub.\r\n\r\nPlease seed and share with others. =)","torrent":{"xt":"urn:btih:42a1d2276411aaa93735fe8d8d6be71b09a977e6","amp;dn":"Without+Copyrights+-+Robert+Spoo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42a1d2276411aaa93735fe8d8d6be71b09a977e6","infoHashBuffer":{"type":"Buffer","data":[66,161,210,39,100,17,170,169,55,53,254,141,141,107,231,27,9,169,119,230]},"announce":[],"urlList":[]}}