{"title":"WazHack v1.2","uid":11266070,"size":43631147,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:42e8133baa87df9296fc3ab7d985512b1501e8c6&amp;dn=WazHack+v1.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lamasu","files":-1,"time":1414021806,"description":"&quot;Time moves forward only when you do in the dungeons of WazHack, so you can take your time to solve problems instead of just spamming 'attack' and 'drink healing potion'.\nWith over 300 unique items to be found, you will invent your own solutions to sticky situations. With over 150 different monsters, many with unusual attacks, you will find plenty of sticky situations!\nThe procedurally-generated dungeon and vast array of possible items gives immense replay value. Some games you'll find a good weapon early, other times you'll rely on wands or potions or spells.\nYou don't see it much in the all-action video above, but some of the most fun is had just standing still trying to work out how to get out of a sticky situation. Should you try that unknown potion? Maybe it's Healing? What about that wand? Maybe it's Magic Missile... or maybe it's a Wand of Create Monster, and it'll get even stickier!\nYou start with your choice from 16 character classes, each with different starting equipment, stats, and available talents. The game you play also depends very much on what interesting loot you find. Maybe you'll find a great spellbook and put all your efforts into turning your uneducated knight into a master battle mage!\nStill confused about this unusual game? You can try the demo at http://www.wazhack.com/play, or just watch one of the many Let's Play videos that WazHack players have put on YouTube (every game is different, so they won't spoil it for you).\nIf you have ever played NetHack or a similar roguelike, you will find plenty familiar about this game, but be prepared for a lot of surprises too.&quot;\n\nIf you like the game, support the developer, buy it! &lt;a href=&quot;\nhttp://store.steampowered.com/app/264160/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/264160/&lt;/a&gt;","torrent":{"xt":"urn:btih:42e8133baa87df9296fc3ab7d985512b1501e8c6","amp;dn":"WazHack+v1.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42e8133baa87df9296fc3ab7d985512b1501e8c6","infoHashBuffer":{"type":"Buffer","data":[66,232,19,59,170,135,223,146,150,252,58,183,217,133,81,43,21,1,232,198]},"announce":[],"urlList":[]}}