{"title":"Gauke  Andriesse - De Handen Van Kalman Teller, NL Ebook(ePub).D","uid":6651672,"size":437229,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4430261e840e4edf289ed06a458091a276b2937e&amp;dn=Gauke++Andriesse+-+De+Handen+Van+Kalman+Teller%2C+NL+Ebook%28ePub%29.D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Falco_bis","files":-1,"time":1315171885,"description":"Gauke  Andriesse - De Handen Van Kalman Teller, NL Ebook(ePub).DMT\n\n\n\nAuteur: Gauke  Andriesse\npagina's: 302\nUitgever: Amstel Uitgevers\njaar van uitgifte: 2010\nLiteraire thriller\n\n\n\nBeschrijving\n\nWinnaar Gouden Strop 2011\n \nAls de jonge Mira Roes in het ziekenhuis slachtoffer wordt van een verkeerd uitgevoerde medische ingreep, is dat voor haar en haar man Frederik het begin van een tien jaar durende lijdensweg langs tal van medische\nberoepsorganen en gerechtelijke instanties. Ondanks haar ernstige verminkingen vallen de rechterlijke uitspraken keer op keer in haar nadeel uit en lijkt het er steeds meer op dat de schuldige de hand boven het hoofd wordt gehouden.\n \nAls haar zaak hopeloos is vastgelopen, besluit haar protege, de vermogende Joodse zakenman Kalman Teller, de hulp in te roepen van de Amsterdamse privedetective Jager Havix. Wanneer Havix een belangrijke getuige\nweet op te sporen, wordt deze echter op beestachtige wijze vermoord. Hiermee loopt het spoor dood. Maar Kalman Teller laat Havix niet meer met rust.\n \nWaarom is hij zo vasthoudend en wat is er waar van de geruchten dat deze overlevende van de Holocaust zo'n teruggetrokken bestaan leidt, omdat hij iets heeft te verbergen? Er doet een verhaal de ronde over Kalman Teller.\nU moet weten dat hij een heel laag nummer heeft en toch Auschwitz heeft overleefd. Mensen praten daarover, al is het maar uit nieuwsgierigheid. Een laag nummer? Iedereen die in Auschwitz kwam, werd geregistreerd en\nkreeg een nummer op de linkeronderarm getatoeeerd. Het feit dat Kalman Teller een laag nummer heeft betekent dat hij daar als een van de eersten is binnengekomen. Mensen hielden het meestal niet lang vol en toch heeft hij de bevrijding gehaald.\n\n\n\nDit boek wordt u aangeboden door:\n\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:4430261e840e4edf289ed06a458091a276b2937e","amp;dn":"Gauke++Andriesse+-+De+Handen+Van+Kalman+Teller%2C+NL+Ebook%28ePub%29.D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4430261e840e4edf289ed06a458091a276b2937e","infoHashBuffer":{"type":"Buffer","data":[68,48,38,30,132,14,78,223,40,158,208,106,69,128,145,162,118,178,147,126]},"announce":[],"urlList":[]}}