{"title":"Skyrim Winter Wonderland Overhaul - Mod Compilation - ADULT","uid":10028823,"size":10481254897,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4572799ca02667b9e1c05da464967ddabbf47d61&amp;dn=Skyrim+Winter+Wonderland+Overhaul+-+Mod+Compilation+-+ADULT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheDragonReborn26","files":1,"time":1398304429,"description":"Skyrim Winter Wonderland is a compilation of nearly 100 mods to change Skyrim to something harsher, more hardcore, intense survival, avoiding freezing to death...starving and dying of thirst.\n\nSkyrim was already cold, but now it has been changed to a complete desolate, cold wasteland. Intense graphics, amazing effects of snow blowing throughout Skyrim, frozen lakes...see for yourself in this screenshot album showing the mod.\n &lt;a href=&quot;\nhttps://imgur.com/a/eaO3q#0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://imgur.com/a/eaO3q#0&lt;/a&gt;\n\nNot only does it add graphics. Three new lands are added, one is Elsweyr...maybe you'll enjoy the hot weather from the cold harsh wasteland of Skyrim. Two other new lands are added, but you'll have to see for yourself of what they are. :)\n\nIt also adds over 2000 fully voiced NPCs, many with their own quest lines (that are voice acted).\n\nMany new quests are added (separate from the new NPCs) and many new dungeons.\n\nAn improved, dynamic economy. For example, a village in the corner of the land with no mine nearby...the ore there will be VERY expensive to buy, if available at all...you can sale the ore for a massive amount of coin. If you overload that village with ore, prices there will greatly drop. A trade route, you could say. :)\n\nYou can also build a fort, own a mill and hire workers, own housing/inns/shops and others to get income from them (and use the mill to supply shops). You can even create your own guild! On top of this, you can build the house from hearthfire...or an improved custom house that you can turn into a stone tower, wood tower, small castle, cabin, ship or many other things! This is of course VERY expensive.\n\nThis also includes new monsters and many more animals. There is a lot of horrifying monsters to be found in the wilderness and many dungeons. I won't go into detail, but many of these monsters you won't want to find in the dark!\n\nAnd on top of this, 10 new races are added. Including a giant, dremora and two vampire races.\n\nEnjoy the amazing mod. And remember, you can see some of what it is like here in the album.\n &lt;a href=&quot;\nhttps://imgur.com/a/eaO3q#0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://imgur.com/a/eaO3q#0&lt;/a&gt;","torrent":{"xt":"urn:btih:4572799ca02667b9e1c05da464967ddabbf47d61","amp;dn":"Skyrim+Winter+Wonderland+Overhaul+-+Mod+Compilation+-+ADULT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4572799ca02667b9e1c05da464967ddabbf47d61","infoHashBuffer":{"type":"Buffer","data":[69,114,121,156,160,38,103,185,225,192,93,164,100,150,125,218,187,244,125,97]},"announce":[],"urlList":[]}}