{"title":"Black Code: Inside the Battle... (2013) Ronald J Deibert (multi)","uid":9497881,"size":3441491,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:458be3959a2fdf74ae94229c1c00cbd06593a44d&amp;dn=Black+Code%3A+Inside+the+Battle...+%282013%29+Ronald+J+Deibert+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1390155896,"description":"Black Code: Inside the Battle for Cyberspace (2013) Ronald J Deibert (multi)\n\nFormat: mobi/epub/azw3\nLength: 320 pages\nGenre: Non-Fiction/Computers &amp; Technology\nDate: 14 May 2013\n\nBlack Code is terrifying. It effortlessly chronicles threats ranging from individual privacy to national security, highlighting the shadowy, lucrative war online, both behind closed doors and in the halls of power, which threaten to control, censor, and spy on all of us...or worse.\n\nAs cyberspace develops in unprecedented ways, powerful agents are scrambling for control. Predatory cyber criminal gangs such as Koobface have made social media their stalking ground. The discovery of Stuxnet, a computer worm reportedly developed by Israel and the United States and aimed at Iran's nuclear facilities, showed that state cyberwar is now a very real possibility. Governments and corporations are in collusion and are setting the rules of the road behind closed doors.\n\nDrawing on the first-hand experiences of one of the most important protagonists in the battle - the Citizen Lab and its global network of frontline researchers, who have spent more than a decade cracking cyber espionage rings and uncovering attacks on citizens and NGOs worldwide - Black Code takes readers on a fascinating journey into the battle for cyberspace. Thought-provoking and compelling, it is a wakeup call to citizens who have come to take the Internet for granted.\n\nAuthor:\n\nRONALD J. DEIBERT is professor of Political Science and Director of the Canada Centre for Global Security Studies and the Citizen Lab at the Munk School of Global Affairs, University of Toronto, an interdisciplinary research and development 'hothouse' working at the intersection of the Internet, global security, and human rights. He is a co-founder and a principal investigator of the OpenNet Initiative and the Information Warfare Monitor, which uncovered the GhostNet cyberespionage network of over 2,500 infected computers in 103 countries.\n","torrent":{"xt":"urn:btih:458be3959a2fdf74ae94229c1c00cbd06593a44d","amp;dn":"Black+Code%3A+Inside+the+Battle...+%282013%29+Ronald+J+Deibert+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"458be3959a2fdf74ae94229c1c00cbd06593a44d","infoHashBuffer":{"type":"Buffer","data":[69,139,227,149,154,47,223,116,174,148,34,156,28,0,203,208,101,147,164,77]},"announce":[],"urlList":[]}}