{"title":"Neither The Government Nor The Population","uid":9191964,"size":15002017,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:466004d1056779b2a3582cad4f78536dd8c97184&amp;dn=Neither+The+Government+Nor+The+Population&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"srl667","files":6,"time":1384403420,"description":"Neither The Government Nor The Population was a project started in 1995 after the April 19th OKC bombing of the Murrah Federal Building. In part it was a response. The first 4 drafts were hand written, the 5th was a proof, and the 6th was &quot;clandestinely&quot; published and distributed over several printings. Copies were distributed for free in the Seattle area, and a few were mailed around the U.S. Several years ago, the 6th Draft was republished on this site. Although blog posts work fine for parts, I have not always been pleased with the presentation for the whole. Therefore, I will present the 7th Draft as a downloadable PDF. Now, the reader can like it or hate it based on the whole. The 6th Draft was hated by all the right kinds of people*; hopefully the 7th Draft will be more despised.\n\nA few notes about this draft are in order. The 6th Draft was comprised of six chapters, and then ends with a few appendices (at least the first printing did). The few readers who spoke with me about it kept asking, &quot;Then what?&quot; What indeed. Several years later, before the birth of my first daughter in 2003, I began revising the first six chapters and added a seventh. Since philosophy is largely a reflection of a stage of life, it was important to complete it before family life set in. The seventh chapter, which I probably wouldn't write in the same way now, concerns revolution. I chose Spanish revolutionary syndicalism as the model as there is really very little likelihood that such will occur in the US, with the exception of the desert Southwest. (Anyone thinking otherwise does not understand this nation very well, but that's another discussion for later.) It's not like I ever wanted to advocate anything. The whole is different than the sum of its parts. In this case, the whole is propaganda, its parts philosophy, and bound together by my artistic sensibilities. Anyway, I sat on it until 2005, when I finalized it, then tucked it away until now. &quot;Enjoy.&quot;\n\n* I am aware of one instance were excuses were made to revoke parole over its possession.","torrent":{"xt":"urn:btih:466004d1056779b2a3582cad4f78536dd8c97184","amp;dn":"Neither+The+Government+Nor+The+Population","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"466004d1056779b2a3582cad4f78536dd8c97184","infoHashBuffer":{"type":"Buffer","data":[70,96,4,209,5,103,121,178,163,88,44,173,79,120,83,109,216,201,113,132]},"announce":[],"urlList":[]}}