{"title":"Nuclear Energy for Hydrogen Generation through Intermediate Heat","uid":15331604,"size":25020243,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:475323798c3d36012436d8f6d74664234b70ca83&amp;dn=Nuclear+Energy+for+Hydrogen+Generation+through+Intermediate+Heat&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1468735646,"description":"Nuclear Energy for Hydrogen Generation through Intermediate Heat Exchangers - Bahman Zohuri (Springer, 2016).pdf\r\n\r\nISBN 978-3-319-29837-5\r\n\r\n· Explains how to use nuclear process heat for industrial applications, especially process heat for hydrogen production\r\n\r\n· Illuminates the issue of waste heat in nuclear plants, offering a vision for how it can be used in combined-cycle plants\r\n\r\n· Undertakes the thermal analysis of intermediate heat exchangers throughout the life cycle, from the design perspective through operational and safety assurance stages\r\n\r\nThis book describes recent technological developments in next generation nuclear reactors that have created renewed interest in nuclear process heat for industrial applications. The author’s discussion mirrors the industry’s emerging focus on combined cycle Next Generation Nuclear Plants’ (NGNP) seemingly natural fit in producing electricity and process heat for hydrogen production. To utilize this process heat, engineers must uncover a thermal device that can transfer the thermal energy from the NGNP to the hydrogen plant in the most performance efficient and cost effective way possible. This book is written around that vital quest, and the author describes the usefulness of the Intermediate Heat Exchanger (IHX) as a possible solution. The option to transfer heat and thermal energy via a single-phase forced convection loop where fluid is mechanically pumped between the heat exchangers at the nuclear and hydrogen plants is presented, and challenges associated with this tactic are discussed. As a second option, heat pipes and thermosyphons, with their ability to transport very large quantities of heat over relatively long distance with small temperature losses, are also examined","torrent":{"xt":"urn:btih:475323798c3d36012436d8f6d74664234b70ca83","amp;dn":"Nuclear+Energy+for+Hydrogen+Generation+through+Intermediate+Heat","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"475323798c3d36012436d8f6d74664234b70ca83","infoHashBuffer":{"type":"Buffer","data":[71,83,35,121,140,61,54,1,36,54,216,246,215,70,100,35,75,112,202,131]},"announce":[],"urlList":[]}}