{"title":"Joe Cocker - Have a Little Faith [1994][MP3]-trother","uid":6746393,"size":55029688,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:479e6db04e3f82e414a6d273eb73808dd43f2fb0&amp;dn=Joe+Cocker+-+Have+a+Little+Faith+%5B1994%5D%5BMP3%5D-trother&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"trother","files":-1,"time":1318707030,"description":"            @@                       @@     @@\n           @@@                      @@@    @@@\n          @@@@@@  @@@@@    @@@@@   @@@@@@ @@@        @@@@@    @@@@@\n          @@@@@  @@@@@@@  @@@ @@@  @@@@@  @@@       @@@ @@@  @@@@@@@\n           @@@   @@@  !@ @@@   @@@  @@@   @@@@@@   @@@   @@@ @@@  !@\n           @@@   @@@     @@@   @@@  @@@   @@@@@@@  @@@   @@@ @@@\n           @!@   @!@     @!@   @!@  @!@   @!@  @!@ @!@@ @!@  @!@\n           !!@   !!@     !!@   !!@  !!@   !!@  !!@ !!@@      !!@\n            :!:   :!:     :!: :!:    :!:  :!:  :!:  :!:! :!   :!:\n             ::    ::      ::::       ::   ::  :::   ::::      ::\n                                               :::\n                  ~ Joe Cocker - Have A Little Faith [1994] ~   \n                                           :::\n                                          :::\n\n\n                  1.  [5:12] Let the healing begin\n\n                  2.  [4:40] Have a Little Faith in Me\n\n                  3.  [4:54] The Simple Things\n\n                  4.  [4:10] Summer in the City\n\n                  5.  [3:33] The Great Divide\n\n                  6.  [4:31] Highway Highway\n\n                  7.  [4:45] Too Cool\n\n                  8.  [4:35] Soul Time\n\n                  9.  [3:45] Out of the Blue\n\n                  10. [4:30] Angeline\n\n                  11. [4:12] Hell or High Water\n                  \n                  12. [4:09] Standing Knee Deep in a River\n\n                  13. [4:21] Take Me Home\n\n\n\nThe best album of JC's fantastic career!, August 21, 2002.\nBy Tim Huguet (AMSTERDAM Holland)\n\n\nThe year is 1994. A great year for Joe. He sings with more passion, intensity and feeling on this album than any other. With all the great stuff he has made, this album is simply in a class of it's own. I had the opportunity to see him live in the fall of that year, and it was one of the best nights of my life. Joe was completely overcome with emotion by the end of the night he could only breath &quot;God bless you&quot; into the mike as the place (Brabanthalle, Den Bosch, Holland) went absolutely crazy. It was moving beyond belief. When Joe did his traditional jump at the end of With a little help..., the whole building shook as he landed on the stage again.\nBut back to the album...I have kept coming back to this album since it's release. I loved it then and I love it now. Even more. Definitely Top 5 deserted-island material. Here's a song-by-song review:\n\n\n1)Let the healing begin- let the magic start. &quot;I've kept it inside much too long&quot;. You get the feeling JC is making the album he wanted to make his whole career, and he is serious about it too. The stage is set for what is too follow.\n\n2)Have a Little Faith in Me- THE definitive version of this song. Unfortunately, not the one we get to hear on the radio time and time again.\n\n3)The Simple Things- &quot;Happiness, joy and love in my life&quot; ...so very simple indeed. A code to live by. The first verse is so powerful. Twisting and turning... wanting more...caught up in the race...about losing one's soul due to all these unimportant things. Until one find's that the best things in life are the simple things.\n\n4)Summer in the City- Don't matter where you are. New York, Melbourne, Amsterdam, Vancouver, Honolulu, Frankfurt...there ain't nothing like summer nights in the city. A feel-good song. Pure joy and adrenaline. Joe's scream WAAAAAAAAAAAAAAAAAAHHH at the end says it all. Again, the definitive version.\n\n5)The Great Divide- Joe growls his way through another masterpiece. Great keyboard work from longtime bud/collaborator Chris Stainton.\n\n6)Highway Highway - So powerful. Joe is almost crying in this one. It sounds personal...&quot;Give me wings to fly.....&quot;\n\n7)Too Cool- I remember distinctly Joe singing this one live. It got a great reaction, especially after the solo when he came back just in time to sing &quot;I'm all right...I'll soon be better&quot;\nGives me spine-tingles just thinking of it.\n\n8)Soul Time- Song about keeping the fires burning in a long term\nrelationship. Again the albums' theme comes through loud &amp; clear: &quot;Let's love life and live it, stop fighting and crying....reaching and trying this time.&quot;\n\n9)Out of the Blue- Again, I know it sounds repetitive, but this songs takes one to places the original couldn't come close to doing. (much as I love The Band/R.Robertson)\n\n10)Angeline- What would a Joe album be like without a true rocker. Great guitar here.\n\n11)Hell or High Water - Another classic, in true Cocker-rocker fashion. Humour as well: me and an ex-colleague used to laugh about the &quot;sometimes I don't feel right&quot; scream.\n\n12)Standing Knee Deep in a River- The calm after the storm. Now it gets right down to the heart of the matter. Friends and sweethearts that have come and gone. The ways he sings &quot;now where they are I wish I knew...&quot; is tear-jerking, and makes me shudder with realization. I guess we never learn....\n\n13)Take Me Home- The Grand Finale. And what a way to go. One of the most moving and rousing singalongs I can remember. &quot;There's a bridge over the water. I can see it like a rainbow. If you love me, I'll be waiting. Take me home to the Other Side&quot;. JC completes the mission be indeed taking you to the other side.\nThis unbelievable piece of work will never be forgotten. It will be with me till my last day, as guide and companion.\n\nThank you Joe. ","torrent":{"xt":"urn:btih:479e6db04e3f82e414a6d273eb73808dd43f2fb0","amp;dn":"Joe+Cocker+-+Have+a+Little+Faith+%5B1994%5D%5BMP3%5D-trother","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"479e6db04e3f82e414a6d273eb73808dd43f2fb0","infoHashBuffer":{"type":"Buffer","data":[71,158,109,176,78,63,130,228,20,166,210,115,235,115,128,141,212,63,47,176]},"announce":[],"urlList":[]}}