{"title":"Brush with Haiti-Kathleen A. Tobin (epub, mobi, pdf)","uid":10632212,"size":1857407,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47b4731d477b9fc273c402fe6e2469bae58707b2&amp;dn=Brush+with+Haiti-Kathleen+A.+Tobin+%28epub%2C+mobi%2C+pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":5,"time":1406339772,"description":"Haiti and the United States are two vastly different places and this fact compelled Kathleen Tobin to write Brush with Haiti, the marvelously true story of the beautiful, impoverished-yet-hopeful country of Haiti and a woman with her heart in more than one world. On January 12, 2010, Tobin landed at O Hare after completing research in Port-au-Prince. She was told about the earthquake that had struck Haiti mere miles from where she had been an incredibly lucky survivor, she had missed the earthquake by a hair. In addition to Tobin s own experiences, Brush with Haiti details Haiti s rich history, complex politics, fascinating religions, and multihued culture. Brush with Haiti is a tribute to pre-and-post-earthquake Haiti, and is the personal journey of an academic intertwined with two immensely different worlds. Brush with Haiti is an introduction to the fascinating country of Haiti. Its compelling prose offers an academic s perspective on both Haiti and the American world of academia. Brush with Haiti combines personal anecdotes with history and modern affairs to make for a truly captivating read about a country that knows how to persevere. Kathleen A. Tobin received her PhD in history from the University of Chicago and has taught history and related subjects in various universities for over 20 years. Her two previous books are both on the subjects of birth control and population policy.\n &lt;a href=&quot;\nhttp://www.goodreads.com/book/show/16293319-brush-with-haiti?from_search=true&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.goodreads.com/book/show/16293319-brush-with-haiti?from_search=true&lt;/a&gt;","torrent":{"xt":"urn:btih:47b4731d477b9fc273c402fe6e2469bae58707b2","amp;dn":"Brush+with+Haiti-Kathleen+A.+Tobin+%28epub%2C+mobi%2C+pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47b4731d477b9fc273c402fe6e2469bae58707b2","infoHashBuffer":{"type":"Buffer","data":[71,180,115,29,71,123,159,194,115,196,2,254,110,36,105,186,229,135,7,178]},"announce":[],"urlList":[]}}