{"title":"The Crown Prince - Son of Sisi","uid":4658199,"size":1387812322,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:48cd543f240d086a1fffa861d8c5543589c7e955&amp;dn=The+Crown+Prince+-+Son+of+Sisi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Rfan","files":2,"time":1232284711,"description":"The Epic Miniseries &quot;The Crown Prince - Son of Sissi&quot; tells the tragic story of Archduke Rudolf of Austria-Hungary, Heir to the Imperial and Royal thrones. Married unhappily, a troubled relationship with his parents, Emperor Franz-Joseph and Empress Elisabeth &quot;Sisi&quot;, the fact that he, like his mother, was someone who wanted changes for the country, led all to his downfall. He found love with Mary Vetsera and wants a divorce, in the meantime a coup is planned to crown Rudolf to King of Hungary, he and Mary make a pact that their love will live on beyond death. The tragedy reaches its climax at the hunting-lodge Mayerling.\n\nThis is one of the Historical correct, using several facts that led to the downfall of Rudolf and the Empire, depictions on the downfall of the House of Habsburg. Yet some scenes are not historical correct for the sake of the dramatic sense of the series, and do some actors not look like the actual people(like Mary, who was not blonde, or Rudolf, who also was not blonde), but the music, beautiful shots, acting and story make good for all that.\n\nduration: 180 minutes\n\nEnjoy\n\nPlease seed.","torrent":{"xt":"urn:btih:48cd543f240d086a1fffa861d8c5543589c7e955","amp;dn":"The+Crown+Prince+-+Son+of+Sisi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48cd543f240d086a1fffa861d8c5543589c7e955","infoHashBuffer":{"type":"Buffer","data":[72,205,84,63,36,13,8,106,31,255,168,97,216,197,84,53,137,199,233,85]},"announce":[],"urlList":[]}}