{"title":"Return to Dark Castle","uid":7366172,"size":59802243,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:48eb7a4b9d7ebbe3af88b09941380d7a026caccd&amp;dn=Return+to+Dark+Castle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WinterGale","files":1,"time":1340115740,"description":"The awesome update to THE true Mac classic game! Return to Dark Castle Includes all 30 original Dark Castle and Beyond Dark Castle levels plus 50 new, action packed levels.\n\nDark Castle maintained a ranking in the top 5 best sellers on the Mac for 36 straight months after its original introduction.\n\nReintroduced by its original creator Mark Stephen Pierce and Super Happy Fun Fun, Inc. &quot;Z-Sculpt has been lovingly crafting this version for over a decade and it has my full endorsement&quot; (MSP)\n\nRediscover the fun and challenge of this true classic with gameplay that is still as rich, unique and addictive today as it was in the days of the original Mac 128K.\n\nFEATURES\n- Over 50 brand-new levels\n- All 30 classic, re-mastered levels from Dark Castle and Beyond Dark Castle integrated into a new, extensive quest\n- New Secret Rooms and Mini-games\n- 25 orbs to collect\n- All of the classic foes plus new monsters and bosses\n- New weapons, power ups, and secret items\n- Random labyrinths and mazes provide unique puzzles with each play\n- Game recording and playback\n- Customizable costumes\n- Support for most gamepads and joysticks\n\nIn a time of magic and mythical beasts, the ominous Dark Castle glows eerily under the full moon.\n\nFor centuries, the evil Black Knight has dwelled within these walls, spreading fear over the once peaceful countryside.\n\nAll seemed hopeless until one day, a traveler from a faraway land wandered into the peasant village.\n\nHe called himself Prince Duncan, and told the townspeople he had come on a quest to vanquish the Black Knight.\n\nOverjoyed that peace might finally be restored to their land, they cheered as Duncan set off toward the castle.\n\nBut alas, their hero never returned from his valiant quest.\n\nTales of his bravery were all that were spoken of Dark Castle for many years.... Until now.\n\nA new hero has arrived, ready to face the perils of the castle and destroy the cruel Black Knight once and for all.","torrent":{"xt":"urn:btih:48eb7a4b9d7ebbe3af88b09941380d7a026caccd","amp;dn":"Return+to+Dark+Castle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48eb7a4b9d7ebbe3af88b09941380d7a026caccd","infoHashBuffer":{"type":"Buffer","data":[72,235,122,75,157,126,187,227,175,136,176,153,65,56,13,122,2,108,172,205]},"announce":[],"urlList":[]}}