{"title":"The Quantum Ten: A Story of Passion, Tragedy, Ambition, and Scie","uid":6506263,"size":1922597,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4919f042d13ce7a735686b6e457715838b06b9da&amp;dn=The+Quantum+Ten%3A+A+Story+of+Passion%2C+Tragedy%2C+Ambition%2C+and+Scie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309392935,"description":"Sheilla Jones, &quot;The Quantum Ten: A Story of Passion, Tragedy, Ambition, and Science&quot;\nPublisher: Oxford University Press | 2008 | ISBN: 0195369092 | PDF | 336 pages | 2.1 MB\n\nTheoretical physics is in trouble. At least that's the impression you'd get from reading a spate of recent books on the continued failure to resolve the 80-year-old problem of unifying the classical and quantum worlds. The seeds of this problem were sewn eighty years ago when a dramatic revolution in physics reached a climax at the 1927 Solvay conference in Brussels. It's the story of a rush to formalize quantum physics, the work of just a handful of men fired by ambition, philosophical conflicts and personal agendas.\nSheilla Jones paints an intimate portrait of the key figures who wrestled with the mysteries of the new science of the quantum, along with a powerful supporting cast of famous (and not so famous) colleagues. The Brussels conference was the first time so many of the &quot;quantum ten&quot; had been in the same place: Albert Einstein, the lone wolf; Niels Bohr, the obsessive but gentlemanly father figure; Max Born, the anxious hypochondriac; Werner Heisenberg, the intensely ambitious one; Wolfgang Pauli, the sharp-tongued critic with a dark side; Paul Dirac, the silent Englishman; Erwin SchrÃƒÂ¶dinger, the enthusiastic womanizer; Prince Louis de Broglie, the French aristocrat; and Paul Ehrenfest, who was witness to it all. Pascual Jordan, the ardent Aryan nationalist, came uninvited.\nThis is the story of quantum physics that has never been told, an equation-free investigation into the turbulent development of the new science and its very fallible creators, including little-known details of the personal relationship between the deeply troubled Ehrenfest and his dear friend Albert Einstein. Jones weaves together the personal and the scientific in a heartwarming--and heartbreaking--story of the men who struggled to create quantum physics: a story of passion, tragedy, ambition and science.","torrent":{"xt":"urn:btih:4919f042d13ce7a735686b6e457715838b06b9da","amp;dn":"The+Quantum+Ten%3A+A+Story+of+Passion%2C+Tragedy%2C+Ambition%2C+and+Scie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4919f042d13ce7a735686b6e457715838b06b9da","infoHashBuffer":{"type":"Buffer","data":[73,25,240,66,209,60,231,167,53,104,107,110,69,119,21,131,139,6,185,218]},"announce":[],"urlList":[]}}