{"title":"One Million AC/DC (1969) ~Written by Ed Wood!~","uid":6006038,"size":658453930,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4970ac6b2fce4dff885bf177c45a7f6c02642a72&amp;dn=One+Million+AC%2FDC+%281969%29+%7EWritten+by+Ed+Wood%21%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"brynrocks","files":5,"time":1291325824,"description":"One Million AC/DC\n1969\nWritten by Edward D. Wood, Jr.\n(Yes, THAT Ed Wood!)\n\nThis is a piece for Ed Wood curiosity seekers and completists only... There is barely any discernable plot, I can't even call what the people do in this movie &quot;acting&quot;, and the special effects are, well, retail store toys filmed up close. There is, however, a TON of nudity.\n\nI've used AVS Video Converter to directly convert the .VOB files to a single .AVI, using XviD compression and 320kb/s MP3 audio encoding. The source is Something Weird Video's digitally remastered DVD release. Quality-wise, this looks and sounds great. I've included images of the VHS cover, a poster for the film, and the theatrical trailer as well.\n\nI had always read that after the &quot;Plan 9&quot; debacle, Ed Wood had drifted into softcore territory, usually working under assumed names (here he is credited as &quot;Akdon Telmig, one letter removed from &quot;Vodka Gimlet&quot; in reverse). Released in 1969, this is one of those films. He served as the screenwriter only, not as the director, and it's missing his lunacy. Not to mention that, taking into account that it is a caveman feature, there's precious little of the atrocious dialogue which makes Ed Wood movies so fun. However, the special effects are truly classic grade-z awful, and a couple of the (almost constantly) naked girls are pretty cute. \n\nAs one of the above-listed Ed Wood curiosity seekers listed above, I had to purchase it. And I had to share.","torrent":{"xt":"urn:btih:4970ac6b2fce4dff885bf177c45a7f6c02642a72","amp;dn":"One+Million+AC%2FDC+%281969%29+%7EWritten+by+Ed+Wood%21%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4970ac6b2fce4dff885bf177c45a7f6c02642a72","infoHashBuffer":{"type":"Buffer","data":[73,112,172,107,47,206,77,255,136,91,241,119,196,90,127,108,2,100,42,114]},"announce":[],"urlList":[]}}