{"title":"Le cronache di Narnia.Il Principe Caspian.avi","uid":4356122,"size":692420608,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4a3082d1b69543c4027d3abe83e3eea03ffe3dd4&amp;dn=Le+cronache+di+Narnia.Il+Principe+Caspian.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1219421548,"description":"P\neter, Edmund, Susan e Lucy a un anno di distanza dagli avvenimenti che li videro divenire regnanti di Narnia frequentano la scuola nella Gran Bretagna impegnata nella Seconda Guerra Mondiale. Un giorno il richiamo del corno li proietta nuovamente nel mondo magico che ben conoscono o, meglio, che credono di conoscere. PerchÃƒÂ© un anno dei nostri equivale a milletrecento anni in quelle terre in cui, nel frattempo, tutti gli abitanti di Narnia sono stati uccisi o costretti a nascondersi a causa dell&amp;#039;invasione del popolo dei Telmarini. I quali in questo momento avrebbero un legittimo erede al trono, il principe Caspian, il quale ÃƒÂ¨ costretto alla fuga perchÃƒÂ© lo zio, Lord Miraz, vuole ucciderlo per conquistare il potere da cedere in futuro al suo primogenito appena nato. I quattro fratelli Pevensie, aiutati dai sopravvissuti discendenti degli abitanti di Narnia, si mettono in azione per contrastare Miraz e i suoi uomini. Ma non c&amp;#039;ÃƒÂ¨ piÃƒÂ¹ il leone Aslan al loro fianco o, perlomeno, non lo si vede.\nLa seconda parte della saga di Narnia vede ancora alla regia Andrew Adamson il quale deve essere un regista che, insieme alla produzione, legge la critica internazionale. Ha cosÃƒÂ¬ rivisto pregi e difetti del primo film e ha lavorato sulla pagina letteraria cercando di sfruttarne al massimo l&amp;#039;impatto cinematografico. Ecco allora due imponenti battaglie a marcare visivamente Il Principe Caspian con una difficoltÃƒÂ  in piÃƒÂ¹ rispetto, ad esempio, a Il Signore degli Anelli. PerchÃƒÂ© questo ÃƒÂ¨ un film dichiaratamente per famiglie e quindi il sangue (sia che sia degli umani che dei centauri) non puÃƒÂ² scorrere copioso e con immagini truculente. \nLa sceneggiatura libera poi la storia dalle pastoie teologiche che avevano fatto iscrivere d&amp;#039;ufficio Le cronache di Narnia al loro primo apparire nella schiera teocon quasi che questo ciclo si contrapponesse a quello che poi ha visto il suo primo episodio con La bussola d&amp;#039;oro. Certo Aslan rappresenta ancora il simbolo di una fede in Qualcuno che puÃƒÂ² venire in tuo aiuto anche se ÃƒÂ¨ non piÃƒÂ¹ fisicamente dinanzi ai tuoi occhi. PerÃƒÂ² se nella pagina scritta il Leone si confronta con Bacco e le Menadi in un complesso mix di Cristianesimo e Paganesimo, qui ci si limita alla spettacolare antropomorfizzazione della forza delle acque in un momento cruciale della vicenda. \nVicenda che vede i tre fratelli crescere, cosÃƒÂ¬ come accade in Harry Potter e quindi mutare il loro sguardo nei confronti della realtÃƒÂ  (fosse pure quella magica del mondo di Narnia). Ecco allora un primo amore, per quanto solo accennato e una solidarietÃƒÂ /rivalitÃƒÂ  tutta maschile tra Peter e Caspian. I cattivi questa volta (tranne un breve e significativo, anche sul piano dell&amp;#039;interrogativo morale posto dalla scena, ritorno della Regina delle Nevi) sono di stirpe italica. \nSergio Castellitto, nelle vesti di ispirazione ispanico seicentesca di Lord Miraz , ÃƒÂ¨ rapace e barocco quanto basta. Pierfrancesco Favino, con lo sguardo piÃƒÂ¹ cupo del solito, gli fa da braccio destro dubbioso quel tanto che basta per esaltare la bramosia di potere del suo signore.33","torrent":{"xt":"urn:btih:4a3082d1b69543c4027d3abe83e3eea03ffe3dd4","amp;dn":"Le+cronache+di+Narnia.Il+Principe+Caspian.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a3082d1b69543c4027d3abe83e3eea03ffe3dd4","infoHashBuffer":{"type":"Buffer","data":[74,48,130,209,182,149,67,196,2,125,58,190,131,227,238,160,63,254,61,212]},"announce":[],"urlList":[]}}