{"title":"Making the Social World-MANTESH","uid":5804311,"size":8267575,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a6aff1f01b8c4313f92407d34472da12eab91f1&amp;dn=Making+the+Social+World-MANTESH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MANTESH","files":3,"time":1283381862,"description":" &lt;a href=&quot;http://a.imageshack.us/img704/6295/maeo.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://a.imageshack.us/img704/6295/maeo.jpg&lt;/a&gt;\n\n\n\nMaking the Social World: The Structure of Human Civilization\n\n\nOxford University Press | \n\n2010 | \n\nISBN: 0195396170, 0199576912 | \n\n224 pages | \n\nPDF | \n\n7.88 MB\n\n\n\nThere are few more important philosophers at work today than John Searle, a creative and contentious thinker who has shaped the way we think about mind and language. Now he offers a profound understanding of how we create a social reality--a reality of money, property, governments, marriages, stock markets and cocktail parties.\nThe paradox he addresses in Making the Social World is that these facts only exist because we think they exist and yet they have an objective existence. Continuing a line of investigation begun in his earlier book The Construction of Social Reality, Searle identifies the precise role of language in the creation of all &quot;institutional facts.&quot; His aim is to show how mind, language and civilization are natural products of the basic facts of the physical world described by physics, chemistry and biology. Searle explains how a single linguistic operation, repeated over and over, is used to create and maintain the elaborate structures of human social institutions. These institutions serve to create and distribute power relations that are pervasive and often invisible. These power relations motivate human actions in a way that provides the glue that holds human civilization together.\nSearle then applies the account to show how it relates to human rationality, the freedom of the will, the nature of political power and the existence of universal human rights. In the course of his explication, he asks whether robots can have institutions, why the threat of force so often lies behind institutions, and he denies that there can be such a thing as a &quot;state of nature&quot; for language-using human beings...................","torrent":{"xt":"urn:btih:4a6aff1f01b8c4313f92407d34472da12eab91f1","amp;dn":"Making+the+Social+World-MANTESH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a6aff1f01b8c4313f92407d34472da12eab91f1","infoHashBuffer":{"type":"Buffer","data":[74,106,255,31,1,184,196,49,63,146,64,125,52,71,45,161,46,171,145,241]},"announce":[],"urlList":[]}}