{"title":"Jack DeJohnette - The Elephant Sleeps But Still Remembers (2006)","uid":5824532,"size":386928219,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4a6e8f764a2ecd2211270b0ec4c53c68e37c3cd1&amp;dn=Jack+DeJohnette+-+The+Elephant+Sleeps+But+Still+Remembers+%282006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mariorg","files":-1,"time":1284163635,"description":"Jack DeJohnette\nThe Elephant Sleeps But Still Remembers\n2006 - Golden Beams Productions (Jack DeJohnette\\'s Independent Record Label) &lt;a href=&quot;\nhttp://goldenbeams.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://goldenbeams.net/&lt;/a&gt;\n\n* Jack DeJohnette: drums, percussion, vocals, piano\n* Bill Frisell: guitar, banjo\n* Ben Surman: additional percussion\n\nRecorded live in October 2001 at The Earshot Festival in Seattle.\n\nReview\n~~~~~~ &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:a9fyxqrdldke&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:a9fyxqrdldke&lt;/a&gt;\nby Thom Jurek\n\nThis collaboration between drummer, pianist, and composer Jack DeJohnette and\nguitarist Bill Frisell, was recorded live at the Earshot Festival in 2001. But\nit doesn\\'t end there. The pair, who had only played together once before on Don\nByron\\'s Romance with the Unseen, had a chance to listen to the tapes together\nand decided to add some additional production to the tracks. DeJohnette called\nin sound engineer Ben Surman, who added \\&quot;additional production\\&quot;: basslines,\nambient sounds, and other electronics and percussion. If you are raising your\neyebrows in doubt, think again. One listen to the title track that opens the\nalbum should convince you otherwise. Here, a simple blues-like figure becomes a\nriff that the pair build upon, turn inside out, and make into a labyrinthine\njourney. Surman\\'s added basslines root the proceedings deeper into the\ngroove. His ambient and electronic sounds are far from distracting. They are\nmore painterly, unobtrusive and yet colorful. Frisell and DeJohnette are such\nfine listeners and intuitive players that they anticipate one another without\never going over the line that makes free improvisation wankery. The art of the\nduo comes down to one concept ultimately, and that is true collaboration;\nmusically the pair travel someplace different from where they began. Surman\\'s\nadded touch is a grounding exercise for the listener. And it\\'s true it might\nhave been a different recording if it had only been heard as an un-retouched\nperformance. But in a sense, it is. It\\'s here, mistakes and all, and it\\'s far\nfrom covered. It\\'s merely colored a bit. The electronic percussion that leads\noff \\&quot;Entranced Androids\\&quot; is actually coming from Frisell\\'s guitar. Its\nseven-and-a-half minutes are a strange and terrible wonder of musical language\npushed to the edge. DeJohnette\\'s rim-shot percussion keeps it somehow grounded,\nbut he\\'s traveling, too -- Surman\\'s post-production work brings out the true\nweirdness of Frisell\\'s riffing. There are some truly, outrageously out moments\nhere, too, in the brief \\&quot;Cat and Mouse,\\&quot; \\&quot;Otherworldly Dervishes,\\&quot; where Frisell\nplays a free-music banjo, and the sheer soundscape weirdness that is \\&quot;Through\nthe Warphole\\&quot; are examples. They seem to be every other track. The edgy funk on\n\\&quot;Storm Clouds and Mist,\\&quot; touches on blues, jazz, rock and deep funk. Frisell\\'s\nresponse other rhythms being offered him are tough, lean, and fluid. The dub\neffects by Surman are tasty. DeJohnette plays piano on \\&quot;Cartune Riots,\\&quot; and\nFrisell stays all but hidden until halfway through the cut. DeJohnette\\'s pianism\nis lyrical, quirky, and deeply rooted in the lower-middle register. The duo\nreally cut loose on \\&quot;Ode to South Africa,\\&quot; which has Frisell quoting Dudu\nPukwana, Johnny Dyani, and Abdullah Ibrahim, as DeJohnette\\'s drumming rolls\naround in stretched time. Surman\\'s added touch of vocals and regional percussion\ninstruments makes the cut sing. The set ends with a reading of John Coltrane\\'s\n\\&quot;After the Rain,\\&quot; with DeJohnette once again on piano. Its balladic structure is\npreserved, and the space and silence that enter between the lyric phrases allow\nfor Frisell and his digital delay to shape, color, and texturize its gorgeous\nmelody. This is one of those records for the fan who has to have everything, but\nthat said; it is thoroughly enjoyable on its own merit. Highly recommended.\n\nEn castellano (crÃƒÂ­tica menos apasionada y, probablemente, mÃƒÂ¡s realista): &lt;a href=&quot;\nhttp://www.elintruso.com/article.php?id=553&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.elintruso.com/article.php?id=553&lt;/a&gt;","torrent":{"xt":"urn:btih:4a6e8f764a2ecd2211270b0ec4c53c68e37c3cd1","amp;dn":"Jack+DeJohnette+-+The+Elephant+Sleeps+But+Still+Remembers+%282006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a6e8f764a2ecd2211270b0ec4c53c68e37c3cd1","infoHashBuffer":{"type":"Buffer","data":[74,110,143,118,74,46,205,34,17,39,11,14,196,197,60,104,227,124,60,209]},"announce":[],"urlList":[]}}