{"title":"Portable Apps. for your thumb drive","uid":4385816,"size":106596700,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4a836e0dc564a4d94e6d1fd06af72fe7fc3ad3be&amp;dn=Portable+Apps.+for+your+thumb+drive&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Deceitful","files":1,"time":1220912446,"description":"These apps. leave no info. behind of their use.\n\n7-Zip packaged as a portable app, so you can take your file archiver with you and work with your compressed 7z, ZIP, GZIP, BZIP2, TAR, RAR files and more on the go. You can place it on your USB flash drive, iPod, portable hard drive or a CD and use it on any computer, without leaving any personal information behind. 32bit &amp; 64bit versions.\n\nVLC media player packaged as a portable app, so you can take your audio and video files along with everything you need to play them on the go. You can place it on your USB flash drive, iPod, portable hard drive or a CD and use it on any computer, without leaving any personal information behind.\n\nOpenOffice.org office suite, including a word processor, spreadsheet, presentation tool, drawing package and database, packaged as a portable app, so you can take all your documents and everything you need to work with them wherever you go.\n\nMozilla Firefox web browser bundled with a PortableApps.com Launcher as a portable app, so you can take your bookmarks, extensions and saved passwords with you.\n\n\nVery useful for working on computers on the go.\n\nEnjoy and help seed your fellow Pirates.\n\n\n","torrent":{"xt":"urn:btih:4a836e0dc564a4d94e6d1fd06af72fe7fc3ad3be","amp;dn":"Portable+Apps.+for+your+thumb+drive","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a836e0dc564a4d94e6d1fd06af72fe7fc3ad3be","infoHashBuffer":{"type":"Buffer","data":[74,131,110,13,197,100,164,217,78,109,31,208,106,247,47,231,252,58,211,190]},"announce":[],"urlList":[]}}