{"title":"A Guide to Graph Colouring - Algorithms and Applications","uid":12927258,"size":2679409,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ac0788abde34922649ac9a948e75cd2aeac0630&amp;dn=A+Guide+to+Graph+Colouring+-+Algorithms+and+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1449483952,"description":"This book treats graph colouring as an algorithmic problem, with a strong emphasis on practical applications. The author describes and analyses some of the best-known algorithms for colouring arbitrary graphs, focusing on whether these heuristics can provide optimal solutions in some cases; how they perform on graphs where the chromatic number is unknown; and whether they can produce better solutions than other algorithms for certain types of graphs, and why.\r\n\r\nThe introductory chapters explain graph colouring, and bounds and constructive algorithms. The author then shows how advanced, modern techniques can be applied to classic real-world operational research problems such as seating plans, sports scheduling, and university timetabling. He includes many examples, suggestions for further reading, and historical notes, and the book is supplemented by a website with an online suite of downloadable code.\r\n\r\nThe book will be of value to researchers, graduate students, and practitioners in the areas of operations research, theoretical computer science, optimization, and computational intelligence. The reader should have elementary knowledge of sets, matrices, and enumerative combinatorics","torrent":{"xt":"urn:btih:4ac0788abde34922649ac9a948e75cd2aeac0630","amp;dn":"A+Guide+to+Graph+Colouring+-+Algorithms+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ac0788abde34922649ac9a948e75cd2aeac0630","infoHashBuffer":{"type":"Buffer","data":[74,192,120,138,189,227,73,34,100,154,201,169,72,231,92,210,174,172,6,48]},"announce":[],"urlList":[]}}