{"title":"More Complete John Holt Collection","uid":10082583,"size":23161684,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b0b07af82d7b84b7174423300272c764ca2bf9d&amp;dn=More+Complete+John+Holt+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"FFlintston","files":16,"time":1399037481,"description":"The More Complete John Holt\n\nJohn Holt was an American educator and author who is nowadays considered the &quot;father of unschooling.&quot; His several books, especially How Children Fail and How Children Learn, describe a concept of learning that, according to Holt, is founded on two words - &quot;Trust Children.&quot;\n\nThese books are a near-complete set of Holt's available writings. Not included here: Holt's newsletters, titled Growing Without Schooling.\n\nThe following quote provides a sample of Holt's thought. Though he wrote decades ago, he covers the same issues we face today in American education, including regimentation, top-down control, testing, and discouragement; and (as an alternative) preserving, nurturing, and making the best of a child's bright spirit and love of learning.\n\n[Quote from from the introduction to How Children Learn begins here]\n\nI believe ... that young children tend to learn better than grownups (and better than they themselves will when they are older) because they use their minds in a special way.\n\n. . .\n\nOnly a few children in school ever become good at learning in the way we try to make them learn. Most of them get humiliated, frightened, and discouraged. They use their minds, not to learn, but to get out of doing the things we tell them to do - to make them learn. In the short run, these strategies seem to work. They make it possible for many children to get through their schooling even though they learn very little. But in the long run, these strategies are self-limiting and self-defeating, and destroy both character and intelligence. The children who use such strategies are prevented by them from growing into more than limited versions of the human beings they might have become. This is the real failure that takes place in school; hardly any children escape.\n\nWhen we better understand the ways, conditions, and spirit in which children do their best learning, and are able to make school into a place where they can use and improve the style of thinking and learning natural to them, we may be able to prevent much of this failure. School may then become a place in which all children grow, not just in size, not even in knowledge, but in curiosity, courage, confidence, independence, resourcefulness, resilience, patience, competence, and understanding.\n\n. . .\n\nSince I wrote this book our schools have ... moved ... in the wrong direction. Schools are on the whole bigger than they used to be, more depersonalized, more threatening, more dangerous. What they try to teach is even more fragmented than it was, ... &quot;dissociated,&quot; i.e., not connected with anything else, and hence meaningless. Teachers have even less to say than they used to about what they teach and how they teach and test it. The schools cling more and more stubbornly to their mistaken idea that education and teaching are industrial processes, to be designed and planned from above in the minutest detail and then imposed on passive teachers and their even more passive students. ... [T]he weekly test became the daily or hourly or even the fifteen-minute test.\n\nIn any case, I no longer believe we can make schools into places in which all children grow in the ways described above. ... I don't think children with any range of real choices in the world are going to want to spend much time in places where nothing but learning happens, and where the only adults they meet are child specialists whose job it is to watch them and make them do things.\n\n. . .\n\n[V]ivid, vital, pleasurable experiences are the easiest to remember, ... memory works best when unforced, ... it is not a mule that can be made to walk by beating it.\n\nThis book is more about children than about child psychology. I hope those who read it will come to feel, or feel more than when they opened it, that children are interesting and worth looking at. ... I want to whet their curiosity and sharpen their vision, even more than to add to their understanding; to make them skeptical of old dogmas, rather than give them new ones.\n\n. . .\n\nIt takes even the most thoughtful, honest, and introspective person many years to learn even a small part of what goes on in his own mind. How, then, can we be sure about what goes on in the mind of another? Yet many people talk as if we could measure and list the contents of another person's mind as easily, accurately, and fully as the contents of a suitcase.","torrent":{"xt":"urn:btih:4b0b07af82d7b84b7174423300272c764ca2bf9d","amp;dn":"More+Complete+John+Holt+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b0b07af82d7b84b7174423300272c764ca2bf9d","infoHashBuffer":{"type":"Buffer","data":[75,11,7,175,130,215,184,75,113,116,66,51,0,39,44,118,76,162,191,157]},"announce":[],"urlList":[]}}