{"title":"Crossing the Gods - World Religions and Worldly Politics (2001).","uid":11469850,"size":1281177,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b0dda656d7a25f7276745e3f2b893ec11fd2691&amp;dn=Crossing+the+Gods+-+World+Religions+and+Worldly+Politics+%282001%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"interuniversal","files":-1,"time":1416070893,"description":"\nCrossing the Gods - World Religions and Worldly Politics\n\nAuthor: N. J. Demerath, III\n\nISBN: 0813529247\n\nPublisher: Rutgers University Press\n\nCrossing the Gods examines the sometimes antagonistic and sometimes cozy but always difficult and dangerous relationship between religion and politics in countries around the globe.\n\nEminent sociologist of religion Jay Demerath traveled to Brazil, China, Egypt, Guatemala, India, Indonesia, Israel, Japan, Northern Ireland, Pakistan, Poland, Sweden, Turkey, and Thailand to explore the history and current relationship of religion, politics, and the state in each country. In the first part of this wide-ranging book, he asks, What are the basic fault lines along which current tensions and conflicts have formed? What are the trajectories of change from past to present, and how do they help predict the future?\n\nIn the book's second part the author returns home to focus on the United States the only nation founded specifically on the principle of a separation between religion and state and examines the extent to which this principle actually holds and the consequences when it does not. Highlighting such issues as culture wars, violence, globalization, and the fluidity of individual religious identity, Demerath exposes the provincialism and fallacies underlying many of our views of religion and politics worldwide.\n\nFinally, Demerath examines America's status as the world's most religious nation. He places that claim within a comparative context and argues that our country is not &quot;more religious&quot; but &quot;differently religious.&quot; He argues that it represents a unique combination of congregational religion, religious pluralism, and civil religion. But the United States also illustrates the universal tendency for the sacred to give way to the secular and for the secular to generate new forms of the sacred","torrent":{"xt":"urn:btih:4b0dda656d7a25f7276745e3f2b893ec11fd2691","amp;dn":"Crossing+the+Gods+-+World+Religions+and+Worldly+Politics+%282001%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b0dda656d7a25f7276745e3f2b893ec11fd2691","infoHashBuffer":{"type":"Buffer","data":[75,13,218,101,109,122,37,247,39,103,69,227,242,184,147,236,17,253,38,145]},"announce":[],"urlList":[]}}