{"title":"Quincy S02E01_E02  Snake Eyes Part 1 &amp; 2  DVDRip  DivX","uid":4381210,"size":734554126,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4c41d7040921468839e1e4464141c172fe7d7eb7&amp;dn=Quincy+S02E01_E02++Snake+Eyes+Part+1+%26+2++DVDRip++DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"lee.ka","files":3,"time":1220659703,"description":"Quincy, M.E. (1977)\nS02E01_E02  Snake Eyes Part 1 &amp; 2\nFirst aired: 2/4/1977\n\nPart 1:  Quincy, Lee and Danny are all in Lake Tahoe together. Quincy is there for a forensic Pathologist convention and the others for a weekend break. While they are there the guests and staff start coming down with some kind of strange illness. Quincy and a couple of other Forensic Pathologists are called in to help but when some of the patients start dying they still have no clue as to what is killing them. To make things worse the casino owner does not want to admit that anything is wrong, as it will affect his bookings and profits.  Van Johnson, Frank Converse, Buddy Hackett, Jo Ann Pflug guest star.\n\nPart 2:  The disease continues to spread and the rest of the hotel/casino&amp;#039;s guests want to know what is going on. They want to get out of the building but Quincy and his colleagues know that they have to keep the disease, and the guests, contained. If the disease gets out of the hotel it could cause an epidemic that could quickly spread all over the country!\n\nCast: Jack Klugman (Quincy, M.E.), Garry Walberg (Lt. Frank Monahan), Robert Ito (Sam Fujiyama), Lynette Mettey (Lee Potter), Val Bisoglio (Danny Tovo), John S. Ragin (Dr. Robert Astin), Joseph Roman (Sgt. Brill)\n\nGuest cast: Vince Howard (Hardee), Val Avery (Rawley Dinehart) , Frank Converse (Larry Pine), Buddy Hackett (Ronnie Fletcher), Jo Ann Pflug (Mrs. Pine), Van Johnson (Al Ringerman), Frank Maxwell (Michaels), William Mims (DeGroot), John Clavin (Hansen), Jodie Mann (Nurse), Sammy Jackson (News Announcer), Jody Myler (Nurse), Michael Keenan (Man), Michele Roman (Angie), Sharon Cintron (Stormy), Philip Simms (Maintenance Man), Richard Caine (Security Guard), Joey Forman (Harv Bracken), Milt Kamen (Assistant Manager Leo Burke)\n\nDVD&gt;DivX/640x480/930kbps/23.976fps/mp3/48KHz/stereo/103Kbps/93min/700Mb","torrent":{"xt":"urn:btih:4c41d7040921468839e1e4464141c172fe7d7eb7","amp;dn":"Quincy+S02E01_E02++Snake+Eyes+Part+1+%26+2++DVDRip++DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c41d7040921468839e1e4464141c172fe7d7eb7","infoHashBuffer":{"type":"Buffer","data":[76,65,215,4,9,33,70,136,57,225,228,70,65,65,193,114,254,125,126,183]},"announce":[],"urlList":[]}}