{"title":"Thelonious Monk - Monk In Tokyo CD 2 of 2 (1963) [Jazz][mp3 192]","uid":4954394,"size":63693462,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4cbda1336b29530bbfbc19066440d93534e2cbe2&amp;dn=Thelonious+Monk+-+Monk+In+Tokyo+CD+2+of+2+%281963%29+%5BJazz%5D%5Bmp3+192%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":17,"time":1245037479,"description":"Thelonious Monk - Monk In Tokyo CD 2 of 2 \nOriginal Release Date: May 21, 1963 \nAudio CD: July 10, 2001 \nFormat: Live \nLabel: Sony \nBitrate: 192 kbps\n\nA smaller serving than the refurbished Live at the Jazz Workshop, Live in Tokyo is nevertheless a welcome meal for Monk fans.  Previously an expensive Japan-only release, this excellently recorded 1963 visit finds the Monk/Charlie Rouse/Butch Warren/Frankie Dunlop quartet in enthusiastic fettle. On Monk's first visit to the country, he seems determined to offer as many sides of his art as possible. From &quot;Just a Gigolo,&quot; given a solo reading that's sprightly even for this cherished favorite of the pianist, to extended takes on &quot;Hackensack&quot; and &quot;Blue Monk&quot; that provide dramatic climaxes to the show (Dunlop's interaction and interjections on the latter handily recall Art Blakey's explosive work on the 1954 Prestige version) this is one high-powered rÃƒÂ©sumÃƒÂ©. Listeners will understand why Monk was welcomed back lovingly to Japan several more times: judging from the audience response here, he made nothing but friends on this initial trip. ~ Rickey Wright \n\nThis recording of the Thelonious Monk Quartet, taped on May 21,1963 at Tokyo's Sankei Hall, was first issued at the beginning of the eighties.  Following the great &quot;It Club&quot; and &quot;Jazz Workshop&quot; reissues on Columbia, this concert, although it's the shortest of those three live performances, may be the greatest.  Thelonious was a lucky guy: he always had great musicians to play his very difficult music; bassists John Ore, Butch Warren, Ahmed Abdul Malik, Larry Gales, Al McKibbon;drummers Ben Riley, Art Blakey, Frankie Dunlop; and the immense Charlie Rouse, a very underrated tenor sax player, and simply one of the top tenor saxophonists of the jazz history.  By the way, Charlie Rouse seems to be the star of the date, because he plays with absolute ferocity all through the concert.  Frankie Dunlop's hard swinging drumming remains me of Kansas City's days with the imperial Jo Jones.Monk's playing is very abundant, and of course, completely amazing: listen to his solos on &quot;Hackensack&quot; , or &quot;Blue Monk&quot;,in which Dunlop sometimes plays just like Sam Woodyard.  There is terrifying music in this set, and an intensity of swing and freedom that has rarely been reached.The magnificent &quot;Pannonica&quot;, written by Monk and dedicated to Baroness Nica de Koenigswtarter, is very close to Tadd Dameron's writing, and marvelously played by Charlie Rouse.  I don't know if Rouse ever better played than during this concert.&quot;  Just a gigolo&quot;, a Monk's favorite,is a short solo piece.  This tune, which happened to be one of Louis Prima's greatest hits, is here played in a very sad and desperate way; Monk recorded it several times, always in the same mood.  Remember his definitive version on his &quot;Solo Monk&quot; album on Columbia, one of the ten greatest albums ever recorded in the jazz history.  If you love Thelonious Monk's music, this is a must to have,one hour and a half of very great music. ~ Jean-Marue Juif\n\n\nPersonnel:\nThelonious Monk (piano)\nCharlie Rouse (tenor saxophone)\nButch Warren (bass)\nFrankie Dunlop (drums)\n\nThelonious Monk - Monk In Tokyo CD 1 of 2 Tracks:\n01  Straight, No Chaser\n02  Pannonica \n03  Just A Gigolo\n04  Evidence (Justice) \n05  Jackie-ing\n06  Bemsha Swing \n07  Epistrophy\n\nThelonious Monk - Monk In Tokyo CD 2 of 2 Tracks:\n01  I'm Getting Sentimental Over You\n02  Hackensack\n03  Blue Monk\n04  Epistrophy","torrent":{"xt":"urn:btih:4cbda1336b29530bbfbc19066440d93534e2cbe2","amp;dn":"Thelonious+Monk+-+Monk+In+Tokyo+CD+2+of+2+%281963%29+%5BJazz%5D%5Bmp3+192%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cbda1336b29530bbfbc19066440d93534e2cbe2","infoHashBuffer":{"type":"Buffer","data":[76,189,161,51,107,41,83,11,191,188,25,6,100,64,217,53,52,226,203,226]},"announce":[],"urlList":[]}}