{"title":"Secret Freedom Fighter - Fighting Tyranny without Terrorizing","uid":3845142,"size":253316,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d68268640cab0ddcb5d2e4df8afba695a111637&amp;dn=Secret+Freedom+Fighter+-+Fighting+Tyranny+without+Terrorizing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"diinero","files":1,"time":1192587885,"description":"Jefferson Mack - Secret Freedom Fighter\nFighting Tyranny without Terrorizing the Innocent\n\nLife is not worth much if you&amp;#039;re not free--and worth nothing at all if you&amp;#039;re dead. Freedom can be stolen from you at any time. Be prepared. Find out how every citizen can maximize his own freedom while minimizing the risks by being a secret freedom fighter. A totalitarian state is what we might get after the collapse of society, economic disaster or natural cataclysm. And then we&amp;#039;ll have to fight for our freedom as well as for survival. If you want to be a secret freedom fighter, you won&amp;#039;t join any protest groups, stand on street corners making speeches, or run with a mob that throws rocks at cops. The secret freedom fighter must fight alone. The secret freedom fighter has to be the invisible man, always working in secret. Because he is one man working alone, he doesn&amp;#039;t have to do as much damage in a single operation as a guerrilla force would to justify the risk. And he doesn&amp;#039;t have to worry that someone will betray him and turn him in to the authorities. With years of experience in governmental, religious and freelance assignments around the world, the author has learned how unfree governments work and where they are most vulnerable to attack by an individual acting on his own. He tells which targets are fair game--and which aren&amp;#039;t--choosing weapons and methods, lethal and non lethal tactics, working within your own limitations to wreak havoc on morale and government operations, and much more.\n\nPlease smuggle this book into any country that you can. No other single work can do more damage to enemies of freedom.","torrent":{"xt":"urn:btih:4d68268640cab0ddcb5d2e4df8afba695a111637","amp;dn":"Secret+Freedom+Fighter+-+Fighting+Tyranny+without+Terrorizing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d68268640cab0ddcb5d2e4df8afba695a111637","infoHashBuffer":{"type":"Buffer","data":[77,104,38,134,64,202,176,221,203,93,46,77,248,175,186,105,90,17,22,55]},"announce":[],"urlList":[]}}