{"title":"Marcia Ball - 2008 - Peace, Love &amp; BBQ FLAC","uid":11188757,"size":341410921,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4e4cc19ddb6f24f4b49d48914d85aae7e568ac81&amp;dn=Marcia+Ball+-+2008+-+Peace%2C+Love+%26amp%3B+BBQ+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eika256","files":-1,"time":1412963712,"description":"Marcia Ball - 2008 - Peace, Love &amp; BBQ\n\nLike other artists on the Alligator label, it can be tough to distinguish one Marcia Ball album from the next. Lots of upbeat party tunes, a few peppy Cajun and Zydeco inflected zingers, some ballads, and a couple of love songs all delivered with Ball's husky, soulful voice and driven by her nimble boogie-woogie piano describes this album as well as her older ones. But that's not necessarily a problem since she is such a classy, demanding, and talented musician it just means her quality control is high enough so there aren't any clunkers. Still, she has defined her niche through the decades and mines it on her first studio release in five years and tenth overall. There are a larger percentage of originals here -- eight of the 13 tunes are either written or co-written by the lanky pianist/singer, and all are up to her usual standards. Horns -- some arranged by the legendary Wardell Quezergue, who has worked with Fats Domino and Professor Longhair -- punctuate five tracks and add even more hot sauce to the proceedings. Stephen Bruton's nimble production keeps the sound open and spacious by highlighting Ball's voice in the mix. Tracy Nelson returns from the album she, Irma Thomas, and Ball jointly released to provide duet vocals on the melancholy &quot;Where Do You Go?,&quot; a moving ballad they co-wrote. The festive cuts display Ball's energetic delivery with Bobby Charles' New Orleans loving &quot;Party Town&quot; kicking off the proceedings. Wayne Toups provides Cajun accordion for the frisky &quot;Married Life,&quot; and &quot;Right Back on It&quot; references a Chuck Berry goes to Louisiana approach that's right down Ball's alley. Dr. John adds his distinctive croak to &quot;I'll Never Be Free,&quot; a classic American standard that allows both singers a chance to croon and swoon and is reminiscent of the version Louis Armstrong performed with Ella Fitzgerald. Ball taps the Bill Withers catalog for &quot;I Wish You Well,&quot; a terrific closing tune that gives saxist Thad Scott room to let loose. The most gripping moment, though, is Ball's own &quot;Miracle in Knoxville.&quot; It's a riveting story about a preacher being struck down dead in front of a tent revival where he was baptizing the believers. The eerie track is rather incongruously stuck between the playful title tune and the lighthearted funk of &quot;Watermelon Time&quot; but shows the singer/songwriter can compose lyrics that deal with more serious subjects than her usual fare. Like that man of the cloth, Ball might be preaching to the converted with Peace, Love &amp; BBQ, but it's a sermon well worth hearing. (AllMusic)\n\nTrack list:\n01 - Party Town\n02 - Peace, Love &amp; BBQ\n03 - Miracle In Knoxville\n04 - Watermelon Time\n05 - Down In The Neighborhood\n06 - Where Do You Go\n07 - My Heart &amp; Soul\n08 - I'll Never Be Free\n09 - Married Life\n10 - Fall Back In Love\n11 - Right Back In It\n12 - Ride It Out\n13 - Marcia Ball , I Wish You Well\n\nEnjoy and share!","torrent":{"xt":"urn:btih:4e4cc19ddb6f24f4b49d48914d85aae7e568ac81","amp;dn":"Marcia+Ball+-+2008+-+Peace%2C+Love+%26amp%3B+BBQ+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e4cc19ddb6f24f4b49d48914d85aae7e568ac81","infoHashBuffer":{"type":"Buffer","data":[78,76,193,157,219,111,36,244,180,157,72,145,77,133,170,231,229,104,172,129]},"announce":[],"urlList":[]}}