{"title":"FHM India - March 2016 (gnv64)","uid":13708308,"size":31983470,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f5ca5dfde8d8248121fe3ae453fe1f2641a4c34&amp;dn=FHM+India+-+March+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":5,"time":1456847150,"description":"FHM India - March 2016\r\nEnglish | 100 Pages | True PDF | 30.2 mb\r\n\r\nACCESS\r\n12 PLANNER - What’s new, what’s happening, and what the world is talking about... We’ve got it all here!\r\n14 TEAM AFFAIR - It’s not all-work, no-play here at our office. Learn to live life, the FHM way.\r\n20 FOAM 4 UR FACE - Beard is important for us. But your life changes when you meet a girl. It’s time to shave. Which cream do you choose?\r\nFILTER\r\n24 MAHINDRA’S MAGIC - What do you call a bike which has more oompf than Austin Powers? Oh, it’s the new Mojo from Mahindra Two Wheelers!\r\n26 LEGAL DATE - The magnetic New York lawyer, Harvey Specter talks Suits, his luck with production, direction and much more...\r\n28 BLOKE TEST - He’s the first Indian to be on Beatport’s Top 100, but is DJ Sartek ready for the manliest test on Earth?\r\nFEATURES\r\n40 G.O.T. VS G.O.I.* - We always thought Robb and Rahul have much in common, but then we stumbled upon a whole new universe! *Don’t take offence, people.\r\n54 MUSIC SPECIAL - In search of some new tunes, we strolled across four cities and six genres. And here’s what we found!\r\n76 ART OF ALCOHOL - Yes, we men like to drink. But for those with a refined sense of aesthetics, it’s more than just the booze. From crystal to stuffed, furry animals, these spirits will stay with you.\r\nUPGRADE\r\n84 OWN A UFO - Unmanned Flying Objects have gotten more sophisticated than just R/C planes. We list the better civilian drones out there.\r\n88 DAN TELLS - We sat down Nike’s head coach Daniel Vaz for everything that you need to know about running and staying fit.\r\n90 FHM GIRLFRIEND - Sindey Sebold is on hand to up your game down under.\r\n96 PANDORA’S BOX - This, that and everything in between.\r\n \nhttp://s12.postimg.org/khxzov8hp/FHM_India_March_2016.jpg","torrent":{"xt":"urn:btih:4f5ca5dfde8d8248121fe3ae453fe1f2641a4c34","amp;dn":"FHM+India+-+March+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f5ca5dfde8d8248121fe3ae453fe1f2641a4c34","infoHashBuffer":{"type":"Buffer","data":[79,92,165,223,222,141,130,72,18,31,227,174,69,63,225,242,100,26,76,52]},"announce":[],"urlList":[]}}