{"title":"Ionic Liquids in Separation Technology","uid":14644763,"size":12089913,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4fa689c619717ab00657e9ed2e296e857b004cc6&amp;dn=Ionic+Liquids+in+Separation+Technology&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1463576730,"description":"Ionic Liquids in Separation Technology - A.P.D.L. Rios, F.J.H. Fernandez (Elsevier, 2014).pdf\r\n\r\nISBN 9780444632579\r\n\r\nIonic Liquids in Separation Technology reports on the most important fundamental and technological advances in separation processes using ionic liquids. It brings together the latest developments in this fascinating field, supplements them with numerous practical tips, and thus provides those working in both research and industry with an indispensable source of information.\r\n\r\nThe book covers fundamental topics of physical, thermal, and optical properties of ionic liquids, including green aspects. It then moves on to contexts and applications, including separation of proteins, reduction of environmental pollutants, separation of metal ions and organic compounds, use in electrochromic devices, and much more.\r\n\r\nFor the specialist audience the book serves as a recompilation of the most important knowledge in this field, whereas for starting researchers in ionic liquid separation technology the book is a great introduction to the field.\r\n\r\nFirst book in the marketplace dedicated to ionic liquids in separation technology\r\nContributions from scientists in academia and researchers in industry ensure the coverage of both scientific fundamentals and industrial applications\r\nCovers a broad collection of applications in separation technology which makes the book a single source of information\r\nIncludes many practical tips for researchers in industry and scientists who apply ionic liquids in their work","torrent":{"xt":"urn:btih:4fa689c619717ab00657e9ed2e296e857b004cc6","amp;dn":"Ionic+Liquids+in+Separation+Technology","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fa689c619717ab00657e9ed2e296e857b004cc6","infoHashBuffer":{"type":"Buffer","data":[79,166,137,198,25,113,122,176,6,87,233,237,46,41,110,133,123,0,76,198]},"announce":[],"urlList":[]}}