{"title":"La Bibila de Barro - Julia Navarro [Ebook][Spanish]","uid":6674712,"size":3750658,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4fab23cce8f8675f2deab26bfc803c77a95ded2f&amp;dn=La+Bibila+de+Barro+-+Julia+Navarro+%5BEbook%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"virana","files":-1,"time":1315989320,"description":"Julia Navarro - La biblia de barro\nRESUMEN:\n\nUna arqueÃƒÂ³loga iraquÃƒÂ­ nieta de un poderoso hombre con un oscuro pasado, cuatro ancianos con sed de venganza, traficantes de arte sin escrÃƒÂºpulos, un hombre en la sombra que mueve muchos hilos -El Mentor-, dos asesinos a sueldo y un cura que escuchÃƒÂ³ una confesiÃƒÂ³n que jamÃƒÂ¡s debiÃƒÂ³ oÃƒÂ­r... Estos son algunos de los protagonistas de un rompecabezas inquietante que no se resuelve hasta la ÃƒÂºltmia pÃƒÂ¡gina.\n\nTral el ÃƒÂ©xito de su primera novela La Hermandad de la Sabana Santa, Julia Navarro se confirma con La Biblia de Barro como maestra en la creaciÃƒÂ³n de tramas que atrapan al lector desde la primera pÃƒÂ¡gina. El mundo del arte, la Segunda Guerra Mundial y sobre todo el poder que mueve los hilos del mundo por encima de la polÃƒÂ­tica y las creencias son los autÃƒÂ©nticos protagonistas de esta novela que llevarÃƒÂ¡ al lector por la historia y la intriga hasta un apasionante y sorprendente final.\n\nCritica\nSobrecoge siempre, por infame y nefanda, cualquier aproximaciÃƒÂ³n o braceo hacia los inmundos e inimaginables horrores de la Alemania nazi,\n\nCuesta deglutir, como una bola de sebo que se nos atragantara, conformada por osamentas reventadas y casquillos de balas de ametralladora que segaron la vida de miles y miles de inocentes, la espeluznante readiografÃƒÂ­a de aquellos campos de concentraciÃƒÂ³n que, pervertidos con eufemismos, la vesanÃƒÂ­a nazi se empeÃƒÂ±ÃƒÂ³ en considerar como &quot;filtros necesarios de detritos&quot; para preservar la pureza y hegemonÃƒÂ­a de la raza aria.\n\nLa sombra de aquel holocausto innombrable, que fue un oprobio execrable y una vergÃƒÂ¼enza indeleble para la consciencia colectiva de toda la humanidad, planea de un modo somero sobre el cielo literario de esta novela magistral de la escritora Julia Navarro: &quot;La Biblia de Barro&quot;.\n\nEn ella, nos presenta a un personaje, Alfred Tannenberg, que indigesta por ignominioso y demonÃƒÂ­aco, verdugo de aquellos dÃƒÂ­as de iniquidad infrahumana sin parangÃƒÂ³n ni baluartes de contenciÃƒÂ³n.\n\nSon solo breves asomos a aquellas panorÃƒÂ¡micas de brutalidad atroz, tan bien descritos por Julia Navarro que uno casi puede palpar las heridas mortales del alma y el corazÃƒÂ³n desgarrado de los escasos supervivientes, hacinados en aquellos campos de exterminio como ganado enfermo.\n\nEn todo caso, la novela navega con discreta parsimonia hacia el mismo epicentro pÃƒÂºtrido de este rufiÃƒÂ¡n impÃƒÂ­o, y vamos poco a poco despellejando la piel de la naturaleza abyecta de este monstruo genocida, convertido en el eje central del odio y de un juramento de venganza sagrado de 4 amigos hostigados de por vida por los pasajes fantasmales de un pasado extremadamente devastador.\n\nComo antesala del horror perpetrado por Tannenberg, la escritora inicia su singladura novelada con la promesa de un hombre que confiesa su recia intenciÃƒÂ³n de asesinar a otro. Semejante aperitivo enciende inmediatamente todos los pilotos de alarma de un devenir inclemente y proceloso.\n\nPero para personajes imprescindibles, es de ley la referencia al antiguo escriba Shamas, ubicuo morador en los pensamientos de la brillante y atractiva arqueÃƒÂ³loga Clara Tannenberg.\n\nResulta fascinante la extenuante bÃƒÂºsqueda en pos de su legado, que dejara rubricado en unas antiquÃƒÂ­simas tablillas de valor incalculable que, presuntamente, vendrÃƒÂ­an a demostrar la existencia del patriarca Abraham y narrarÃƒÂ­an en detalle el GÃƒÂ©nesis.\n","torrent":{"xt":"urn:btih:4fab23cce8f8675f2deab26bfc803c77a95ded2f","amp;dn":"La+Bibila+de+Barro+-+Julia+Navarro+%5BEbook%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fab23cce8f8675f2deab26bfc803c77a95ded2f","infoHashBuffer":{"type":"Buffer","data":[79,171,35,204,232,248,103,95,45,234,178,107,252,128,60,119,169,93,237,47]},"announce":[],"urlList":[]}}