{"title":"HighSchool DxD Season 2","uid":10211093,"size":4182834522,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4fd032a4106ccc9c5a3fe229eae79e41a8532fa5&amp;dn=HighSchool+DxD+Season+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wildturkey00","files":12,"time":1400910287,"description":"Issei wakes up on a certain morning and finds Rias sleeping naked beside him until Asia arrives to wake Issei up which ends up in a hectic morning for Issei after Rias deliberately provoked Asia. Later, while having his usual school days with his friends, Issei's Dragon arm awoke forcing Issei to meet Akeno to have the Dragon Power removed. After school, Rias and the others arrived at Issei's house to have their usual club activity until Issei's mom arrived and showed Issei's childhood photos. Among one of those, Kiba notices that there was a Holy Sword among the photos Issei took with his friend while playing at that friend's house. Later, while on the way home after Issei completed a contract with his new client, Issei and his friends receives an order to hunt down a Stray Devil at an abandoned factory. The team manages to defeat the Stray Devil &quot;albeit&quot; with some difficulties due to Kiba not paying attention in the fight. When questioned by Rias, Kiba gestures it off as nothing and leaves soon after, with Issei following in pursuit worried about him as Kiba reveals to Issei his purpose of living: to seek revenge against the Holy Sword Excalibur. Later at his house, Issei questions Rias about the Holy Sword and Kiba's past where he was part of a project called &quot;The Holy Sword Project&quot; where he was the only survivor of it. Kiba, on his way back, witnesses a priest being killed by Freed Sellzen and was further enraged by the Excalibur that Freed was wielding, leading to a battle between the two. Meanwhile, two unknown individuals arrived in Issei's town. ","torrent":{"xt":"urn:btih:4fd032a4106ccc9c5a3fe229eae79e41a8532fa5","amp;dn":"HighSchool+DxD+Season+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fd032a4106ccc9c5a3fe229eae79e41a8532fa5","infoHashBuffer":{"type":"Buffer","data":[79,208,50,164,16,108,204,156,90,63,226,41,234,231,158,65,168,83,47,165]},"announce":[],"urlList":[]}}