{"title":"Coast to Coast AM February 15 2013","uid":8151323,"size":55988115,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5013ca06477773771abfd08474ba3a2f49d67059&amp;dn=Coast+to+Coast+AM+February+15+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1361043141,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t02-15-13\nHost: \tGeorge Noory\nGuests: \tPaul O'Brien, Richard C. Hoagland, Open Lines\n\nIn the first hour, author Paul O'Brien, discussed how we can use tools of divination such as the I-Ching to help enhance our own intuition. He defined divination as &quot;a way to stimulate the intuition around problems that logic can't handle, in order to think outside the box.&quot; O'Brien stressed that it is not a method of predicting the future and, instead, acts as a way of providing possible insights into challenges such as interpersonal relationships and the timing of business decisions. Ultimately, he said, divination can provide some form of direction to either take action, do nothing, or retreat. &quot;If you get one new idea from an I-Ching reading,&quot; he said, &quot;it's done its job.&quot; O'Brien is providing a free e-book on divination for Coast listeners at his website.\nMeteorite Impact\n\nIn the 2nd hour, Richard C. Hoagland talked about the meteorite crash in Russia and Friday's asteroid flyby. While he dismissed the possibility that the two events were related, Hoagland did express suspicion that the trajectory of the asteroid had been influenced by intelligent forces not of this Earth. To that end, he cited the uncanny flight path of the object, where it managed to avoid hitting satellites in space as well as the planet, as a potential clue that it had been steered into place. The reason for this, Hoagland suggested, may have been to warn, or even threaten, the human race about the potential dangers of an asteroid impact on the planet. During his appearance, a caller from Russia shared his first-hand report on the meteorite impact.\nOpen Lines\n\nDuring Open Lines, Nelson in Cincinnati shared &quot;the most important information, so far, on planet Earth.&quot; He warned that the development of self-replicating computers would lead to the downfall of the human race. Nelson explained that, unlike humans, computers are adverse to the &quot;water and sodium based system of our biosphere.&quot; As such, he surmised that this emerging technology will engineer an event which causes the atmosphere of the Earth to be destroyed. These self-replicating computers are not necessarily evil, Nelson contended, but are merely interested in their own survival on the planet.\n\nLater in the program, Vicki in Irvine, California, who claimed to be a psychic, predicted &quot;two days of darkness&quot; which will follow the meteorite event in Russia. She claimed that the impact was the result of humans &quot;attacking&quot; other planets via the space program. Laura in Hunter, New York expressed her concerns about the effect microwave ovens have on humans. To that end, she cited an experiment conducted by a 10-year-old girl for a school project where she fed microwaved water to plants. The result, Laura said, was that the plant &quot;turned black and died within a few days.&quot;\n\nNews segment guests: Dan Durda &amp; Catherine Austin Fitts\nWebsite(s):\n\n    divination.com\n    enterprisemission.com\n\nBook(s):\n\n    The Visionary I Ching: A Book of Changes for Intuitive Decision Making\n    Divination: Sacred Tools for Reading the Mind of God\n    Dark Mission: The Secret History of NASA\n    The Monuments of Mars: A City on the Edge of Forever\n\n","torrent":{"xt":"urn:btih:5013ca06477773771abfd08474ba3a2f49d67059","amp;dn":"Coast+to+Coast+AM+February+15+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5013ca06477773771abfd08474ba3a2f49d67059","infoHashBuffer":{"type":"Buffer","data":[80,19,202,6,71,119,115,119,26,191,208,132,116,186,58,47,73,214,112,89]},"announce":[],"urlList":[]}}