{"title":"Samir Sorour","uid":7328531,"size":680107512,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:50fd34dffbc255b4d5a91cf14d17576de3cb1a6a&amp;dn=Samir+Sorour&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"metheguy","files":-1,"time":1338837197,"description":"Samir Sorour or passionate saxophone\n\nSamir was born in April 26, 1933. The music is very early his main focus. He joined the military academy of Music. He immediately fell in love with the saxophone. Samir is quickly spotted by Baligh Hamdi, a large Egyptian lute. This event propelled the young man at the top. A musical destiny is running. It is the early history of the oriental saxophone.\n\nHe became acquainted through Baligh the great Oum Kalthoum, who offered him to be part of her orchestra. His most famous songs with the diva of the Nile are: &quot;Fat El Miad&quot; and &quot;Alf Leila We Leila&quot;. Samir is now a must. He is one of the first saxophonists in the world to adapt this instrument to the oriental music. He works with the greatest artists of the time like Abd El Halim Hafez, Fayza Ahmed or Nagat Elsaghera.\n\nBut this does not prevent him from playing solo. He released six albums entitled &quot;Aachik Assax (The passionate Sax). To cite a few of his songs: &quot;Zay El Hawa&quot; (composed by Baligh Hamdi), &quot;Ya Waheshny&quot; (composed by Farid El Atrache) or &quot;Betesal Leih Alaya&quot; (composed by Fouad Helmy). In the interests of transmission, Samir collaborates and shares with the new generation his experience and knowledge.\n\nHis saxophone accompanies him until his last breath. It is said that his instrument was offered by a wealthy admirer and was entirely in gold. He died in May 31, 2003, leaving behind him a musical heritage that has inspired and still inspire the musicians from Egypt and the world.\n\nSamir Sorour - Ashek El Sax Vol.1 - 1998 320Kbps\nSamir Sorour - Ashek El Sax Vol.2 - 1998 320Kbps\nSamir Sorour - Ashek El Sax Vol.3 - 1998 320Kbps\nSamir Sorour - Ashek El Sax Vol.4 - 1998 320kbps\nSamir Sorour - Ashek El Sax Vol.5 - 1998 320Kbps\nSamir Sorour - Ashek El Sax Vol.6 - 1998 320Kbps\n","torrent":{"xt":"urn:btih:50fd34dffbc255b4d5a91cf14d17576de3cb1a6a","amp;dn":"Samir+Sorour","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50fd34dffbc255b4d5a91cf14d17576de3cb1a6a","infoHashBuffer":{"type":"Buffer","data":[80,253,52,223,251,194,85,180,213,169,28,241,77,23,87,109,227,203,26,106]},"announce":[],"urlList":[]}}