{"title":"Rejection Proof - Jia Jiang","uid":11980825,"size":428422,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5161d5b7ce330034ae313c017a6bd7d36ef62e59&amp;dn=Rejection+Proof+-+Jia+Jiang&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1433201841,"description":"An entertaining and inspiring account of conquering his fear of rejection, offering a completely new perspective on how to turn a no into a yes.\n\nJia Jiang came to the United States with the dream of being the next Bill Gates. But despite early success in the corporate world, his first attempt to pursue his entrepreneurial dream ended in rejection. Jia was crushed, and spiraled into a period of deep self doubt. But he realized that his fear of rejection was a bigger obstacle than any single rejection would ever be, and he needed to find a way to cope with being told no without letting it destroy him. Thus was born his &quot;100 days of rejection&quot; experiment, during which he willfully sought rejection on a daily basis--from requesting a lesson in sales from a car salesman (no) to asking a flight attendant if he could make an announcement on the loud speaker (yes) to his famous request to get Krispy Kreme doughnuts in the shape of Olympic rings (yes, with a viral video to prove it). \n\nJia learned that even the most preposterous wish may be granted if you ask in the right way, and shares the secret of successful asking, how to pick targets, and how to tell when an initial no can be converted into something positive. But more important, he learned techniques for steeling himself against rejection and ways to develop his own confidence--a plan that can't be derailed by a single setback. Filled with great stories and valuable insight, Rejection Proof is a fun and thoughtful examination of how to overcome fear and dare to live more boldly","torrent":{"xt":"urn:btih:5161d5b7ce330034ae313c017a6bd7d36ef62e59","amp;dn":"Rejection+Proof+-+Jia+Jiang","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5161d5b7ce330034ae313c017a6bd7d36ef62e59","infoHashBuffer":{"type":"Buffer","data":[81,97,213,183,206,51,0,52,174,49,60,1,122,107,215,211,110,246,46,89]},"announce":[],"urlList":[]}}