{"title":"Faith No More - The Real Thing (Deluxe Edition 2-CD) 2015","uid":12076055,"size":244459748,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:51747295262b276035e68b28d6b876a2070fa0d6&amp;dn=Faith+No+More+-+The+Real+Thing+%28Deluxe+Edition+2-CD%29+2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":22,"time":1435648026,"description":"The tour in support of The Real Thing was the first Faith No More did with Mike Patton. The second show of the tour was filmed for the music video to &quot;From out of Nowhere&quot; in the I-Beam nightclub. During the show, Patton had a beer bottle smashed over his right hand causing lacerations to some tendons. He was able to use his hand again after it healed, but he has no feeling in it.\n\n\nThe first single to be released from the album was &quot;From Out of Nowhere&quot; on August 30, 1989 which failed to make the UK Singles Chart. It was re-released in April 2, 1990 and made number twenty-three on the UK Singles Chart. In between these releases was &quot;Epic&quot; on January 30, 1990 the music video for which received extensive airplay on MTV throughout the year, despite provoking anger from animal rights activists for a slow motion shot of a fish flopping out of water. &quot;Falling to Pieces&quot; then saw release on July 2, 1990 and made it to number 92 on the Billboard Hot 100 before the reissue of &quot;Epic&quot; which then provided the band's first number one hit single, on the ARIA Charts,[14] and their only top ten single on the Billboard Hot 100, making it to number nine\n\n&quot;Surprise! You're Dead!&quot; had a music video produced for it, that was directed by bassist Billy Gould featuring footage shot in Chile during a South American tour in 1991, but never saw release as an official single and the video wasn't released until its appearance on Video Croissant. &quot;Edge of the World&quot; saw limited release as a two track promo single in Brazil on CD and 12&quot; vinyl, with the album version as track one and the live at Brixton Academy version as the second track, in a yellow slipcase with basic black text.\n\nThe Real Thing is one of Faith No More's most successful albums to date. It is now considered a classic metal album by fans and critics alike. Although released in mid-1989, The Real Thing didn't enter the Billboard 200 until February 1990,[18] after the release of the second single from the album, &quot;Epic&quot;. The album eventually peaked at number eleven on the chart in October 1990, following the reissue of &quot;Epic&quot; almost a year and half after the initial release of the album. It was eventually certified platinum in U.S. and Canada as well as being certified Silver in the United Kingdom\n\nFaith No More: The Real Thing - Deluxe 2-CD Edition\n\n\nDisc 1 Titles\n\t\nArtist\n\t\nLength\n1.\nFrom Out Of Nowhere\n\tFaith No More \t03:21\n2.\nEpic\n\tFaith No More \t04:53\n3.\nFalling To Pieces\n\tFaith No More \t05:13\n4.\nSurprise! You're Dead!\n\tFaith No More \t02:26\n5.\nZombie Eaters\n\tFaith No More \t06:00\n6.\nThe Real Thing\n\tFaith No More \t08:14\n7.\nUnderwater Love\n\tFaith No More \t03:51\n8.\nThe Morning After\n\tFaith No More \t03:43\n9.\nWoodpecker From Mars\n\tFaith No More \t05:41\n10.\nWar Pigs\n\tFaith No More \t07:45\n11.\nEdge Of The World\n\tFaith No More \t04:10\n\n\nDisc 2 Titles\n\t\nArtist\n\t\nLength\n1.\nSweet Emotion\n\tFaith No More \t04:53\n2.\nEpic (Radio Remix Edit)\n\tFaith No More \t03:59\n3.\nFalling To Pieces (Matt Wallace Remix)\n\tFaith No More , Matt Wallace \t04:32\n4.\nCowboy Song\n\tFaith No More \t05:13\n5.\nThe Grade\n\tFaith No More \t02:05\n6.\nFrom Out of Nowhere (Extended Remix)\n\tFaith No More \t04:17\n7.\nWar Pigs (Live in Berlin 11/09/1989\n\tFaith No More \t07:59\n8.\nSurprise! You're Dead! (Live in Sheffield)\n\tFaith No More \t02:51\n9.\nChinese Arithmetic (Live in Sheffield)\n\tFaith No More \t04:15\n10.\nUnderwater Love (Live in Brixton)\n\tFaith No More \t03:33\n11.\nAs The Worm Turns (Live in Brixton)\n\tFaith No More \t03:45\n\n\n\nNow, if you like the music go to the shows and buy the merch,Want the CD buy it from the bands webpage NOT wal-mart) that money goes to the artists not to anyone else","torrent":{"xt":"urn:btih:51747295262b276035e68b28d6b876a2070fa0d6","amp;dn":"Faith+No+More+-+The+Real+Thing+%28Deluxe+Edition+2-CD%29+2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51747295262b276035e68b28d6b876a2070fa0d6","infoHashBuffer":{"type":"Buffer","data":[81,116,114,149,38,43,39,96,53,230,139,40,214,184,118,162,7,15,160,214]},"announce":[],"urlList":[]}}