{"title":"AutoReader 3D","uid":7427354,"size":1289223,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:5205dfdc14dffcd509ae81876b068d78a81a7e5c&amp;dn=AutoReader+3D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dmpost","files":1,"time":1341843896,"description":"This not just another ebook reader.\nOur reader has several unique features:\n - in AutoReader mode flashes words or phrases one by one sequentially on the screen, with regulated speed.\n - in 3D Stereo mode you can read with 3D effect on any device.\n - in overview mode you can scroll or flip pages in the same time.\n - support pinch, spread and rotate gestures to change text size or screen orientation any time you need.\n\nScreens: &lt;a href=&quot;\nhttp://webstunning.com/img/autoreader_eng.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://webstunning.com/img/autoreader_eng.jpg&lt;/a&gt;\n\nYouTube:\n \nThese features allows to turn reading into a useful and fascinating process, and reduce eye strain.\n\nAutoReader allows to read much larger text, what's important not only for people with impaired vision.\nBut also, for example, in transport, on the go, on the running machine, etc. when focusing on a small text tiring for the eyes or impossible.\n\nMoreover, 3D Stereo mode can even be beneficial for the eyes, if done right, the visual axis\nare parallel (as when looking at the horizon), which relaxes the external eye muscles, and the focus is on the stereo pair,\nthat helps to synchronize the focus of both eyes, which is also useful, as it's often one eye focuses better than the other (we can be unaware of it, but simply feel tired).\n\n\nRead for the benefit of your eyes! But that's not all, AutoReader allows you to read faster than usual.\n\nAutoReader increases the speed of reading and helps get rid of subvocalization, one of the main factors slowing down the reading process. Subvocalization - it is hidden, unconscious movement of the lips, tongue and other organs of speech.\nThe habit to pronounce the words formed in the childhood, when learning to read, and does not disappear completely, without any special training.\nTry to gradually increase the speed of displaying words (slide your finger up the screen), with the growth of speed the vocal apparatus is no longer keep up with the volume of information and no longer involved in the processing - information from the visual analyzer will be immediately sent to the meaning.\nThe feel is cool, as if you just catch the author's idea, not a speech.\nYou realize that you can read much faster and without much effort.\n\n\nList of features:\n  - Built-in file browser.\n  - Supported formats. Txt, Txt.zip, Fb2, Fb2.zip, Epub, (PDF, DOC and others are comming soon).\n  - Automatic detection of encoding.\n  - Smooth scrolling text (finger up / down).\n  - Flipping through the pages (finger left / right).\n  - Go to a random page number.\n  - Change the text size &quot;on the fly&quot; (zoom with two fingers).\n  - Rotate the screen at any time in any mode (tap the screen with two fingers and rotate it 90 degrees).\n  - Double click to go to another mode (from Overview mode to AutoReader, from mono to 3D Stereo mode and vice versa).\n  - Infinitely variable speed of AutoReader (finger up / down the screen).\n  - View and move to the previous or next sentence in the AutoReader mode (finger left / right on the screen).\n  - Settings for the font, text color and background color.\n  - Select from over 20 background images for AutoReader.\n  - Built-in help for gestures and 3D Stereo mode.\n\n\nAndroid market pages (play.google.com)\nfree version &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.webstunning.fc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.webstunning.fc&lt;/a&gt;\n\npaid version &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.webstunning.textreader&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.webstunning.textreader&lt;/a&gt;","torrent":{"xt":"urn:btih:5205dfdc14dffcd509ae81876b068d78a81a7e5c","amp;dn":"AutoReader+3D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5205dfdc14dffcd509ae81876b068d78a81a7e5c","infoHashBuffer":{"type":"Buffer","data":[82,5,223,220,20,223,252,213,9,174,129,135,107,6,141,120,168,26,126,92]},"announce":[],"urlList":[]}}