{"title":"Margaret Bourke-White - Her pictures were her life (Photography ","uid":10172437,"size":15168342,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5209e515f6afacbd5531935b416a831f3430920d&amp;dn=Margaret+Bourke-White+-+Her+pictures+were+her+life+%28Photography+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1400422545,"description":"Abrams / 1999 / pdf / english / 104 pag / 14.4 MB\n\nAn inspiring biography of one of the most successful photojournalists of the 20th century, this life of Margaret Bourke-White (1904-1971) is exactly the type of book teachers and parents of adolescent girls are looking for. It would be a mistake to treat this as a book for girls only, however, when so many great men--Bourke-White's father, her second husband, several darkroom technicians, and even General Jimmy Doolittle, commander of the 12th Air Force in World War II--figure prominently in it as mentors, teachers, colleagues, and friends. Author Susan Goldman Rubin gracefully deals with sensitive material such as the photographer's shame at discovering that her father was Jewish. And she does a remarkable job of choosing appropriate pictures. As the chief photographer for Life magazine, Bourke-White shot many hugely important but often harsh subjects. Rubin deftly edits these images so that famous photos like the haunting Living Dead of Buchenwald, April, 1945 are here, but not such profoundly disturbing ones as Bourke-White's shot of bony corpses stacked for burning. The author underscores the photographer's extraordinary self-confidence as a young woman of huge ambitions and--beginning with Bourke-White's initial flirtation with the soft-focus style of Edward Steichen--delineates the growing power and clarity of her mature documentary style. Bourke-White's life-long interest in science--she kept jars of multilegged fauna on her office bookshelves at Life--is fascinating, and the stories of her wartime adventures--in marooned life rafts, low-flying reconnaissance planes, and torpedoed ships--are frighteningly vivid.\nThe photographs themselves are ultimately given pride of place, in large duotone reproductions that do them ample justice. This book would be right for anyone over 10, and older readers might go on to Sean Callahan's Margaret Bourke-White: Photographer, which is more of a traditional monograph and includes those images that tell truths so painful that Bourke-White herself had great difficulty sorting their negatives. --Peggy Moorman","torrent":{"xt":"urn:btih:5209e515f6afacbd5531935b416a831f3430920d","amp;dn":"Margaret+Bourke-White+-+Her+pictures+were+her+life+%28Photography+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5209e515f6afacbd5531935b416a831f3430920d","infoHashBuffer":{"type":"Buffer","data":[82,9,229,21,246,175,172,189,85,49,147,91,65,106,131,31,52,48,146,13]},"announce":[],"urlList":[]}}