{"title":"Just Because- The Story of Salvation for Children {Z00Z33} {epub","uid":10987544,"size":3103314,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:521b1d9fa2aff3965dd0e8e7569f31cfa22f0903&amp;dn=Just+Because-+The+Story+of+Salvation+for+Children+%7BZ00Z33%7D+%7Bepub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zoozee300","files":3,"time":1409939833,"description":"[color=purple]Author-Steve Copland[/color]\n\n[color=blue]About the book from the Author:-[/color]\n\n[color=red]Paperback: 224 pages\nPublisher: Xulon Press (October 3, 2007)\nLanguage: English\nISBN-10: 1602669163\nISBN-13: 978-1602669161[/color]\n\n[color=green]Just Because takes children on a journey through the Bible. It gives them an exciting bird's-eye-view of God's plan unfolding as He prepares the world for the coming of Jesus Christ. Throughout the story Satan is watching out for the child who will &quot;crush his head,&quot; (Genesis 3) and he endeavors to stop God's plan from unfolding. The reader knows who that special child is, and the story especially opens up the insights that point to Jesus throughout the Old Testament, such as the symbols of Passover and prophecies. Each chapter takes about twenty minutes to read and ends with a short Biblical lesson. Just Because was originally written to be read to un-churched children in secular schools about twenty years ago. Since then teachers in New Zealand, Australia, and Cuba have used it to grow, and deepen children's faith in Jesus Christ and the Bible. Kids love it. Steve Copland is a self-supported missionary from New Zealand, serving The Lord in Ukraine for the past five years. He lectures on Systematic Theology and Church History at the Ukraine Evangelical Seminary, and also Biblical Studies at the International Christian University in Kiev. He is the director of the Mission Ukraine Language School, a charitable organization, and is extensively involved in student ministries and apologetics.[/color]\n\n[color=purple]IF YOU LIKE IT THEN SAY THANK YOU:):)\nPLEASE CONTINUOUS TO SEED AS MUCH AS POSSIBLE.Thank you:):)[/color]","torrent":{"xt":"urn:btih:521b1d9fa2aff3965dd0e8e7569f31cfa22f0903","amp;dn":"Just+Because-+The+Story+of+Salvation+for+Children+%7BZ00Z33%7D+%7Bepub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"521b1d9fa2aff3965dd0e8e7569f31cfa22f0903","infoHashBuffer":{"type":"Buffer","data":[82,27,29,159,162,175,243,150,93,208,232,231,86,159,49,207,162,47,9,3]},"announce":[],"urlList":[]}}