{"title":"Jason Starr - The Pack","uid":8230169,"size":1299925,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:54952ad85a7f8d75e6e0f941b9824833d60ad34a&amp;dn=Jason+Starr+-+The+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"geo358","files":4,"time":1362709092,"description":"epub and mobi\n\n&quot;Jason Starr is hypnotically good.&quot; -Lee Child \n\n\n\nWhen Simon Burns is fired from his job without warning, he takes on the role of stay-at-home dad for his three-year-old son. But his reluctance pushes his already strained marriage to the limit. In the nestled playgrounds of the Upper West Side, Simon harbors a simmering rage at his boss's betrayal. \n\nThings take a turn when he meets a tight-knit trio of dads at the playground. They are different from other men Simon has met, stronger and more confident, more at ease with the darker side of life- and soon Simon is lured into their mix. But after a guys' night out gets frighteningly out of hand, Simon feels himself sliding into a new nightmarish reality. \n\nAs he experiences disturbing changes in his body and his perceptions, he starts to suspect that when the guys welcomed him to their &quot;pack,&quot; they were talking about much more than male bonding. And as he falls prey to his basest instincts, Simon must accept that werewolves exist if he is to turn the tides of his fortune..","torrent":{"xt":"urn:btih:54952ad85a7f8d75e6e0f941b9824833d60ad34a","amp;dn":"Jason+Starr+-+The+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54952ad85a7f8d75e6e0f941b9824833d60ad34a","infoHashBuffer":{"type":"Buffer","data":[84,149,42,216,90,127,141,117,230,224,249,65,185,130,72,51,214,10,211,74]},"announce":[],"urlList":[]}}