{"title":"Terraria v1.3.0.3-MERCS213","uid":12085013,"size":90361600,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:55e98643ab1328eaeb47c5443f3449e5d00131d5&amp;dn=Terraria+v1.3.0.3-MERCS213&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mercs215","files":1,"time":1435876912,"description":"Install instructions:\n1. Download and unzip \n2. Run &quot;StartTerraria.exe&quot;\n3. Play\n\nChange log:\n\nFeatures:\nWhen using leftshift on inventory while in shop, you now have an indicator that you're selling items\nYou can now quickly move items between your chest and the inventory by using leftshift\nStardust Guardian is now dyable with your vanity pet dye (have some creative fun!)\nAreas you have not seen will now be black in camera mode\nAdded 'Highlight New Items' General Settings Option, on by default: Highlights any new item you pick up in your inventory\nDuct-taped multiplayer for good luck and stability*\nYou should now have an easier time reporting errors if they happen on a server\nThe final bosses leech debuff has been overhauled... (spoilers)\nYou can no longer put torches on tiles you are not supposed to (metal bars, etc)\nOld and corrupt worlds will now display on the world list marked with a red name.\nIncreased Martian's drone health to 500.\n\nNew config options:\nAdded Config.json setting &quot;UseSmartWallReplacement&quot;, on by default, if you set it off: automatic wall replacement while building will be disabled\nAdded Config.json setting &quot;UseSmartCursorForCommonBlocks&quot;, off by default, if you set this on: 1.2.4's smart block placement will be re-enabled\nAdded Config.json setting &quot;DisableLeftShiftTrashCan&quot;, off by default, if you set this on: Quicktrash will be ENTIRELY disabled\nAdded Config.json setting &quot;HidePasswords&quot;, off by default, if you set this on: all passwords in the client will appear as Asterisks (*)\nAdded Config.json setting &quot;ThickMouseEdges&quot;, off by default, if you set this on: your mouse will have thick borders colored by &quot;ThickMouseEdgesPackedCOlor&quot;'s color\n\nBug Fixes:\nFixed 'event' achievements not being granted in multiplayer (&quot;You can do it!&quot;, &quot;It's Hard!&quot;, &quot;No Hobo&quot; and so on)\nFixed Truffle worm not spawning\nFixed 'Funkytown' achievement will no longer be granted after respawning from death in the glowing mushroom biome.\nFixed Gypsy Robe bottoms being genderbent.\nFixed Daybreak's, Stardust Dragon and Stardust Cell Staff's gold values\nFixed some server crashes (portals, lunar shields)\nFixed numerous attack forms not being synced server-side (unicorn mount, slime mount, solar dash, EoC dash, etc)\nFixed achievements menu slider bar hanging on top of screen if all filters are disabled\nFixed Armed Eskimo Zombies not dropping their proper gore\nFixed bug where traps could critically hit\nFixed issue where banners could be placed on closed trap doors\nFixed Quickstack stacking items of max stack 1 and quick stacking coins from your inventory\nFixed Quickstack eating coins\nFixed crash in LookForColorTiles\nFixed excessive net synchronization on some cases\nFixed Team Dye not stacking correctly\nFixed crash when saving old worlds\nFixed issue where banning was ineffective (including ports...)\nFixed Loki's dye missing the common developer's tooltip\nFixed Staff of Regrowth Moss growing feature not working in multiplayer\nFixed channelled weapons being halted from use when you hover over information icons\nFixed Phantasm arrows exploit allowing you to get more arrows than you use\nFixed Horseman's blade not summoning pumpkins against Lunar invasion enemies\nFixed dupe bug with Item Frames\nFixed bug where you couldn't remove an item from the Item Frame if you had a favorite item selected\nFixed bug where Config.json's &quot;FrameSkip&quot; was written in reverse compared to ingame\nFixed Nymph not having rarity on Lifeform Analyzer\nFixed Srollers dealing unintentionally high damage\nFixed Developer armor wings gold costs\nFixed Frozen Campfire showing Ichor Campfire icon when aimed on the rightmost tile\nFixed Bee gun being unable to critically hit\nFixed Torch dupe bug\nFixed numerous desync issues in multiplayer\nFixed an issue where world and player names containing various characters would causes crashes and strange behavior when using cloud saving and favoriting.\nFixed an issue where corrupt configuration files would cause crashes.\nFixed an issue where you could invite players to your previous game while in single player.\nFixed an issue where joining a game from outside of the game would cause an uncancellable joining screen to display.\nFixed an issue where the password box would sometimes not show up.\nSetting your resolution while in fullscreen mode will now apply correctly.\nFixed numerous potential multiplayer exploits\nFixed issue where players could hack themselves &quot;difficulty 3&quot;","torrent":{"xt":"urn:btih:55e98643ab1328eaeb47c5443f3449e5d00131d5","amp;dn":"Terraria+v1.3.0.3-MERCS213","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55e98643ab1328eaeb47c5443f3449e5d00131d5","infoHashBuffer":{"type":"Buffer","data":[85,233,134,67,171,19,40,234,235,71,197,68,63,52,73,229,208,1,49,213]},"announce":[],"urlList":[]}}