{"title":"EnigmaT Set Rips { Cuts } - October 9th, 2014","uid":11179292,"size":2107634870,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5775490a57b2584d5e4b59cd286f94558306c250&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+9th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":277,"time":1412838050,"description":"Above &amp; Beyond feat. Hannah Thomas - Home (SoundLift Intro Edit) (Cut From Uplift Set)-enTc\nAdam Ellis &amp; Neev Kennedy - Reason To Believe (Cut From Saux Set)-enTc\nAdam Nickey - It's Alright (Cut From Nickey Set)-enTc\nAIMES - Give It To Me (Original Mix) (Cut From Armada Set)-enTc\nAimoon - Raindrops (Photographer Remix) (Cut From Ronski Set)-enTc\nAirscape - Manami's Theme (Stereojackers vs. Mark Loverush Remix) (Cut From Bobina Set)-enTc\nAlex M.O.R.P.H. and Max Freegrant - 1ne (Club Mix) (Cut From MORPH Set)-enTc\nAlex Tasty feat.Victoria Ray - Under My Skin (Nab Brothers Remix) (Cut From Tasev Set)-enTc\nAllen Watts - Recharge (Cut 2 From Uplift Set)-enTc\nAllen Watts - Recharge (Cut From Uplift Set)-enTc\nAngel Ace - Aura (Astuni Re-Lift) (Cut From Above Clouds Set)-enTc\nAngry Man &amp; Second Sine - Neurotoxin (Original Mix) (Cut From Sherry Set)-enTc\nARS - ID (Cut From Abstract Vision Set)-enTc\nBarrie Birse - The Beginning (Cut From Kearney Set)-enTc\nBart Claessen - Donk (Cut From Claessen Set)-enTc\nBassjackers - Savior (Cut From W&amp;W Set)-enTc\nBluskay &amp; Keyplayer - Melancholia (Cut From Uplift Set)-enTc\nBluSkay &amp; KeyPlayer - Melancholia (Kinetica Remix) (Cut From Abstract Vision Set)-enTc\nBobby Rock - Diablo (Cut From Tritonal Set)-enTc\nByjon - Thrive (Original Mix) (Cut From GO Set)-enTc\nCash Cash - Surrender (Tritonal Remix) (Cut From Tritonal Set)-enTc\nCharli XCX - Boom Clap (Marcus Schossow Remix) (Cut From W&amp;W Set)-enTc\nCiaran McAuley - It Doesn't Rain Forever (Giuseppe Ottaviani Remix) (Cut From A&amp;F Set)-enTc\nDada Life - Freaks Have More Fun (Cut From Claessen Set)-enTc\nDaddys Groove - Pulse (Benny Benassi Remix) (Cut From Gold Set)-enTc\nDamian Wasse &amp; Pavel Zhuravlev - I Miss You (Cut From Defcon Set)-enTc\nDamian Wasse - Say Goodbye (Original Mix) (Cut From GO Set)-enTc\nDamian Wasse vs Pavel Zhuravlev - I Miss You (Club Mix) (Cut From Lazarus Set)-enTc\nDan Dobson - Overboard (Cut From Abstract Vision Set)-enTc\nDan Sieg feat. Illuminor - No Way Back Up (-WEBRIP-)-enTc\nDaniel Skyver - Only You (Dreamy Energetic Remix) (Cut From Above Clouds Set)-enTc\nDave The Drummer &amp; Chris Liberator - One Night In Hackney (Chicago Loop's Monster Warehouse Remix) (Set Rip)-enTc\nDimension - Canido (Cut From Nickey Set)-enTc\nDon Diablo - Back To Life (Cut From W&amp;W Set)-enTc\nDubvision &amp; Feenixpawl feat. Joe Gill - Destination (Cut From W&amp;W Set)-enTc\nFloE - Timezone (Denis Sender Remix) (Cut From Anna Lee Set)-enTc\nFrancesco Yates - Call (Quilinez Remix) (Cut From Page Set)-enTc\nGabriel Ananda - Smash (Rob Hes &amp; Mark Mywords &amp; Noraj Cue Remix) (Cut From Jong Set)-enTc\nGene Karz &amp; Maller - Tronic (Original Mix) (Cut From Sherry Set)-enTc\nIrregular Synth - Rum &amp; Drum (Christian Cambas Remix) (Cut From Kearney Set)-enTc\nJ.S.B. Feat. Veronika Bows - The Last Night With You (Original Mix) (Cut From Airtech Set)-enTc\nJallen - Moments (Cut From Ronski Set)-enTc\nJames Dymond &amp; Harmonic Rush - Dymond Rush (Cut From Bobina Set)-enTc\nJames Rigby - Night Owl (Cut From Kearney Set)-enTc\nJenaux - Saints (Cut From W&amp;W Set)-enTc\nJewelz &amp; Sparks - Phantom (Cut From Claessen Set)-enTc\nJohn Dahlback feat. Melanie Fontana - Fireflies (Reunify Remix) (Cut From Tritonal Set)-enTc\nJonathan Carvajal - Ten (Vlind Remix) (Cut From Sty Set)-enTc\nJustin Prime - Fairchild (Cut From Page Set)-enTc\nK90 - Breathe (Phil Reynolds &amp; Blake Remix) (Cut From Van Doe Set)-enTc\nKlauss Goulart feat. Vegas - Young, Wild &amp; Free (Cut From Bobina Set)-enTc\nLovechild - Liberta (Kinetica &amp; Ross Anderson Remake) (Cut From Lazarus Set)-enTc\nMadwave - Pleasure (Frank Dueffel Remix) (Cut From Tayle Set)-enTc\nMagicSense - Adagia (French Skies Remix) (Cut From Airtech Set)-enTc\nMarcel Kenenberg - Watchman (Cut From Uplift Set)-enTc\nMark Greene - Call It Badness (Alex Di Stefano Remix) (Cut From Kearney Set)-enTc\nMarnik - Gladiators (Cut From W&amp;W Set)-enTc\nMason - Exceeder (Corderoy Remix) (Cut From MORPH Set)-enTc\nMason - Exceeder (UMEK &amp; Mike Vale Remix) (Cut From W&amp;W Set)-enTc\nMhammed El Alami - Serenity (French Skies Remix) (Cut From Sty Set)-enTc\nMhammed El Alami - Serenity (Original Mix) (Cut From Above Clouds Set)-enTc\nMhammed El Alami - Serenity (Outer Space Remix) (Cut From Tero A Set)-enTc\nMichael Woods feat. Lauren Dyson - In Your Arms (Out Of Office Remix) (Cut From Gold Set)-enTc\nMitchell Claxton - Dive (Cam Heathman Remix) (Cut From Lazarus Set)-enTc\nMonogato - ID (Cut From W&amp;W Set)-enTc\nMultiplayers &amp; Edhim - Here We Go Again (Cut From Page Set)-enTc\nMyon &amp; Shane feat. Kyler England - Summer of Love (Vigel Remix) (Cut From Bobina Set)-enTc\nNicky Romero &amp; Anouk - Feet On The Ground (Merk &amp; Kremont Remix) (Cut From W&amp;W Set)-enTc\nNicky Romero &amp; Vicetone - Let Me Feel (feat. When We Are Wild) (Cut From Tritonal Set)-enTc\nNikolauss - Skyline (Sebastian Brushwood Remix) (Cut From Uplift Set)-enTc\nNilson feat. John Harris - Let It Out (Cut From Tritonal Set)-enTc\nNoel Sanger - RVVLSM (Morttagua Club Mix) (Cut From Defcon Set)-enTc\nNoizy Boy - Mental Minds (Cut From Lynam Set)-enTc\nNomad &amp; Wragg - PTP (Pull The Plug) (Cut From Lynam Set)-enTc\nNu NRG - Freefall (Astuni Re-Lift) (Cut From Saux Set)-enTc\nOldfix - Miracles (Strings Melodies Remix) (Cut From Sty Set)-enTc\nOliver &amp; Tom - Carvalho (Truenorth Dark303Dub Remix) (Cut From Above Clouds Set)-enTc\nOliver &amp; Tom - Carvalho (Truenorth Dark303Dub Remix) (Cut From Tero A Set)-enTc\nOutside The Bounds - Pseudopodia (Neorise Remix) (Cut From Nickey Set)-enTc\nPeter Santos - Under The Same Sky (Cut From A&amp;F Set)-enTc\nPhilip Overdrifter - Focus (Mike van Fabio Remix) (Cut From Saux Set)-enTc\nPsymfonius - Extatic (Mike Sanders Remix) (Cut From Sty Set)-enTc\nPurple Stories - Pandorum (Soren Andrews Bootleg) (Cut From Sherry Set)-enTc\nRagevision - By Your Side (Raphael Mayers Remix) (Cut From Jerom Set)-enTc\nRain City Riot - Chances (Original Mix) (Cut From Armada Set)-enTc\nRawad Saab - Winter Rain (Original Mix) (-WEBRIP-)-enTc\nRich TriPhonic &amp; Jesper Olesen - Olivia (Johan Ekman Remix) (Cut From Above Clouds Set)-enTc\nRich Triphonic &amp; Jesper olesen - Olivia (Johan Ekman Remix) (Cut From Van Doe Set)-enTc\nRich TriPhonic &amp; Jesper Olesen - Olivia (Original Mix) (Cut From Anna Lee Set)-enTc\nRoger Shah &amp; Sied Van Riel feat. Jennifer Rene - Without You (Ron Alperin Remix) (Cut From Bobina Set)-enTc\nRoger Shah &amp; Sied Van Riel featuring Jen Rene - Without You (Ron Alperin Remix) (Cut From GO Set)-enTc\nRonski Speed - Sipoc (Steve Nyman Remix) (Cut From Saux Set)-enTc\nSava - The Journey (Original Mix) (Cut From Above Clouds Set)-enTc\nSean Mathews - Promised Land (Mobil Remix) (Cut From Anna Lee Set)-enTc\nSHato &amp; Paul Rockseek feat. Alex Humphreys - Chasing Aeroplanes (Eddie Bitar Remix) (-WEBRIP-)-enTc\nSky Sound - Stairway To Heaven (Mhammed El Alami Remix) (Cut From Tero A Set)-enTc\nSomna &amp; Jennifer Rene - Because You're Here (Cut From GO Set)-enTc\nSpeed Limits - A380 (Cut From Claessen Set)-enTc\nSpeed Limits - A380 (Original Mix) (-WEBRIP-)-enTc\nThomas Gold feat. Kate Elsworth - Colourblind (Cut From W&amp;W Set)-enTc\nThomas Gold feat. Kate Elsworth - Colourblind (Original Mix) (Cut From Gold Set)-enTc\nThree Drives - Summer Madness (Miss Bo Remix) (Cut From Fonarev Set)-enTc\nThree Faces &amp; Christian Zechner - Lost in Time (UltraNova Remix) (Cut From Popov Set)-enTc\nTilt - Butterfly (Adam White Remix) (Cut From Jamie Bell Set)-enTc\nTuneflux - Remains (Cut From Uplift Set)-enTc\nTycho - See (Beacon Remix) (Cut From Jong Set)-enTc\nVida - Atlantis (Cut From Tritonal Set)-enTc\nYears - Change (Original Mix) (Cut From Armada Set)-enTc\nZahir - Celestial (Mode Pelar Remix) (Cut From Above Clouds Set)-enTc\nZahir - Celestial (Original Mix) (Cut From Shadows Set)-enTc","torrent":{"xt":"urn:btih:5775490a57b2584d5e4b59cd286f94558306c250","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+9th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5775490a57b2584d5e4b59cd286f94558306c250","infoHashBuffer":{"type":"Buffer","data":[87,117,73,10,87,178,88,77,94,75,89,205,40,111,148,85,131,6,194,80]},"announce":[],"urlList":[]}}