{"title":"Hot Rod City","uid":9823507,"size":301947070,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5777826d13d8ce73fca01b18b6bb8ff46ae2d772&amp;dn=Hot+Rod+City&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lancestevens","files":37,"time":1395731020,"description":"The story behind this 1963 hot rod compilation-exploitation album is rather complicated. Issued at the height of the craze, Vault Records (most famous as the home of the Challengers) wanted to get something on the racks post-haste. Gary Usher was enlisted as co-producer, working with Challengers drummer Richard Delvy. the Challengers played on much of the album, but to foster the illusion that this was a compilation, the tracks were attributed to various bands (the Challengers, the Grand Prix, the Quads, and the Customs). Usher also helped write many of the tunes, all of which had something to do with cars, or racing cars. It's not really worth debating whether (as some have claimed, ridiculously) this is one of rock's first &quot;concept&quot; albums. It's slight, hastily conceived, generic hot rod music, laps behind the Beach Boys and Jan &amp; Dean's efforts in the field, of interest only to hardcore fans and collectors of the style. The CD reissue adds rare bonus tracks of previously unissued cuts, a B-side, and alternate takes, which is really treating this relic with more respect than it deserves. Brian Wilson obsessives may want to be aware of one of those previously unissued tracks, &quot;She Rides with Me,&quot; which Wilson co-wrote with Roger Christian. \n\n","torrent":{"xt":"urn:btih:5777826d13d8ce73fca01b18b6bb8ff46ae2d772","amp;dn":"Hot+Rod+City","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5777826d13d8ce73fca01b18b6bb8ff46ae2d772","infoHashBuffer":{"type":"Buffer","data":[87,119,130,109,19,216,206,115,252,160,27,24,182,187,143,244,106,226,215,114]},"announce":[],"urlList":[]}}