{"title":"Midway Arcade Treasures 3 [NTSC], PS2","uid":7015194,"size":1429667231,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:57ec451246ca7a041e88571ae4f8492e29414683&amp;dn=Midway+Arcade+Treasures+3+%5BNTSC%5D%2C+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1328625242,"description":"Midway Arcade Treasures 3 for the Ps2                               Rel. 09/26/2005\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         ISO\nGenre.:        RPG\nRating:        TEEN\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method.\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\n\nGame Description:\n\nMidway Arcade Treasures 3 for the PS2 is a solid emulation pack that steers the classic compilation in a new direction. This installment features 8 classic arcade racing games ranging from earlier classics such as STUN Runner and Race Drivin' to newer releases like Hydro Thunder and San Francisco Rush: The Rock. Each game has been emulated faithfully, and they look and play as they should, for the most part. There are a few minor glitches and frame rate issues, but nothing significant. Most of the games in this package hold up well, with some of the earlier games retaining a nostalgic charm. Join us as we accelerate into the past with these classic games on a race down memory lane.\n\nSetting up a classic gaming collection with a themed structure is a risky approach, with most of these compilation discs offering an eclectic lineup of titles from different years and eras. Bucking the trend, Midway Arcade Treasures 3 for the PS2 offers a solid lineup of eight entertaining racing titles from the past 15 years or so. For the most part, the games on MAT3 have a more contemporary feel than most of the classic game usually found on the disc. Some of them were released as little as 5 years ago, while others stretch back to the late 80's. Most of the games on the disc were also quite popular with gamers, and these well-known brands like Rush and Hydro Thunder should appeal to a wider audience than the obscurities that populate most of these discs. However, there are several lesser-known gems like Badlands and Race Drivin' included, which should please devoted classic gamers.\n\n\nFeatures:\n\n* San Francisco Rush: The Rock Alcatraz Edition\n* Hydro Thunder\n* Super Off Road\n* Badlands\n* Race Drivin'\n* S.T.U.N. Runner\n* San Francisco Rush 2049\n* Off Road Thunder\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:57ec451246ca7a041e88571ae4f8492e29414683","amp;dn":"Midway+Arcade+Treasures+3+%5BNTSC%5D%2C+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57ec451246ca7a041e88571ae4f8492e29414683","infoHashBuffer":{"type":"Buffer","data":[87,236,69,18,70,202,122,4,30,136,87,26,228,248,73,46,41,65,70,131]},"announce":[],"urlList":[]}}