{"title":"Natural and Synthetic Biomedical Polymers (gnv64)","uid":9632026,"size":64647842,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:581be229d2cbf000c61da024b8f0a5e7cd55cd80&amp;dn=Natural+and+Synthetic+Biomedical+Polymers+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1392799566,"description":"Natural and Synthetic Biomedical Polymers\nby Sangamesh Kumbar, Cato Laurencin MD PhD and Meng Deng \nElsevier Science | February 2014 | ISBN-10: 0123969832 | PDF | 420 pages | 61.6 mb\n\nPolymers are important and attractive biomaterials for researchers and clinical applications due to the ease of tailoring their chemical, physical and biological properties for target devices. Due to this versatility they are rapidly replacing other classes of biomaterials such as ceramics or metals. As a result, the demand for biomedical polymers has grown exponentially and supports a diverse and highly monetized research community. Currently worth $1.2bn in 2009 (up from $650m in 2000), biomedical polymers are expected to achieve a CAGR of 9.8% until 2015, supporting a current research community of approximately 28,000+.\nSummarizing the main advances in biopolymer development of the last decades, this work systematically covers both the physical science and biomedical engineering of the multidisciplinary field. Coverage extends across synthesis, characterization, design consideration and biomedical applications. The work supports scientists researching the formulation of novel polymers with desirable physical, chemical, biological, biomechanical and degradation properties for specific targeted biomedical applications.\n-    Combines chemistry, biology and engineering for expert and appropriate integration of design and engineering of polymeric biomaterials\n-    Physical, chemical, biological, biomechanical and degradation properties alongside currently deployed clinical applications of specific biomaterials aids use as single source reference on field.\n-    15+ case studies provides in-depth analysis of currently used polymeric biomaterials, aiding design considerations for the future\n\nAbout the Author\nDr. Laurencin is the Van Dusen Distinguished Endowed Professor of Orthopaedic Surgery, and Professor of Chemical, Materials, and Biomedical Engineering at the University of Connecticut. In addition, Dr. Laurencin is a University Professor at the University of Connecticut (the 7th in the institution's history). He is the Director of both the Institute for Regenerative Engineering, and the Raymond and Beverly Sackler Center at the University of Connecticut Health Center. Dr. Laurencin serves as the Chief Executive Officer of the Connecticut Institute for Clinical and Translational Science at UCONN.","torrent":{"xt":"urn:btih:581be229d2cbf000c61da024b8f0a5e7cd55cd80","amp;dn":"Natural+and+Synthetic+Biomedical+Polymers+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"581be229d2cbf000c61da024b8f0a5e7cd55cd80","infoHashBuffer":{"type":"Buffer","data":[88,27,226,41,210,203,240,0,198,29,160,36,184,240,165,231,205,85,205,128]},"announce":[],"urlList":[]}}