{"title":"Kelly Osbourne - Papa Don't Preach  (2nafish)","uid":5367576,"size":131815428,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:584e93cd2c20b4767ad88bd537660f99e0b9e2b9&amp;dn=Kelly+Osbourne+-+Papa+Don%5C%27t+Preach++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1266318763,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nKelly Osbourne - Papa Don't Preach (Original TV Soundtrack: The Osbournes)(2nafish)\n\nNote: This video is a &quot;Movies &amp; Music&quot; video so it has 2 logos.\n\n\n&quot;Papa Don't Preach&quot; has been covered by numerous artists. In 2002, British singer Kelly Osbourne recorded together with Incubus' members Mike Einziger (guitar), and Jose Pasillas (drums), a hard-rock cover of the song that was produced by her brother Jack Osbourne. It was included as a bonus track on her debut album Shut Up and on the soundtrack of MTV's reality television program The Osbournes. The song was released in the United Kingdom on September 2002, peaking at number three. In the rest of Europe, the song peaked inside the top ten in Ireland and Finland, and the top twenty in Sweden. In Australia the song debuted at number three, and received a platinum certification by the Australian Recording Industry Association (ARIA). This version was panned by music critics, who thought that the cover &quot;makes precisely zero sense&quot;, and that it &quot;reeks of opportunism&quot;, also criticizing Incubus' collaboration, describing it as &quot;unimaginative&quot;, and that &quot;their presence makes the whole mess barely distinguishable&quot;.\n\nShut Up is the debut album of Kelly Osbourne. Later in 2003, Kelly released another CD including all of this CD's tracks plus her and her father Ozzy's cover of the Black Sabbath song &quot;Changes&quot;.\n\nKelly Michelle Lee Osbourne (born 27 October 1984) is an English media personality, fashion designer, singer, actress and model, known for being the daughter of Ozzy and Sharon Osbourne. She was thrust into the limelight after appearing on reality series The Osbournes with her family, for which they won a 2002 Emmy award for Outstanding Reality Programme with her family. She has also appeared on the Dancing with the Stars, in which she and professional dance partner Louis van Amstel took third place, and made forays into music, acting, fashion, writing and radio presentation.\n\nHer debut album, Shut Up!, was released in 2002 to moderate American sales, but good European sales, which was debuted with Houston rock band Pure Rubbish at the 2002 MTV Movie Awards. Osbourne's 2002 debut with Epic Records, &quot;Shut Up!&quot;, debuted at #1 on Billboard's Heatseekers chart. The album was met with bad critical reviews and, by May 2003, Osbourne was dropped from Epic Records. By autumn she was on the Sanctuary label, later recording a duet of &quot;Changes&quot; (a Black Sabbath song) with her father. The duet hit #1 on the UK charts. Changes was one of a few tracks to have fallen down the charts (From 1 - 3) whilst selling more copies than the week it reached number 1. Osbourne was the first artist to top all three of the Billboard charts dance surveys in the same week with the &quot;Chris Cox Club Remix&quot; of &quot;One Word&quot;. The album &quot;Sleeping In The Nothing&quot; was not without controversy, due to its reportedly heavily-altered album cover, in which Osbourne appeared slimmer, despite her previous assertions of being happy with her size.\n\nDuring an interview in late 2005, Osbourne denied reports she was ending her music career, saying: &quot;I don't know where the quit rumours came from - I've just recorded a version of &quot;Girls Just Want to Have Fun&quot; with Cyndi Lauper&quot;.\n\nOsbourne was forced to back out of her final performance in West End musical Chicago after the 31 October 2007 incident that injured her back. She later went on to win theatre actress of the year at the glamour awards in the UK. On the same night, she attended the Sony Radio Academy Awards, where she was nominated for the Rising Star Award, which she did not win.\n\nOsbourne wants to get back in the studio and work on her third studio album. Her previous album was released four years ago, and she said that after taking a break from music, she wants to do it right this time. On her twitter page, Kelly wrote that she had just finished a track she was working on in her fathers studio, she describes it as sounding very 1990s, she wants to start working on new tracks with Scottish DJ Calvin Harris and has revealed she is working on a collaboration with a mystery pop star, her new musical direction is a more gentler sound than her first record &quot;Shut Up/Changes&quot;, but is still reminiscent of her second electronic sounding LP &quot;Sleeping in the nothing. She hasn't yet confirmed details of a new record or release dates.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:584e93cd2c20b4767ad88bd537660f99e0b9e2b9","amp;dn":"Kelly+Osbourne+-+Papa+Don%5C%27t+Preach++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"584e93cd2c20b4767ad88bd537660f99e0b9e2b9","infoHashBuffer":{"type":"Buffer","data":[88,78,147,205,44,32,180,118,122,216,139,213,55,102,15,153,224,185,226,185]},"announce":[],"urlList":[]}}