{"title":"Disposable Futures: The Seduction of Violence in the Age of Spec","uid":12485912,"size":713475,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:589c8c30343fa291928c67324cfd91b07f1ccec6&amp;dn=Disposable+Futures%3A+The+Seduction+of+Violence+in+the+Age+of+Spec&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Abee","files":2,"time":1443102639,"description":"Disposable Futures: The Seduction of Violence in the Age of Spectacle by Brad Evans  (Author), Henry A. Giroux\r\n \nhttp://i.imgur.com/Vc8O96f.jpg\r\n\r\nDisposable Futures makes the case that we have not just become desensitized to violence, but rather, that we are being taught to desire it.\r\n\r\nFrom movies and other commercial entertainment to &quot;extreme&quot; weather and acts of terror, authors Brad Evans and Henry Giroux examine how a contemporary politics of spectacle--and disposability--curates what is seen and what is not, what is represented and what is ignored, and ultimately, whose lives matter and whose do not.\r\n\r\nDisposable Futures explores the connections between a range of contemporary phenomena: mass surveillance, the militarization of police, the impact of violence in film and video games, increasing disparities in wealth, and representations of ISIS and the ongoing terror wars. Throughout, Evans and Giroux champion the significance of public education, social movements and ideas that rebel against the status quo in order render violence intolerable.\r\n\r\n&quot;Disposable Futures poses, and answers, the pressing question of our times: How is it that in this post-Fascist, post-Cold War era of peace and prosperity we are saddled with more war, violence, inequality and poverty than ever? The neoliberal era, Evans and Giroux brilliantly reveal, is defined by violence, by drone strikes, 'smart' bombs, militarized police, Black lives taken, prison expansion, corporatized education, surveillance, the raw violence of racism, patriarchy, starvation and want. The authors show how the neoliberal regime normalizes violence, renders its victims disposable, commodifies the spectacle of relentless violence and sells it to us as entertainment, and tries to contain cultures of resistance. If you're not afraid of the truth in these dark times, then read this book. It is a beacon of light.&quot;--Robin D. G. Kelley, author of Freedom Dreams: The Black Radical Imagination\r\n\r\n&quot;Disposable Futures confronts a key conundrum of our times: How is it that, given the capacity and abundance of resources to address the critical needs of all, so many are having their futures radically discounted while the privileged few dramatically increase their wealth and power? Brad Evans and Henry Giroux have written a trenchant analysis of the logic of late capitalism that has rendered it normal to dispose of any who do not service the powerful. A searing indictment of the socio-technics of destruction and the decisions of their deployability. Anyone concerned with trying to comprehend these driving dynamics of our time would be well served by taking up this compelling book.&quot;--David Theo Goldberg, author of The Threat of Race: Reflections on Racial Neoliberalism\r\n\r\nBrad Evans and Henry A. Giroux are internationally renowned educators, authors, and intellectuals. Together, they curate a forum for Truthout.com that explores the theme of &quot;Disposable Futures.&quot; Evans is director of histories of violence project at the University of Bristol, United Kingdom. Giroux holds McMaster University Chair for Scholarship in the Public Interest, and is the Paulo Freire Distinguished Scholar in Critical Pedagogy.\r\n\r\nSeries: City Lights Open Media\r\nPaperback: 296 pages\r\nPublisher: City Lights Publishers (July 14, 2015)\r\nLanguage: English\r\nISBN-10: 0872866580\r\nISBN-13: 978-0872866584\r\n \nhttp://www.citylights.com/book/?GCOI=87286100745010","torrent":{"xt":"urn:btih:589c8c30343fa291928c67324cfd91b07f1ccec6","amp;dn":"Disposable+Futures%3A+The+Seduction+of+Violence+in+the+Age+of+Spec","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"589c8c30343fa291928c67324cfd91b07f1ccec6","infoHashBuffer":{"type":"Buffer","data":[88,156,140,48,52,63,162,145,146,140,103,50,76,253,145,176,127,28,206,198]},"announce":[],"urlList":[]}}