{"title":"Die Hard Vendetta [PAL/NTSC] [Multi 4], PS2","uid":7276826,"size":4948867382,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:58aba4cdb7ebec6a4d91e239da781e7329c3ee34&amp;dn=+Die+Hard+Vendetta+%5BPAL%2FNTSC%5D+%5BMulti+4%5D%2C+PS2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1337308462,"description":"Die Hard Vendetta for the Ps2                               Rel. 06/20/2003\n\n\nFormat:        DVD5 PAL &amp; NTSC\nLang.:         English, French, Spanish, Italian \nDiscs:         2\nImage:         ISO\nGenre.:        Action\nRating:        Mature\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method.\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nRelease Notes - Contains Orginal Pal, Plus an NTSC Patched Version for\n                the Rest of us. FMCB with esr and an emulator is included\n                if you need it. Will work on a modded or chipped ps2\n                console.\n\n\n\n\nGame Description:\n\nJohn McClane is back. Many years have passed since his work in New York, and he now works for the Century City Police Department (CCPD) in Los Angeles.\n\nYou are in John's shoes as he must face a new threat. Piet Gruber, the son of Hans Gruber and McClane's old enemy, is up to no good at the Townsend Art Museum. He has stolen valuable art and kidnapped John's now adult daughter and fellow CCPD police officer, Lucy.\n\nThis game is a First Person Shooter, but it also adds two features: Stealth Mode and Hero Time. Stealth Mode allows John to sneak around quietly, even being able to grab his foes and use them as hostages. This means it may not be best to go in guns blazing, when they could be arrested. Hero Time allows John to react far more quickly, just like Bullet Time in Max Payne. Hero Time is earned by saving hostages and performing heroic tasks in the game.\n\nThere are several different weapons available in the game, ranging from a paintball gun for training to a sniper rifle. Most of the guns can also be used dual for the ultimate killing spree.\n\n\n\nGame Pics Included.\n\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t\t","torrent":{"xt":"urn:btih:58aba4cdb7ebec6a4d91e239da781e7329c3ee34","amp;dn":"+Die+Hard+Vendetta+%5BPAL%2FNTSC%5D+%5BMulti+4%5D%2C+PS2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58aba4cdb7ebec6a4d91e239da781e7329c3ee34","infoHashBuffer":{"type":"Buffer","data":[88,171,164,205,183,235,236,106,77,145,226,57,218,120,30,115,41,195,238,52]},"announce":[],"urlList":[]}}