{"title":"The Intruder 1961 DvdRip Mp4 Lee1001","uid":9992219,"size":620672211,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5b366275001528c876aaa0b142dea8455ea8370b&amp;dn=The+Intruder+1961+DvdRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xultfoad","files":2,"time":1397864379,"description":"The Intruder 1961 DvdRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0055019/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0055019/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/The_Intruder_(1962_film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/The_Intruder_(1962_film)&lt;/a&gt;\nThe Intruder is an American film drama first released in 1961,directed by Roger Corman. The film stars William Shatner, Frank Maxwell, Beverly Lunsford, Robert Emhardt and Leo Gordon.\nThe Intruder is: very good, a genuinely well-made film that has many impressive qualities - a rewarding film that makes compelling viewing. \n\nMost of my familiarity with Roger Corman lies with his output as a producer of nil-budget genre pictures. Therefore, when I found out that William Shatner toplined a Corman-directed movie about racism in the American Deep South of the 1960s, I expected to experience a crass, even exploitative, story. Boy, I was dead wrong--and glad of it.\nContrary to prevailing assumptions about critics, we actually find it pleasantly surprising to be wrong, especially when a movie that was expected to be bad turns out to be great.\n\nRaw-edged and startling, scripted by Charles Beaumont from his own novel based on real-life rabble-rouser John Kasper, Corman's film about Southern desegregation was shot on location in Missouri in a mere three weeks, with threats and obstruction from white locals mirroring the fictional action. Adam Cramer (Shatner, mesmerising) represents an organisation which seeks to stop the process of educational desegregation and thus frustrate plans of the 'Communist front headed by Jews' to 'mongrelise' society. \n\nCramer is an insidious outsider whose impassioned speeches rouse the populace; the result is heightened Klu Klux Klan activity, attacks on black families and a liberal white newspaper editor, a near-hanging. Complex characterisation is sacrificed in the interests of representing the broad socio-political issues. Emotions intensify in accord with searing summer temperatures; visuals emphasise the economic disparities, memorably in shots of the black ghetto and of Cramer in his pristine white suit. Chilling, and especially at the moment Cramer delivers his battle-cry, 'This is just the beginning', painfully prophetic.\n\nVIDEO\nSize.... 591mb\nDuration.... 01:22:59\nCodec.... h264\nFrame Width..... 720\nFrame Height.... 352\nData Rate.... 881kbps\nFrame Rate.... 24F/S\nAUDIO\nBit Rate.... 107kbps\n2 Channel Stereo\nAudio Sample Rate.... 44KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:5b366275001528c876aaa0b142dea8455ea8370b","amp;dn":"The+Intruder+1961+DvdRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b366275001528c876aaa0b142dea8455ea8370b","infoHashBuffer":{"type":"Buffer","data":[91,54,98,117,0,21,40,200,118,170,160,177,66,222,168,69,94,168,55,11]},"announce":[],"urlList":[]}}