{"title":"Darryl Pinckney - Black Deutschland","uid":13692951,"size":1059901,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d332dd418c25c8faa60f09a343cdb757f8ab9c3&amp;dn=Darryl+Pinckney+-+Black+Deutschland&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mr_mando","files":2,"time":1456634078,"description":"Darryl Pinckney - Black Deutschland\r\n\r\nJed--young, gay, black, out of rehab and out of prospects in his hometown of Chicago--flees to the city of his fantasies, a museum of modernism and decadence: Berlin. The paradise that tyranny created, the subsidized city isolated behind the Berlin Wall, is where he's chosen to become the figure that he so admires, the black American expatriate. Newly sober and nostalgic for the Weimar days of Isherwood and Auden, Jed arrives to chase boys and to escape from what it means to be a black male in America.\r\nBut history, both personal and political, can't be avoided with time or distance. Whether it's the judgment of the cousin he grew up with and her husband's bourgeois German family, the lure of white wine in a down-and-out bar, a gang of racists looking for a brawl, or the ravaged visage of Rock Hudson flashing behind the face of every white boy he desperately longs for, the past never stays past even in faraway Berlin. In the age of Reagan and AIDS in a city on the verge of tearing down its walls, he clambers toward some semblance of adulthood amid the outcasts and expats, intellectuals and artists, queers and misfits. And, on occasion, the city keeps its Isherwood promises and the boy he kisses, incredibly, kisses him back.\r\nAn intoxicating, provocative novel of appetite, identity, and self-construction, Darryl Pinckney's Black Deutschland tells the story of an outsider, trapped between a painful past and a tenebrous future, in Europe's brightest and darkest city","torrent":{"xt":"urn:btih:5d332dd418c25c8faa60f09a343cdb757f8ab9c3","amp;dn":"Darryl+Pinckney+-+Black+Deutschland","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d332dd418c25c8faa60f09a343cdb757f8ab9c3","infoHashBuffer":{"type":"Buffer","data":[93,51,45,212,24,194,92,143,170,96,240,154,52,60,219,117,127,138,185,195]},"announce":[],"urlList":[]}}