{"title":"Naught 2 v1.0.0 Android","uid":9184795,"size":46833732,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:5d6c310a5da8813996c5a8d7075d659451214ca3&amp;dn=Naught+2+v1.0.0+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".BONE.","files":-1,"time":1384277530,"description":"Not only has Naught's world been completely redesigned to create more interactive and detailed environments, it includes new features that enhance the gameplay and reinvent platform game style. Game controls have been extensively improved while still offering two different options: accelerometer controls and virtual buttons. Naught is now characterized by procedural animations that allow him to adapt his movements to the surroundings by holding on to walls, modifying his way of walking depending on gravity and the ground surface, and pushing objects in a unique and dynamic fashion. Naught can also take advantage of new skills like jumping and diving to solve puzzles, avoid stalking creatures and fight dark monsters. Help Naught escape from darkness and recall his memories in hidden levels.\n\nIn this first release of Naught 2 you will find the full first chapter, which is made up of three zones, more than 30 levels that include 3 bonus levels, big enemies, diverse gameplay, time trial mode for every level and loads of secrets.\n\nBut that is not all. We are working on the second chapter of Naught 2, which will be available in an upcoming update and will be completely free for all the users that had purchased Naught 2 before that update. New levels, new enemies, more skills and many more secrets will be available very soon.\n\nRequired Android O/S : 3.2+","torrent":{"xt":"urn:btih:5d6c310a5da8813996c5a8d7075d659451214ca3","amp;dn":"Naught+2+v1.0.0+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d6c310a5da8813996c5a8d7075d659451214ca3","infoHashBuffer":{"type":"Buffer","data":[93,108,49,10,93,168,129,57,150,197,168,215,7,93,101,148,81,33,76,163]},"announce":[],"urlList":[]}}