{"title":"Doc Watson &amp; David Holt - Legacy 3xCD-BOX [320k-VBR-MP3]","uid":5784597,"size":373592527,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5dea09db0a0758683cf385969370e159cdcac582&amp;dn=Doc+Watson+%26+David+Holt+-+Legacy+3xCD-BOX+%5B320k-VBR-MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"frostyfreeze","files":54,"time":1282554992,"description":"greetings all -\n\nhere we have an excellent collection of very personal songs &amp; moments shared between Doc Watson &amp; David Holt - Doc is THEE man &amp; I know U will love this 1 !!\n\ni personally ripped these from the 3 original CD's into 320kbps VBR MP3's &amp; I must admit, they sound great in my various players.  i would have loved to scan the booklet for y'all but it's got 70+ pages in it and  dudes, I just ain't got that kind of time... ;)\n\ncomments &amp; uprates sincerely appreciated and please, ask questions before you say things that make me cry cause I love this shite... always seed, seed til your eye dem bleed !!\n\nplease remember the motto and be sure 2 seed, seed til your eye dem bleed !!\n\ncapitalism is an economic prison - wage slavery means we are ALL prisoners of our various economies - some are more adversely affected. help crush this amoral + inhuman system...\n\nmuch love, frosty\n\nplease feel free to check out my other fun filled torrents as well:  &lt;a href=&quot;\nhttp://thepiratebay.se/user/frostyfreeze/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/frostyfreeze/&lt;/a&gt;\n\n___________________________________________________________________________________\n\nWon the 2003 Grammy (45th Grammy Awards) for Best Traditional Folk Reording\n\nexerpt from http://www.docwatsonanddavidholt.com/ (lots of good stuff on this CD  here)- \n\nDoc Watson's inspiring life story and musical genius come alive in this three CD collector's edition. &quot;Legacy&quot; features a concert CD with Grammy-Award winners Doc Watson and David Holt and two CDs of songs and conversation looking back over Doc's 79 years in a revealing and entertaining portrait. A 72-page companion book is filled with historic family photos, additional interviews and stories. Over 34 songs are included. \n\nOn the first interview CD, Doc talks about his early years growing up blind in the mountains of North Carolina, doing everything the other kids did, from chopping wood to picking cherries in the tree tops. Hear about Doc's early musical influences, the songs his father taught him and how an old Victrola changed his life. \n\nOn the second interview CD, Doc looks back over his career, going from performing on the streets of Boone, NC to becoming a National Treasure and a multi Grammy-Award winner. \n\nOn CD number three Doc and David perform live in Asheville, NC. As Doc said, &quot;Everything came together for us that night.&quot; \n\nFor the extensive liner notes, David interviewed members of Doc's family, friends and fellow musicians, from Rosa Lee Watson to Joan Baez and Ry Cooder. Rare photos of Doc's parents, Doc as a young man, his cat-skin banjo and much more complete the beautifully designed booklet. High Windy Audio is proud to be passing Doc's phenomenal legacy on to you.\n___________________________________________________________________________________\n\nmore individual reviews and opportunities to purchase this from individual people for much less than $30 !? can be found here: \n &lt;a href=&quot;\nhttp://www.amazon.com/Legacy-Doc-Watson/dp/B000065DTI&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Legacy-Doc-Watson/dp/B000065DTI&lt;/a&gt;","torrent":{"xt":"urn:btih:5dea09db0a0758683cf385969370e159cdcac582","amp;dn":"Doc+Watson+%26+David+Holt+-+Legacy+3xCD-BOX+%5B320k-VBR-MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dea09db0a0758683cf385969370e159cdcac582","infoHashBuffer":{"type":"Buffer","data":[93,234,9,219,10,7,88,104,60,243,133,150,147,112,225,89,205,202,197,130]},"announce":[],"urlList":[]}}