{"title":"Little Willie John - The King Sessions 1958 60 - eac, flac, cove","uid":9495062,"size":507186550,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5ef4e74320ae43850e4f395ea20d744e0bf6fd3d&amp;dn=Little+Willie+John+-+The+King+Sessions+1958+60+-+eac%2C+flac%2C+cove&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"johnny39","files":38,"time":1390080444,"description":"Review by Richie Unterberger  [-]\n\n\nDuring the period covered by this compilation, Little Willie John was moving into more orchestrated, pop-oriented material and arrangements than he'd used on his initial mid-'50s R&amp;B hit singles for the King label. The change wasn't at all for the worse; he still put a lot of bluesy feeling into this form of blues-R&amp;B-pop-rock &amp; roll, getting his two biggest pop hits with &quot;Talk to Me, Talk to Me&quot; and &quot;Sleep.&quot; Both of those songs are on this CD, which actually covers both sides of all dozen singles those hits bracketed, though a couple (&quot;My Love-Is&quot; and &quot;Why Don't You Haul off and Love Me&quot;) are represented by previously unissued, more sparsely arranged takes without the overdubs used on the official 45 versions. While the general Little Willie John or R&amp;B/soul fan will likely be better off with an overall best-of that draws from only the best of these sides, this is an admirably thorough (and thoroughly annotated) collection of his work in the era. And it's not all orchestrated R&amp;B-pop by any means: he gets into a credible Little Richard bag on &quot;Do You Love Me,&quot; pretty hot classy jump blues on &quot;Spasms,&quot; a boppin' blues ballad on &quot;Heartbreak (It's Hurtin' Me),&quot; a great minor-keyed R&amp;B groove on &quot;I'm Shakin',&quot; and more straightforward rock &amp; roll on &quot;Leave My Kitten Alone,&quot; which would be covered by the Beatles in 1964 (though it remain an unreleased studio outtake until it was issued on Anthology 1 three decades later). Some of the less familiar orchestrated tunes are good too, though some aren't as memorable; some of the poppier ones veer close to Platters territory, and &quot;My Love-Is&quot; is uncomfortably close to a rewrite of his earlier hit &quot;Fever.&quot; It's also obvious from listening to this disc how influential this material in particular was on John's labelmate James Brown, who not only eventually recorded a tribute album to John, but also used a similar approach for his own more orchestrated ballads, such as &quot;Prisoner of Love&quot; and &quot;It's a Man's Man's Man's World.&quot; \n","torrent":{"xt":"urn:btih:5ef4e74320ae43850e4f395ea20d744e0bf6fd3d","amp;dn":"Little+Willie+John+-+The+King+Sessions+1958+60+-+eac%2C+flac%2C+cove","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ef4e74320ae43850e4f395ea20d744e0bf6fd3d","infoHashBuffer":{"type":"Buffer","data":[94,244,231,67,32,174,67,133,14,79,57,94,162,13,116,78,11,246,253,61]},"announce":[],"urlList":[]}}