{"title":"American Psychosis - Epub+Mobi - Yeal","uid":9371676,"size":4672605,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f35ba168169bb7196900cf905f2ab5a56bb4b23&amp;dn=American+Psychosis+-+Epub%2BMobi+-+Yeal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KhushSidhu","files":2,"time":1387540671,"description":"\n\nAmerican Psychosis: How the Federal Government Destroyed the Mental Illness Treatment System \n\nBy E. Fuller Torrey\n\n224 Pages - Publisher: Oxford University Press, USA; 1 edition\nYear - 2013 - Language: English - Epub+Mobi\nISBN-10: 0199988714 - ISBN-13: 978-0199988716\n\nIn 1963, President John F. Kennedy delivered an historic speech on mental illness and retardation. He described sweeping new programs to replace &quot;the shabby treatment of the many millions of the mentally disabled in custodial institutions&quot; with treatment in community mental health centers. This movement, later referred to as &quot;deinstitutionalization,&quot; continues to impact mental health care. Though he never publicly acknowledged it, the program was a tribute to Kennedy's sister Rosemary, who was born mildly retarded and developed a schizophrenia-like illness. Terrified she'd become pregnant, Joseph Kennedy arranged for his daughter to receive a lobotomy, which was a disaster and left her severely retarded.\n\nFifty years after Kennedy's speech, E. Fuller Torrey's book provides an inside perspective on the birth of the federal mental health program. On staff at the National Institute of Mental Health when the program was being developed and implemented, Torrey draws on his own first-hand account of the creation and launch of the program, extensive research, one-on-one interviews with people involved, and recently unearthed audiotapes of interviews with major figures involved in the legislation. As such, this book provides historical material previously unavailable to the public. Torrey examines the Kennedys' involvement in the policy, the role of major players, the responsibility of the state versus the federal government in caring for the mentally ill, the political maneuverings required to pass the legislation, and how closing institutions resulted not in better care - as was the aim - but in underfunded programs, neglect, and higher rates of community violence. Many now wonder why public mental illness services are so ineffective. At least one-third of the homeless are seriously mentally ill, jails and prisons are grossly overcrowded, largely because the seriously mentally ill constitute 20 percent of prisoners, and public facilities are overrun by untreated individuals. As Torrey argues, it is imperative to understand how we got here in order to move forward towards providing better care for the most vulnerable.","torrent":{"xt":"urn:btih:5f35ba168169bb7196900cf905f2ab5a56bb4b23","amp;dn":"American+Psychosis+-+Epub%2BMobi+-+Yeal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f35ba168169bb7196900cf905f2ab5a56bb4b23","infoHashBuffer":{"type":"Buffer","data":[95,53,186,22,129,105,187,113,150,144,12,249,5,242,171,90,86,187,75,35]},"announce":[],"urlList":[]}}