{"title":"Snowbird - Moon (2014) [FLAC]","uid":9554968,"size":631753790,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5f8e58c8b3d392d7e83b23bbf054c9a2f31a440f&amp;dn=Snowbird+-+Moon+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1391348760,"description":"\n  Snowbird - Moon (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Ambient Pop, Alternative, Indie\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 I Heard The Owl Call My Name\n  02 All Wishes Are Ghosts\n  03 Charming Birds From Trees\n  04 Where Foxes Hide\n  05 Amelia\n  06 Bears On My Trail\n  07 Porcelain\n  08 Come To The Woods\n  09 We Carry White Mice\n  10 In Lovely\n  11 Heart Of The Woods\n\n  Disc 2 - Snowbird vs. Rx Gibbs (Luna)\n\n  01 I Heard The Owl Call My Name (RX Gibbs Remix)\n  02 All Wishes Are Ghosts (RX Gibbs Remix)\n  03 Charming Birds From Trees (RX Gibbs Remix)\n  04 Where Foxes Hide (RX Gibbs Remix)\n  05 Amelia (RX Gibbs Remix)\n  06 Bears On My Trail (RX Gibbs Remix)\n  07 Porcelain (RX Gibbs Remix)\n  08 Come To The Woods (RX Gibbs Remix)\n  09 We Carry White Mice (RX Gibbs Remix)\n  10 In Lovely (RX Gibbs Remix)\n  11 Heart Of The Woods (RX Gibbs Remix)\n\n  On Snowbird's full-length debut, Moon, singer Stephanie Dosen is in the company of members of the Cocteau Twins, Radiohead, and Midlake, yet her voice is unquestionably the album's focal point. She's blessed with a remarkably pure soprano that, not coincidentally, bears more than a passing resemblance to Simon Raymonde's former Cocteau Twins bandmate Elizabeth Fraser, especially when her vocals are wreathed around each other as on &quot;I Heard the Owl Call My Name&quot; and &quot;Amelia.&quot; But where Fraser's vocals are almost inhumanly gorgeous, Dosen's are more down to earth, and Snowbird makes the most of that. Moon's instrumentation is dominated by piano -- Raymonde wrote most of the music on one that he purchased after Dosen left the U.K. when her visa expired -- and the contributions by Ed O'Brien, Phil Selway, McKenzie Smith, and the rest of the supporting crew are subtle, adding to Moon's feeling of being safe and cozy on a cold winter night. \n\n  The album's intimacy is even more remarkable considering that Dosen and Raymonde constructed it while they were separated by an ocean, but it speaks to the depth of their connection. It took Raymonde a long time to find the right collaborator after the Cocteau Twins broke up in 1997, and even after he met Dosen while working on her 2007 album, A Lily for the Spectre, it took a while for this project to get off the ground. To his and Dosen's credit, Snowbird sounds less like Cocteau Twins part two and more like the spare yet surprisingly warm ruminations of another 4AD project, This Mortal Coil, as well as Goldfrapp's more acoustic side on songs such as the heart-stoppingly beautiful ballad &quot;Porcelain&quot; and &quot;Charming the Birds from the Trees,&quot; where the way the pedal steel melds with her voice is sublime. Moon's classic-sounding melodies and instrumentation have a timeless if deceptively simple beauty that's different in all the right ways from Raymonde's former band, and that's exactly what makes Snowbird such a worthy successor.","torrent":{"xt":"urn:btih:5f8e58c8b3d392d7e83b23bbf054c9a2f31a440f","amp;dn":"Snowbird+-+Moon+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f8e58c8b3d392d7e83b23bbf054c9a2f31a440f","infoHashBuffer":{"type":"Buffer","data":[95,142,88,200,179,211,146,215,232,59,35,187,240,84,201,162,243,26,68,15]},"announce":[],"urlList":[]}}