{"title":"EnigmaT Set Rips { Cuts } - October 25th, 2013","uid":9096725,"size":361743683,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:605743685b2595391abedd42c3a1ff9dfd2b1c07&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+25th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":48,"time":1382701002,"description":"3Lau, Paris &amp; Simo - Escape feat Bright Lights (Bursters Remix) (Cut From First State Set)-enTc.mp3\nAaron Camz - Suburbia (Unreleased Vocal Mix) (Cut From Camz Set)-enTc.mp3\nAimoon - Cloud Breaker (ASOT 636 Rip)-enTc.mp3\nAlex Trouble - Jerusalem (Original Mix) (Cut From Nadz Set)-enTc.mp3\nAlgiz - Leaves On The Moorland (Original Mix) (Cut From Rocca Set)-enTc.mp3\nAndy Elliass Vs. Laucco - Lonely Soul (Touchstone Remix) (Cut From Nadz Set)-enTc.mp3\nArmin van Buuren Feat. Miri Ben-Ari - Intense (Andrew Rayel Remix) (ASOT 636 Rip)-enTc.mp3\nArnej - Rift (Short Edit) (Cut From Camz Set)-enTc.mp3\nArty &amp; Daft Punk - Flashback (ASOT 636 Rip)-enTc.mp3\nBen Gold - Kinectic (ASOT 636 Rip)-enTc.mp3\nBiotones &amp; Alikast - 4 AM (Hazem Beltagui Remix) (ASOT 636 Rip)-enTc.mp3\nBobina with Susana - Play Fire With Fire (Bobina's Megadrive Mix) (Cut From Bobina Set)-enTc.mp3\nCold Rush - Soundscape (Original Mix) (Cut From Cold Rush Set)-enTc.mp3\nCorderoy - Nothing To Say (Original Mix) (Cut From Corderoy Set)-enTc.mp3\nDanilo Ercole - Freezing Rain (Original Mix) (Set Rip)-enTc.mp3\nDanilo Ercole - ID -Oct 2013- (Set Rip)-enTc.mp3\nDarren Tate feat. Jodie Elms - All I Am (Hidden Art Remix) (Cut From Corderoy Set)-enTc.mp3\nDelared - Splash (Cut From Schossow Set)-enTc.mp3\nDenis Sender - Faster Than Sender (Marcel Kenenberg Remix) (Set Rip)-enTc.mp3\nDer Mystik - Lost and Not Found (Manuel Rocca Remix) (Cut From Rocca Set)-enTc.mp3\nDisfunktion - Kamuwe (Carl Nunes Sunset Remix) (Cut From Schossow Set)-enTc.mp3\nDVBBS &amp; Borgeous - Tsunami (Blasterjaxx Seismograph ReFixx) (Cut From E&amp;G Set)-enTc.mp3\nEMPIRION - Narcotic Influence (John Askew Remix) (Cut From Askew Set)-enTc.mp3\nFloE - Seraphim (GDJB Rip)-enTc.mp3\nGal Abutbul - Serenity (ASOT 636 Rip)-enTc.mp3\nGenix &amp; Las Salinas - Say Another What (AWD Remix) (ASOT 636 Rip)-enTc.mp3\nHodel - Mark 33 (Original Mix) (Cut From Shiver Set)-enTc.mp3\nJeremy Vancaulart feat. Chris Lago - You Can't Stop Me (Dan Chase Remix) (Cut From Cold Rush Set)-enTc.mp3\nJohan Vilborg feat. Charlie Bath - Inside (Dub Mix) (Cut From Schossow Set)-enTc.mp3\nJuventa feat. Erica Curran - Move Into Light (Husman Remix) (Cut From Schossow Set)-enTc.mp3\nLange Feat. Ilseviolin - Violin's Revenge (Dark Club Mix) (ASOT 636 Rip)-enTc.mp3\nMaksim Palmaxs - Red Alert (Alter Future Remix) (Cut From Valentine Set)-enTc.mp3\nMarkus Schulz presents Dakota - Barracas (GDJB Rip)-enTc.mp3\nMercer, Reece Low &amp; Dirty Audio - Drop (Original Mix) (Cut From E&amp;G Set)-enTc.mp3\nMr Sam - Readyo (Cut From Misja Set)-enTc.mp3\nRank 1 - 13.11.11 (ASOT 636 Rip)-enTc.mp3\nRobert Vadney - Ruin (Cut From Askew Set)-enTc.mp3\nRon Alperin - Sands Of Time (Cold Rush Remix) (Cut From Cold Rush Set)-enTc.mp3\nSolarstone &amp; Giuseppe Ottaviani - Falcons (Falcon Remix) (ASOT 636 Rip)-enTc.mp3\nSun &amp; Set - Second Sunrise (Dan Stone Remix) (ASOT 636 Rip)-enTc.mp3\nTucandeo - Altitude (Danilo Ercole Remix) (GDJB Rip)-enTc.mp3\nTwo&amp;One with Denis Kenzo Feat. Sveta B - Sitorya (Dub Mix) (GDJB Rip)-enTc.mp3\nTwo&amp;One with Denis Kenzo Feat. Sveta B - Sitorya (Original Mix) (ASOT 636 Rip)-enTc.mp3\nTygri5 - Scarlett Silva (ASOT 636 Rip)-enTc.mp3\nWalker &amp; Daniels vs Yelgo - Sunrise Strike (Aprocltd and E&amp;G Reboot) (Cut From E&amp;G Set)-enTc.mp3\nYork Feat. Jennifer Paige - Lost Under The Sun (Thomas Hayes Remix) (ASOT 636 Rip)-enTc.mp3\nZarathos - Nefer (Cut From Rocca Set)-enTc.mp3\nZedd feat. Hayley - Stay The Night (Nicky Romero Remix) (Cut From Schossow Set)-enTc.mp3","torrent":{"xt":"urn:btih:605743685b2595391abedd42c3a1ff9dfd2b1c07","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+25th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"605743685b2595391abedd42c3a1ff9dfd2b1c07","infoHashBuffer":{"type":"Buffer","data":[96,87,67,104,91,37,149,57,26,190,221,66,195,161,255,157,253,43,28,7]},"announce":[],"urlList":[]}}