{"title":"Juego de Tronos temp. 1","uid":7025940,"size":11266242560,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:60c8d272f8a7d44e0c359c4d6453edb753b36bb3&amp;dn=Juego+de+Tronos+temp.+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ragashok","files":10,"time":1328999484,"description":"Game of Thrones is an American medieval fantasy television series created for HBO by David Benioff and D. B. Weiss. Based on author George R. R. Martin's best-selling A Song of Ice and Fire series of fantasy novels, the first of which is called A Game of Thrones, the television series debuted in the U.S. on April 17, 2011.[3] The production is based in Belfast, in Northern Ireland, and has also filmed in Malta, Croatia and Iceland. The show's cast is mainly British and Irish.\n\nHighly anticipated since its early stages of development, the first season of Game of Thrones was very well received by viewers and critics.[4][5][6][7] The series was picked up for a second season on April 19, 2011, two days after its premiere.[8] It was nominated for several awards, including Outstanding Drama Series for the 63rd Primetime Emmy Awards and Best Television Series - Drama at the 69th Golden Globe Awards; Peter Dinklage also won both ceremonies' Best Supporting Actor award (Emmy and Golden Globes). Other accolades include an Emmy nomination for Outstanding Casting for a Drama Series and an Emmy win for Outstanding Main Title Design.\n-----------------------------------------------------------------------------------\nGame of Thrones (titulada en EspaÃƒÂ±a Juego de tronos) es una serie de televisiÃƒÂ³n estadounidense de fantasÃƒÂ­a medieval creada por David Benioff y D. B. Weiss para la cadena HBO. EstÃƒÂ¡ basada en la serie de novelas CanciÃƒÂ³n de hielo y fuego, del escritor George R. R. Martin y su trama se centra en las violentas luchas dinÃƒÂ¡sticas entre varias familias nobles por el control del Trono de Hierro del continente de Poniente.","torrent":{"xt":"urn:btih:60c8d272f8a7d44e0c359c4d6453edb753b36bb3","amp;dn":"Juego+de+Tronos+temp.+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60c8d272f8a7d44e0c359c4d6453edb753b36bb3","infoHashBuffer":{"type":"Buffer","data":[96,200,210,114,248,167,212,78,12,53,156,77,100,83,237,183,83,179,107,179]},"announce":[],"urlList":[]}}