{"title":"HISTORY OF POP AND ROCK MUSIC - part 343","uid":6935576,"size":1272973634,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:60f8179b37849d711df575c1a093a3cd6ef0b8db&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+343&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1325812859,"description":"   \n\n                   PART  343\n\n\n           CHRIS REA  -  I can hear your heartbeat  (1983)\n           CHRIS REA  -  On The Beach  (1986)\n           CHRIS REA  -  Let's dance  (1987)\n           CHRIS REA  -  The Road to Hell  (1989)\n           CHRIS REA  -  Auberge (1991)\n\n\n\n     &quot;Water Sign&quot; is an album by Chris Rea, released in 1983. It forms one of the cornerstones of the career of Chris Rea, since it was almost never released. The record company showed so little interest in doing anything with Chris Rea at all, that they would not even pay the money to record the album professionally. What was actually released was the DEMO album that Rea recorded by himself, as a demo for the record company, with a few overdubs. Hence the extensive use of electronic drum machines. The irony is, the album was well received, and most people thought the new electronic sound of Chris Rea was rather good. Little did they know that tracks such as &quot;I Can Hear Your Heartbeat&quot; would probably have been recorded in a different way.\n    &quot;On the Beach&quot; is a single by Chris Rea, released in 1986. &quot;On the Beach&quot; was covered by the German electronic music group York, reaching #4 in the UK charts in June 2000, and also by the Austrian house music group Sonic Palms.\n    &quot;Let's Dance&quot; is a 1987 single by Chris Rea. The song appears on his 1987 album &quot;Dancing with Strangers&quot; and reached a peak of #12 in the UK Singles Chart, remaining in the chart for 10 weeks.\n    &quot;The Road to Hell&quot; is a two part song written by Chris Rea and released on the album of the same name. It was released as a single, with only part 2 on the A-side of the 7&quot;. The single was his biggest success in the United Kingdom, peaking at #10 on the UK singles chart.\n    &quot;Auberge&quot; (a French word meaning &quot;inn&quot;) is an album by Chris Rea, released in 1991. The album as well as the title song was mostly notable for the association of the Caterham Super Seven that he owned, in which he called it the &quot;Blue Seven&quot;. That car appeared on the album cover. &quot;Auberge&quot; was a #1 album in the UK in 1991. The title track also gave Rea one of his biggest chart hits, reaching #16 in the UK charts. Other songs released as singles were &quot;Heaven&quot;, &quot;Looking For The Summer&quot; and &quot;Winter Song&quot;. ","torrent":{"xt":"urn:btih:60f8179b37849d711df575c1a093a3cd6ef0b8db","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+343","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60f8179b37849d711df575c1a093a3cd6ef0b8db","infoHashBuffer":{"type":"Buffer","data":[96,248,23,155,55,132,157,113,29,245,117,193,160,147,163,205,110,240,184,219]},"announce":[],"urlList":[]}}