{"title":"Vertical Limit(2000)DVDRip.AC3(ENG)-DROCK","uid":6804499,"size":733183927,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:612292918155f42024f89454d5b16a1382b13583&amp;dn=Vertical+Limit%282000%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1320805240,"description":"Family differences and personal grudges add drama to an already tense situation as the lives of a team of mountain climbers hang in the balance in this action drama. Peter Garrett (Chris O'Donnell) and his sister Annie (Robin Tunney) are the children of Royce Garrett (Stuart Wilson), an avid outdoorsman and climbing enthusiast who died when an accident left all three hanging from a single rope; Royce ordered Peter to cut him loose to save the lives of his kids, even though he knew it would mean his death. Years later, Peter has given up climbing and become a respected nature photographer, while Annie, who holds Peter responsible for her father's death, is a famous world-class mountain climber who is hired by Elliot Vaughn (Bill Paxton), a self-made billionaire, to help him scale K2, a mountain in the Himalayas that's the second-highest peak in the world. In the midst of the climb, dangerous weather strikes, and Elliot, Annie, and their crew find themselves trapped in a cavern that's been sealed tight by an avalanche. Peter, who is near K2 working on an assignment, quickly organizes a crew of expert climbers to save Annie and the other mountaineers, who must work under a tight deadline before the trapped climbers run out of air. Peter's partners in the rescue include beautiful medic Monique (Izabella Scorupco), radical climbers Cyril (Steve Le Marquand) and Malcolm (Ben Mendelsohn), disciplined Pakistani crewman Kareem (Alexander Siddig), and Montgomery (Scott Glenn), an eccentric outdoorsman who has a score to settle with Elliot. While backgrounds were shot on location in Pakistan, most of the climbing sequences in Vertical Limit were actually filmed on mountain ranges in New Zealand. \n\nRipped with Handbrake.\n\nLength: 2 Hours 4 Minutes\n\nFile Type: MP4\n\nFrame Width: 624\n\nFrame Height: 352\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:612292918155f42024f89454d5b16a1382b13583","amp;dn":"Vertical+Limit%282000%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"612292918155f42024f89454d5b16a1382b13583","infoHashBuffer":{"type":"Buffer","data":[97,34,146,145,129,85,244,32,36,248,148,84,213,177,106,19,130,177,53,131]},"announce":[],"urlList":[]}}