{"title":"HC World War I The Great War 10of13 John J Pershing The Iron Gen","uid":8876823,"size":779462656,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:61d12d304b678024636137834e42173f060086cf&amp;dn=HC+World+War+I+The+Great+War+10of13+John+J+Pershing+The+Iron+Gen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MVGroup","files":1,"time":1378228505,"description":"World War I : The Great War\n\nWar Documentary hosted by Fritz Weaver and Gavin MacFadyen, published by History Channel in 2009 - English narration\n\nInformation\n------------------------------\n\nHISTORY is proud to present the definitive collection of documentary programs on World War One. Experience the world-changing events from the birth of what became known as The Great War to the tragic, final day where over 13,000 men died. From the first dogfighters and the Red Baron, to the battle of The Somme, John J. Pershing, The Iron General and the Last Day of WWI. In the four year period from 1914 - 1918, the war was responsible for over 40 million casualties and over 20 million deaths. Join the brave servicemen of land, sea, and air as they valiantly fought alongside their Allied brothers in this &quot;war to end all wars.&quot;\n\n10)  John J Pershing : The Iron General \nA&amp;E BIOGRAPHY: JOHN J. PERSHING: THE IRON GENERAL\nHe took a 128,000-man force and transformed it into a juggernaut of 4 million soldiers that won a war. His was a face made for monuments, and a life worthy of them. He was arguably more responsible for transforming America into an international power than anyone else. John J. Pershing started his career as an Indian fighter on the frontier. He ended it as the greatest war hero America had ever seen. In between was enough triumph and tragedy for several lives. This searching profile pieces together a portrait of an ambitious, driven man haunted by a searing tragedy--the loss of his wife and three daughters killed in a fire. Military historians detail how he transformed a tiny, 128,000-man force into an army of four million men, and then led it to victory in the greatest battle America had ever fought--the Meuse Argonne offensive in October 1918. That Pershing was no tactical genius is clear, but his crude force made up in numbers what they lacked in strategy. John Pershing, the senior U.S. Army General of World War I, was granted the rank of &quot;General of the Armies&quot; in 1919 in recognition of his performance as the commander of the American Expeditionary Force. &quot;General of the Armies&quot; of the United States is the highest possible land-based rank in the United States military hierarchy. From the fading frontier to the trenches of World War I, follow the career of one of the most important American generals of all time.\n\n\nTechnical Specs\n------------------------------\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 2036 kbps\nVideo Resolution: 704x544\nVideo Aspect Ratio: 1.294:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 46:27.840\nNumber Of Parts: 13\nPart Size: 743 MB\nRipped by: DocFreak08\n\nLinks\n------------------------------\n\nSource: &lt;a href=&quot;\nhttp://docuwiki.net/index.php?title=World_War_I_:_The_Great_War&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/index.php?title=World_War_I_:_The_Great_War&lt;/a&gt;\n","torrent":{"xt":"urn:btih:61d12d304b678024636137834e42173f060086cf","amp;dn":"HC+World+War+I+The+Great+War+10of13+John+J+Pershing+The+Iron+Gen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61d12d304b678024636137834e42173f060086cf","infoHashBuffer":{"type":"Buffer","data":[97,209,45,48,75,103,128,36,99,97,55,131,78,66,23,63,6,0,134,207]},"announce":[],"urlList":[]}}