{"title":"Paramanandayya Sishyula Katha (1966) Xvid 2cd Telugu Classic [DD","uid":8120089,"size":1537767690,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:629908a775bcd4c644eacb723729426c0e9c66c0&amp;dn=Paramanandayya+Sishyula+Katha+%281966%29+Xvid+2cd+Telugu+Classic+%5BDD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1360379869,"description":"DDR Presents\n\nParamanandayya Sishyula Katha (1950) Telugu Classic\n\nCAST:- Chittor V. Nagaiah, Nandamuri Taraka Rama Rao, K. R. Vijaya, Sobhan Babu, B. Padmanabham, Allu Ramalingaiah, Raja Babu, Sarathi, Boddapaati, Mukkamala Krishna Murthyr, Chaya Devi, L. Vijayalakshmi, Vangara Venkata Subbaiah, Kaikala Satyanarayana, R. Nageswara Rao, Dr. Sivaramakrishnaiah,\nProduced by Subbha Rao Thota\nDirected by Chittrajalu Pullayya\nMusic by Chantasala \nLyrics by Sri Sri, Sadasivabrahman, C.Narayana Reddy, Samudrala, Kosaraju\nPlayback Singers:-Ghantasala, P. Leela, J V Raghauvulu, Pithapuram, K Apparao, P. Susheela, S. Janaki\n\nSYNOPSIS:- Paramanandayya Sishyula Katha (1950) Telugu\nThe plot is based on the story of Disciples (Sishya) of Paramanandayya, seven saints in number. They are actually the disciples of Aruna Keerti Mahamuni. Chitralekha (K.R. Vijaya) dances in the court of Lord Shiva (Sobhan Babu). He gives her a Rudraksha mala to wear during the visits. Later, she visits the beautiful Earth with her companions and enjoys bathing in a pool. She finds these Shishiyas keenly looking at her and curses them to become idiots. After knowing the facts from Guruji and realizing her mistake, she pronounces the vimukti (free from curse) at the time of her marriage. The Guru, Aruna Keerti, in return curses Chitralekha that she will lose her celestial status if she comes into contact with a human.\n\nHe advises the Shishyas to go to Rajaguru (Principle Court Spiritual Adviser) Paramanandayya (Nagaiah) at Vijayadurgam ruled by Nandivardhana Maharaju (N.T. Ramarao). Paramanandayya accepts them as his disciples. Chitralekha forgets the Rudraksha mala while returning back to the Heaven. The mala is accidentally found by Maharajah when he come to hunt in the forest. Chitralekha remembers her mala, and goes a snake to the Rajamahal (palace) as a snake and tries to steals the mala. However Maharajah dreaming about the devakanya (a celestial maiden) touches Chitralekha, who loses her divine powers and past memory. Maharajah calls Paramanandayya for advice. He tell the Rajah to handover the mala to her, making her regain the sequence of events. He advises her to pray Lord Shiva to attain divinity (so she can go back to Heaven). Meanwhile, whatever the Sishiyas do out of ignorance turns out to be a good thing for Paramanandayya family. They save them from thieves etc. Finally they decided to die as Guruji strongly scolded them for purchasing a dead cow. They eat Vishapu Undalu and go to the streets. Night patrolling Rajabhat takes to the Royal Court. They thought Maharaja as Indra and Ranjani (Vijayalakshmi) as Apsara. They reach the house of Ranjani and makes Maharajah know the criminal plans of Minister. The Sishiyas spoiled the marriage of daughter Girija with Tuberculous patient and save Paramanandayya from another family crisis. Ousted by Guruji, they reach RajaMahal and spoil an attempt to kill Maharaja by Jaggarayudu (Satyanarayana) and Minister (Mukkamala). They convinced Chitralekha to marry Maharajah. During the marriage ceremony they are released from the curse and regain their sainthood.","torrent":{"xt":"urn:btih:629908a775bcd4c644eacb723729426c0e9c66c0","amp;dn":"Paramanandayya+Sishyula+Katha+%281966%29+Xvid+2cd+Telugu+Classic+%5BDD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"629908a775bcd4c644eacb723729426c0e9c66c0","infoHashBuffer":{"type":"Buffer","data":[98,153,8,167,117,188,212,198,68,234,203,114,55,41,66,108,14,156,102,192]},"announce":[],"urlList":[]}}