{"title":"PrettyDirty - Jillian Janson (Revenge Fuck) NEW 26 June 2016","uid":15100954,"size":506350392,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:62d177adc88c3c3d1829e6003e434cb67e1e21ce&amp;dn=PrettyDirty+-+Jillian+Janson+%28Revenge+Fuck%29+NEW+26+June+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1466956717,"description":"Jillian Janson and her boyfriend argue to the point where shes had enough. She needs a real man to satisfy her needs and get the attention she deserves. Who better to help her out sexually than Damon Dice. AJ and Damon are sitting on the couch watching the game when Jillian asks for Damon's help in the kitchen. She has eager sexual intentions he is oblivious to. She guides him into her bedroom implying she needs a good fuck from a real man. Damon doesn't think it's the best idea since his best friend is in the other room, but Jillian could care less and wants his cock bad.Jillian sucks Damon's long hard cock down her throat making his dick wet and her pussy moist. Damon sucks on her petite boobs, spreading her legs and suckling her tight, shaved pussy. He finger fucks her hole stretching out her insides until she is ready to get her fuck on. Jillian moans with absolute pleasure, finally able to enjoy a nice hard cock inside of her, while forgetting all about her useless boyfriend. Jillian rides Damon's cock in different positions, having multiple orgasms until Damon shoots his load directly inside her mouth and over her chest!\r\nCategories Blonde, Natural Tits, Tattoos, Pussy Licking, Facial, Blowjob, Deepthroat, Cumshot, Cum swallow\r\n \nhttp://imgdone.com/viewer.php?file=13900306347390688964.jpg\r\n \nhttp://imgdone.com/viewer.php?file=26041668679166146333.jpg","torrent":{"xt":"urn:btih:62d177adc88c3c3d1829e6003e434cb67e1e21ce","amp;dn":"PrettyDirty+-+Jillian+Janson+%28Revenge+Fuck%29+NEW+26+June+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62d177adc88c3c3d1829e6003e434cb67e1e21ce","infoHashBuffer":{"type":"Buffer","data":[98,209,119,173,200,140,60,61,24,41,230,0,62,67,76,182,126,30,33,206]},"announce":[],"urlList":[]}}