{"title":"Dante - The Divine Comedy (Mark Musa, Penguin) (pdf)","uid":8869404,"size":12080388,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62fcab688fe61dd52831cf6dc5a464f5e890230e&amp;dn=Dante+-+The+Divine+Comedy+%28Mark+Musa%2C+Penguin%29+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1378019989,"description":"The Divine Comedy, Volumes 1-3: Inferno, Purgatory, Paradise (Mark Musa, trans.)(Penguin Classics, 1984-1986). \n\nNew scans. New scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nThis is an excellent translation of The Divine Comedy. The main text is in English only (no Italian text included), and each canto is preceded by a summary and followed by detailed explanatory notes by the translator. In addition each volume has a lengthy general introduction, glossary, and bibliography.\n\n1. Inferno\n\nThis vigorous new translation of Inferno preserves Dante's simple, natural style, and captures the swift movement of the original Italian verse. Mark Musa's blank verse re-creates for the modern reader the rich meanings that Dante's poem had for his contemporaries. Musa's introduction and commentaries on each of the cantos brilliantly illuminate the text.\n\n2. Purgatory\n\nIn the second volume of his definitive translation of The Divine Comedy, Mark Musa again brings his poetic sensitivity and skill as a translator and annotator to the difficult task of making Dante's masterpiece vital for English-speaking readers. In Purgatory, dante deals with the origins of sin as he struggles up the terraces of Mount Purgatory on his arduous journey toward God. In Musa's  fine idiomatic translation -- complete with prose introductions, bibliography, and glossary -- Dante comes alive as the universal poet -- sublime, grim, intellectual, simple, humorous, tender, and ecstatic.\n\n3. Paradise\n\nThe final volume in this brilliant translation destined to take its place among the great English versions of The Divine Comedy.\n\nIn his translation of Paradise, Mark Musa exhibits the same sensitivity to language and knowledge of translation that enabled his versions of the Inferno and Purgatory to capture the vibrant power and full dramatic force of Dante's poetry. Dante relates his mystical interpretation of the heavens, and his moment of transcendent glory, as he journeys, first with Beatrice, then alone, toward the Trinity.\n\nProfessor Musa's extraordinary translation and his interpretive commentary, informative, glossary, and bibliography clarify the theological themes and make Dante accessible to the English-speaking public.\n\n","torrent":{"xt":"urn:btih:62fcab688fe61dd52831cf6dc5a464f5e890230e","amp;dn":"Dante+-+The+Divine+Comedy+%28Mark+Musa%2C+Penguin%29+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62fcab688fe61dd52831cf6dc5a464f5e890230e","infoHashBuffer":{"type":"Buffer","data":[98,252,171,104,143,230,29,213,40,49,207,109,197,164,100,245,232,144,35,14]},"announce":[],"urlList":[]}}