{"title":"20121220-Stossel-[Good Giving].Fox Business.CF.avi","uid":7945496,"size":281072080,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6356d574adc3d19c4b3bc9dae89a291a0f572aaf&amp;dn=20121220-Stossel-%5BGood+Giving%5D.Fox+Business.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1356115984,"description":"----------\n\nSTOSSEL - [Good Giving] - Fox Business Network\n2012, December 20, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nAmericans give a lot to charitable causes--much more than people in other countries. Good for us. And now there are new ways to give:\n\nSocial impact bonds combine philanthropy and the profit motive. Goldman Sachs will spend $9.6 million to try to reduce recidivism among jailed teenagers in NYC. The program is run by the Osborne Association--David Condliffe explains that only if they successfully reduce recidivism will Goldman get back its investment, plus a return.\n\nMany business schools now teach courses on charity. Melissa Berman from Rockefeller Philanthropy Advisors instructs students in Columbia's MBA program how to identify and support effective non-profits.\n\nHoward Husock of the Manhattan Institute explains how good charity ideas spread.\n\nRenee Riddle's organization, Stars &amp; Stripes Honor Flight, honors World War II veterans by taking them to their memorial in Washington, D.C. So many people have been inspired by their work, and by the documentary produced by Clay Broga, that they want to do the same for veterans of other wars.\n\nToday we have more direct involvement in where our money goes. Premal Shah, co-founder of Kiva, shares why microloans given from his site to entrepreneurs in the developing world have a 98% repayment rate. Crowdsourcing helps creative projects, too--Phelim McAleer was able to fund his documentary in defense of fracking thanks to $200,000 put up by strangers on Kickstarter.com.\n\nI'll explain why I give my money to NYC's Student Sponsor Partners, the Central Park Conservancy, and the Doe Fund.\n\nAnd in the most provocative segment, Yaron Brook of the Ayn Rand Institute argues that successful businesspeople who don't give to charity should never feel guilty about that.","torrent":{"xt":"urn:btih:6356d574adc3d19c4b3bc9dae89a291a0f572aaf","amp;dn":"20121220-Stossel-%5BGood+Giving%5D.Fox+Business.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6356d574adc3d19c4b3bc9dae89a291a0f572aaf","infoHashBuffer":{"type":"Buffer","data":[99,86,213,116,173,195,209,156,75,59,201,218,232,154,41,26,15,87,42,175]},"announce":[],"urlList":[]}}