{"title":"Hitler's Search for the Holy Grail.avi","uid":3420442,"size":366067712,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6362868f04f78b42b3acf4199132a9030fe861bf&amp;dn=Hitler%5C%27s+Search+for+the+Holy+Grail.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"johnlennon","files":1,"time":1134424114,"description":"Hitler's Search for the Holy Grail.\n\n\n      Of particular interest to students of the 'hidden history' of the Third Reich is Hitler's interest in the Spear of Destiny. The so-called Spear of Longinus kept in the imperial museum of Austria was said to be the spear that pierced the side of Christ (and contained a nail from the Cross) and was the spear that the Roman emperor Maximilian and the Holy Roman emperors of Austria carried as a standard into battle14. Walter Stein insisted that Hitler was fascinated by the spear and felt that possession of it would mean victory for the Nazi cause of world domination and the triumph over Christianity. How important the spear really was to Hitler - who never really seemed to make a big deal out of it when it was seized from the museum, at least in public - is not clear. But we know- and not just from Indiana Jones movies- that the Nazis were fascinated with finding lost mystical relics, particularly those associated with Christianity. That is unusual, considering the anti-Christian bias of the Nazis, who felt that everything wrong with the West (pacifism, belief in equality, etc.) had been rammed down its throat by Christianity, an 'alien' religion from the Orient.\n\nNonetheless, it is clear that Hitler modelled his S.S. troops on the Templars and other Crusader orders, and the Jesuits and the Masons. There is a famous poster from 1937 showing Hitler as a Templar Knight, in holy armor, preparing to do battle with Satan. While Nieztsche felt nauseous from Wagner's Parsifal (for its caving into the 'sickening' ideals of Christian chivalry), the Nazi cadres seem to have vigorously promoted it. Otto Rahn was searching for the Holy Grail in the south of France in 1938, though he did not appear to think that what he was looking for was a wine cup from the Last Supper or the blood of Jesus. Instead he claimed it was &quot;a power source of indescribable magnitute.&quot;15 It is not known whether the Nazis really ever searched for the Ark of the Covenant, though there are tantalizing hints that they may well have been laying out blueprints for a search of northern Africa and Egypt for that Jewish relic. Why they thought they might enlist the gods of their enemies in their destruction is not clear...","torrent":{"xt":"urn:btih:6362868f04f78b42b3acf4199132a9030fe861bf","amp;dn":"Hitler%5C%27s+Search+for+the+Holy+Grail.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6362868f04f78b42b3acf4199132a9030fe861bf","infoHashBuffer":{"type":"Buffer","data":[99,98,134,143,4,247,139,66,179,172,244,25,145,50,169,3,15,232,97,191]},"announce":[],"urlList":[]}}