{"title":"Adguard for Windows (v6.0) [Multi] (2016)","uid":13431833,"size":171512,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:63d4fbaf0e6725007c861c247ea9bccc256f4d5b&amp;dn=Adguard+for+Windows+%28v6.0%29+%5BMulti%5D+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Woitler","files":1,"time":1454634180,"description":"Program name: Adguard\r\nProgram Type: Adblocker, antiphishing, web filter, pop-ups and ads blocking program\r\nVersion: 6.0 (6.0.185)\r\nRelease date: February 04, 2016\r\nLanguage: English, German, Japanese, Spanish, Portuguese, Russian, Serbian and etc.\r\nOperating system: Any Windows version\r\nFile size: 167 Kb\r\n----------------------------------------------------\r\nDescription\r\nAdguard - is an ad blocking program that is justifiably among three best ad blockers in the world together with Adblock and Adblock Plus extensions. However, Adguard is not limited to banal banners removing; it is a universal program that contains all the necessary functions for the most comfortable using of the Internet. For example, blocking or warning about the phishing and other online threats, filtering of obscene materials and protection of your personal data on the Internet. \r\n----------------------------------------------------\r\nFunctionality\r\nThe program includes 3 main modules: AdBlocker, Antiphishing and Parental Control.\r\n- AdBlocker removes all the advertising elements from web pages. Blocks video ads, popups, removes banners and other advertising. At the same time filtering takes place even before the load of the website into browser and this means:\r\na) No advertisements;\r\nb) Less traffic consumed/less money spent;\r\nc) Acceleration of the websites loading.\r\n- Antiphishing protects against malicious and fraudulent websites. The program really reduces the possibility of virus infection of your computer. Adguard uses the backlists, which contain millions of hazardous websites. The Antiphishing module processes the URLs in real time by comparing them with the domains in the database. And thanks to the optimization of this process – such verification takes a split second.\r\n- Parental Control allows you to protect children from obscene materials and adult websites, which altogether ensures the safety of children online. Parents can rest easy, because their child will not see any pornographic content on the Internet. By the way, this feature is unavailable in other popular ad blockers such as Adblock and Adblock Plus.\r\n- Antitracking – protection from outside observing of your internet-surfing history. With Adguard, advertising networks and counters won’t be able to track your searches and websites you visited and use the data for personal gain. Without you using Adguard, they have a fairly complete picture of your sex, age and area of interest.\r\n----------------------------------------------------\r\nAdvantages of the program:\r\n1. Works in all popular browsers;\r\n2. Developed for blocking of all kinds of ads;\r\n3. Easy-to-use, blocks ads and works unnoticed on the background;\r\n4. Warns about danger when clicking on suspicious websites;\r\n5. Has special module (Adguard Assistant) for managing the program right from the browser;\r\n6. Works «out of the box», no additional settings needed;\r\n7. Necessary when using a 3G modem, because accelerates loading of pages notably and saves traffic.\r\n----------------------------------------------------\r\nSystem requirements:\r\nOperating System: Windows XP, Vista, 7, 8, 8.1, 10\r\nRAM: 512 Mb\r\nBrowsers: Any (Microsoft Edge, IE, Google Chrome, Opera &amp; Opera Next, Tor Browser and etc.)\r\nDisk: 50 Mb free hard disk space\r\n----------------------------------------------------\r\nWhat's new in version 6.0.185?\r\n1. Adguard user interface was completely redesigned. It will now have modern tile design.\r\n2. Adguard was translated into many new languages. That includes UI, Adguard Assistant and filter descriptions etc.\r\n3. Window positions are now memorized and restored after program restart.\r\n4. Tray menu is reworked, improved accessibility of different options through tray.\r\n5. New versions interface is much more friendly to people with visual impairment.\r\n6. UI performance and boot speed were significantly optimized, memory consumption was greatly reduced.\r\n7. Now with the first launch of Adguard a tutorial will be shown, familiarizing user with Adguard and quickly introducing its capabilities.\r\n8. Updating to new version from Adguard 5 is now possible and will not lose any settings.\r\n9. New possibility to change update channel to 'Beta' and receive all beta updates, including Assistant and other extensions.\r\n10. A new module was added - Stealth Mode. It serves to protect your online privacy in various ways, including blocking of third-party cookies, hiding IP address and many more.\r\n11. Improved support for filtered apps. Adguard now automatically finds software installed on your computer and offers to filter its traffic, this includes modern UI applications.\r\n12. Filter editor and Filtering log were drastically changed. You will find both fresh design and improved functionality.\r\n13. You can now use new search feature to search the whole program for any keyword by entering it in the text field in the top right corner.\r\n14. Now it is possible to subscribe to any filter by URL or by choosing path to a local file, and Adguard will automatically watch for changes.\r\n15. Extensions were allocated to a separate module which can be enabled/disabled as a whole.\r\n16. Userscripts security was significantly improved.\r\n17. Plentiful additions and improvements to filtering process were made, notably introducing support for new rules modifiers and improving filtering speed.\r\n18. Many more improvements, all of which are impossible to include in these release notes","torrent":{"xt":"urn:btih:63d4fbaf0e6725007c861c247ea9bccc256f4d5b","amp;dn":"Adguard+for+Windows+%28v6.0%29+%5BMulti%5D+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63d4fbaf0e6725007c861c247ea9bccc256f4d5b","infoHashBuffer":{"type":"Buffer","data":[99,212,251,175,14,103,37,0,124,134,28,36,126,169,188,204,37,111,77,91]},"announce":[],"urlList":[]}}