{"title":"Thunderscape (GOG)","uid":9230361,"size":660627757,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:63d620c7d42a2cb1d6d21abeeae76830e2cff0ce&amp;dn=Thunderscape+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Sarah116","files":27,"time":1385062357,"description":"Hey guys, here thunderscape gog. Hope you guys enjoy. Game info below\n\n &lt;a href=&quot;\nhttp://www.gog.com/game/thunderscape&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/game/thunderscape&lt;/a&gt;\n\n\nWhat's cool about it:\nA classic 90s-era dungeon-crawling role-playing game flavored with a distinctly steampunk feel.\nControl a party of up to six heroes of various races and skills.\nEnjoy raucous combat during turn-based battles, as well as brain-bending puzzles.\n\n\n\nAll is not well in the world of Aden. The Darkfall stains the land with its hellspawn, the mindless horrors only known as nocturnals. Warriors tested by combat and steel ride across battered lands to battle these vile hordes Sneaky rogues and ruthless inquisitors seek out traitors in corrupted cities and towns. Powerful mechamages wield deadly contraptions of steam welded with magic. All of this will be for naught unless a true hero rises and leads the way out of the encroaching darkness!\n\nThunderscape is a first-person dungeon-crawling RPG filled to the brim with only the most prestigious turn-based combat and real-time exploration. Create and customize a party of six adventurers with 8 races and 11 character classes to choose from. Challenge your intellect and skill as you avoid deadly traps and solve mind-bending puzzles. Thunderscape is a precious jewel in the Strategic Simulations crown and it is our pleasure to bring it to you once more. Will you fight to save the magical and wondrous world of Aden from the Darkfall?","torrent":{"xt":"urn:btih:63d620c7d42a2cb1d6d21abeeae76830e2cff0ce","amp;dn":"Thunderscape+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63d620c7d42a2cb1d6d21abeeae76830e2cff0ce","infoHashBuffer":{"type":"Buffer","data":[99,214,32,199,212,42,44,177,214,210,26,190,234,231,104,48,226,207,240,206]},"announce":[],"urlList":[]}}