{"title":"Professional Excel Development - 2nd Edition","uid":12431127,"size":21856248,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63edbe5d1eed3342e4b5ef156d8c8972c419a505&amp;dn=Professional+Excel+Development+-+2nd+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ma.hesh","files":1,"time":1442459910,"description":"* The definitive guide to developing state-of-the-art applications with Microsoft Excel: now 100% updated for Excel 2007 \n\n* A long-awaited revision of a highly-praised book - authored by four Microsoft Excel MVPs with worldwide reputations\n\n* Teaches advanced techniques for planning and building more robust, effective, and secure Excel applications \n\n* Contains extensive new coverage, including the Ribbon and RibbonX, VSTO3, OLAP database support, Excel Services, XML, and much more Summary Direct from four of the world's most respected authorities on Microsoft Excel solutions development, this is the definitive guide to building more powerful, robust, and secure Excel applications. Thoroughly updated for Microsoft Excel 2007, this book is designed to help developers make the right design decisions and use Excel's most powerful programming features so they can save time and money, and build the most effective solutions possible. \n\n* The authors - all of them honored by Microsoft as Excel Most Valuable Professionals (MVPs) - start where other books on Excel programming leave off. Readers will learn best practices for planning robust, maintainable Excel applications; master today's most advanced techniques for utilizing Excel and VBA; learn how to optimize Excel program performance; and much more. Simply put, no other book on Excel 2007 programming offers this much depth and insight","torrent":{"xt":"urn:btih:63edbe5d1eed3342e4b5ef156d8c8972c419a505","amp;dn":"Professional+Excel+Development+-+2nd+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63edbe5d1eed3342e4b5ef156d8c8972c419a505","infoHashBuffer":{"type":"Buffer","data":[99,237,190,93,30,237,51,66,228,181,239,21,109,140,137,114,196,25,165,5]},"announce":[],"urlList":[]}}