{"title":"The American Analog Set (Discography) [FLAC]","uid":10437145,"size":2666778706,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6524e9f2add52c46fae62c431e8296b8197c88d9&amp;dn=The+American+Analog+Set+%28Discography%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":null,"files":-1,"time":1403846527,"description":"The American Analog Set\n\nSlowcore, Indie, Acoustic\n\n----------------------------\n\nStudio Albums in 16 bit / 44.1 khz FLAC sourced from CD\n\n----------------------------\n\nThe Fun of Watching Fireworks (1996)\n\nFrom Our Living Room To Yours (1997)\n\nThe Golden Band (1999)\n\nKnow By Heart (2001)\n\nPromise of Love (2003)\n\nSet Free (2005)\n\n----------------------------\n\nA drone-pop quartet hailing from Austin, TX, the American Analog Set evolved from the ashes of Dallas' Electric Company in 1994. After Electric Company's demise, guitarist/vocalist Andrew Kenny, keyboardist Lisa Roschmann, and drummer Mark Smith reunited to cut a number of impromptu four-track recordings that ultimately led to their decision to re-form as a group. The addition of bassist Lee Gillespie followed, and the quartet renamed themselves the American Analog Set before preparing for their first performances. After just their second gig, the band earned a deal with the local label Emperor Jones (a subsidiary of Trance Syndicate, owned by the Butthole Surfers' King Coffey) and issued their debut single, &quot;Diana Slowburner II.&quot; Their first full-length effort, the low-key The Fun of Watching Fireworks, followed in 1996.\n\nFrom Our Living Room to Yours, the group's superb sophomore effort, trailed one year later, as did the EP Late One Sunday &amp; the Following Morning, released in conjunction with the Darla label's &quot;Bliss Out&quot; series. The third AmAnSet album, The Golden Band, appeared in 1999. Roschmann's decision to exit the lineup left the group in limbo, but Kenny, Smith, and Gillespie soon refocused with the addition of keyboardist Tom Hoff (keys) and guitarist/vibraphonist Sean Ripple. The acclaimed Know by Heart followed in 2001, as did the singles collection Through the 90s. Kenny moved to New York City in 2002 to begin a Ph.D. program at Columbia, but AmAnSet remained solvent.\n\nA tour with Her Space Holiday, as well as a remix EP, Updates, followed in July 2002. 2003's Promise of Love, which continued to meld soft ambient soundscapes to indie rock meter, marked the band's second release for Tiger Style. Hoff was unable to tour in support, requiring the band to add Craig McCaffery before playing shows with Ester Drang and the Album Leaf. Two years later, the American Analog Set signed with Arts &amp; Crafts for Set Free, the band's sixth album.\n","torrent":{"xt":"urn:btih:6524e9f2add52c46fae62c431e8296b8197c88d9","amp;dn":"The+American+Analog+Set+%28Discography%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6524e9f2add52c46fae62c431e8296b8197c88d9","infoHashBuffer":{"type":"Buffer","data":[101,36,233,242,173,213,44,70,250,230,44,67,30,130,150,184,25,124,136,217]},"announce":[],"urlList":[]}}