{"title":"Brian Eno 24 Bit Vinyl Pack","uid":8819988,"size":7462218067,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6599ac424c9859fb81a8fab96b7538130b2f9197&amp;dn=Brian+Eno+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1376677830,"description":"\n  Brian Eno 24 Bit Vinyl Pack\n\n  Genres: Electronic, Classical, Rock, Avant-Garde\n  Styles: Ambient, Art Rock, Experimental, Glam Rock\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,700 - 3,100 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  Ambient 4 On Land\n  Another Green World (two versions)\n  Apollo (Atmospheres &amp; Soundtracks)\n  Before and After Science \n  My Life in the Bush of Ghosts (with David Byrne) (two versions)\n  Small Craft On a Milk Sea\n  The Pearl (with Harold Budd)\n\n  Ambient pioneer, glam rocker, hit producer, multimedia artist, technological innovator, worldbeat proponent, and self-described non-musician -- over the course of his long, prolific, and immensely influential career, Brian Eno was all of these things and much, much more. Determining his creative pathways with the aid of a deck of instructional, tarot-like cards called Oblique Strategies, Eno championed theory over practice, serendipity over forethought, and texture over craft; in the process, he forever altered the ways in which music is approached, composed, performed, and perceived, and everything from punk to techno to new age bears his unmistakable influence.\n\n  Brian Peter George St. John le Baptiste de la Salle Eno was born in Woodbridge, England, on May 15, 1948. Raised in rural Suffolk, an area neighboring a U.S. Air Force base, as a child he grew enamored of the &quot;Martian music&quot; of doo wop and early rock &amp; roll broadcast on American Armed Forces radio; a subsequent tenure at art school introduced him to the work of contemporary composers John Tilbury and Cornelius Cardew, as well as minimalists John Cage, LaMonte Young, and Terry Riley. Instructed in the principles of conceptual painting and sound sculpture, Eno began experimenting with tape recorders, which he dubbed his first musical instrument, finding great inspiration in Steve Reich's tape orchestration &quot;It's Gonna Rain.&quot;\n\n  After joining the avant-garde performance art troupe Merchant Taylor's Simultaneous Cabinet, as well as assuming vocal and &quot;signals generator&quot; duties with the improvisational rock unit Maxwell Demon, Eno joined Cardew's Scratch Orchestra in 1969, later enlisting as a clarinetist with the Portsmouth Sinfonia. In 1971 he rose to prominence as a member of the seminal glam band Roxy Music, playing the synthesizer and electronically treating the band's sound. A flamboyant enigma decked out in garish makeup, pastel feather boas, and velvet corsets, his presence threatened the focal dominance of frontman Bryan Ferry, and relations between the two men became strained; finally, after just two LPs -- 1972's self-titled debut and 1973's brilliant For Your Pleasure -- Eno exited Roxy's ranks to embark on a series of ambitious side projects.\n\n  The first, 1973's No Pussyfooting, was recorded with Robert Fripp; for the sessions Eno began developing a tape-delay system, dubbed &quot;Frippertronics,&quot; which treated Fripp's guitar with looped delays in order to ultimately employ studio technology as a means of musical composition, thereby setting the stage for the later dominance of sampling in hip-hop and electronica. Eno soon turned to his first solo project, the frenzied and wildly experimental Here Come the Warm Jets, which reached the U.K. Top 30. During a brief tenure fronting the Winkies, he mounted a series of British live performances despite ill health; less than a week into the tour, Eno's lung collapsed, and he spent the early part of 1974 hospitalized.\n\n  Upon recovering, he traveled to San Francisco, where he stumbled upon the set of postcards depicting a Chinese revolutionary opera that inspired 1974's Taking Tiger Mountain (By Strategy), another sprawling, free-form collection of abstract pop. A 1975 car accident which left Eno bedridden for several months resulted in perhaps his most significant innovation, the creation of ambient music: unable to move to turn up his stereo to hear above the din of a rainstorm, he realized that music could assume the same properties as light or color, and blend thoroughly into its given atmosphere without upsetting the environmental balance. Heralded by the release of 1975's minimalist Another Green World, Eno plunged completely into ambient with his next instrumental effort, Discreet Music, the first chapter in a ten-volume series of experimental works issued on his own Obscure label.","torrent":{"xt":"urn:btih:6599ac424c9859fb81a8fab96b7538130b2f9197","amp;dn":"Brian+Eno+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6599ac424c9859fb81a8fab96b7538130b2f9197","infoHashBuffer":{"type":"Buffer","data":[101,153,172,66,76,152,89,251,129,168,250,185,107,117,56,19,11,47,145,151]},"announce":[],"urlList":[]}}