{"title":"No Audible Dialogue Discography (05.01.14)","uid":10080028,"size":449116968,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6646f0c7dffaa5d3c9e311b7a225d2ffed366226&amp;dn=No+Audible+Dialogue+Discography+%2805.01.14%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"noad1818","files":-1,"time":1398987360,"description":"Hello, \n\nI would like to share some music I've made over the years. In this torrent you will find both commercial EPs I have released on Bandcamp/iTunes as well as a DEMO for one I'm about to release. Not to mention tons of tracks from my Soundcloud and even quite a few that didn't make it to Soundcloud. A total of 71 songs in all. \n\nThe tracks range from incredibly emotional Orchestral tracks, to a crazy, silly roller coaster ride of just pure musical fun. Even some songs that try to merge dance and Asian/country sounds. (Think Techno with banjos!) As well as a few 8 bit remixes of popular songs, and even some Orchestral and ambient remixes as well. \n\nI hope you enjoy this torrent! In fact I hope you enjoy it so much you take the time to search me out after downloading. I'm not that hard to find. I'm not even going to link you to anything. Simply search &quot;No Audible Dialogue&quot; into Google and you'll find my Soundcloud, Bandcamp, Youtube, or Facebook pages. \n\nIf you download make sure to seed back so others can download too! \n\nAlso I have another torrent up here that died. I didn't understand what I was doing when I made that and can't seam to delete it. I'll keep trying but just know I'm aware of it. Thanks again! Enjoy the music! ","torrent":{"xt":"urn:btih:6646f0c7dffaa5d3c9e311b7a225d2ffed366226","amp;dn":"No+Audible+Dialogue+Discography+%2805.01.14%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6646f0c7dffaa5d3c9e311b7a225d2ffed366226","infoHashBuffer":{"type":"Buffer","data":[102,70,240,199,223,250,165,211,201,227,17,183,162,37,210,255,237,54,98,38]},"announce":[],"urlList":[]}}