{"title":"MotoHeroz - WAJE.rar","uid":7013397,"size":31274132,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:6647de9ede0d6345a1087f11278f872b61ea7702&amp;dn=MotoHeroz+-+WAJE.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"adamsef","files":1,"time":1328556626,"description":"MotoHeroz\n\nMotoHeroz takes the fun, fast gameplay of a Trials style game, adds it to a frantic rally race, and delivers a fresh new kind of side-scrolling, platform racing game. \n\nPlayers race, chase, and rally their way through a brightly colored world, competing against their friends for the fastest times, entering daily races, and hunting for secrets and coins. \n\nThe game has three main modes: a surprising and fun single player adventure, a two to four player local party mode, and a new type of daily online competition, in which a new online track opens up daily to give you constant new opportunities for the top of the Leader Boards. \nFeatures: \n\n    Physics-based fun: Simple but effective physics deliver an addictive gaming experience. \n    Fun for one: Single player story mode with memorable characters and rich visuals. \n    Fun for many: Four player party mode that is easy for anyone to pick up and play. \n    Take on the world: Ghost race against any time from any track in the game. \n    Claim the top spot: Global and Friend-based Leader Boards let gamers compete against each other. \n    New type of daily competition: New tracks and Leader Boards opening each day. \n    Fully optimized: Steady 60 FPS, widescreen support, and blazing fast load times. \n    A complete package: 100+ tracks, four cars, and many game modes equals tons of fun!","torrent":{"xt":"urn:btih:6647de9ede0d6345a1087f11278f872b61ea7702","amp;dn":"MotoHeroz+-+WAJE.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6647de9ede0d6345a1087f11278f872b61ea7702","infoHashBuffer":{"type":"Buffer","data":[102,71,222,158,222,13,99,69,161,8,127,17,39,143,135,43,97,234,119,2]},"announce":[],"urlList":[]}}