{"title":"Bon Appetit, Y'all - Recipes and Stories from Three Generations","uid":12921627,"size":51680392,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6671ed8d967e39399c42053dcc3495c358e1560f&amp;dn=Bon+Appetit%2C+Y%27all+-+Recipes+and+Stories+from+Three+Generations+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1449422729,"description":"Bon Appetit, Y'all - Recipes and Stories from Three Generations of Southern Cooking (2008) (Epub &amp; Mobi) Gooner\r\n\r\nPublisher: Ten Speed Press (March 15, 2008)\r\nLanguage: English\r\nISBN-10: 1580088538\r\nISBN-13: 978-1580088534\r\n\r\nThe daughter and granddaughter of consummate Southern cooks, Virginia Willis is also a classically trained French chef. These divergent influences come together splendidly in Bon Appétit, Y'all, a modern Southern chef's passionate and utterly appealing homage to her culinary roots. Espousing a simple-is-best philosophy, Virginia uses the finest ingredients, concentrates on sound French technique, and lets the food shine in a style she calls &quot;refined Southern cuisine.&quot; More than 200 approachable and consistently delicious recipes are arranged by chapter into starters and nibbles; salads and slaws; eggs and dairy; meat, fowl, and fish main dishes; sides; biscuits and breads; soups and stews; desserts; and sauces and preserves. Collected here are stylishly updated Southern and French classics (New SouthernChicken and Dumplings, Boeuf Bourgignonne), rib-sticking, old-timey favorites (Meme's Fried Okra, Angel Biscuits), and perfectly executed comfort food (Mama's Apple Pie, Fried Catfish Fingers with Country Rémoulade). Nearly 100 photographs bring to life both Virginia's food and the bounty of her native Georgia. You'll also find a wealth of tips and techniques from a skilled and innovative teacher, and the stories of a Southern girl steeped to her core in the food, kitchen lore, and unconditional hospitality of her culinary forebears on both sides of the Atlantic. Bon Appétit, Y'all is Virginia's way of saying, &quot;Welcome to my Southern kitchen. Pull up a chair.&quot; Once you have tasted her food, you'll want to stay a good long while","torrent":{"xt":"urn:btih:6671ed8d967e39399c42053dcc3495c358e1560f","amp;dn":"Bon+Appetit%2C+Y%27all+-+Recipes+and+Stories+from+Three+Generations+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6671ed8d967e39399c42053dcc3495c358e1560f","infoHashBuffer":{"type":"Buffer","data":[102,113,237,141,150,126,57,57,156,66,5,61,204,52,149,195,88,225,86,15]},"announce":[],"urlList":[]}}