{"title":"TREK BOOPERS","uid":7981592,"size":45192992,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:674e819993090a999f39d2a894a41b70818aea70&amp;dn=TREK+BOOPERS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"davidamorse1701","files":60,"time":1357191639,"description":"What arrived in my mailbox was this rare, then much-soughtafter collector's item from the whole Star Trek phenomenon.\n\n The back liner notes state, these bloopers were rescued from old reel-to-reel audio tapes from a &quot;Hollywood garbage can&quot; and sold to a Star Trek collector... only after they created this album to cash in!  The rest of the liner notes detail the entire process of what &quot;Fifty-five apples, take one&quot; mean, why several of these tracks are painfully similar, and other info.\n\n What you get are 58 different bloopers and outtakes from four different episodes from the third and final season of &quot;Star Trek&quot;.  For those &quot;Trekkies&quot; out there who want to know which episodes, they are (in no particular order) &quot;Whom Gods Destroy&quot;, &quot;The Way To Eden&quot;, &quot;Let This Be Your Last Battlefield&quot;, and &quot;Turnabout Intruder&quot;.\n\n Mr. Spock (Leonard Nimoy) states at the end of Side 1, &quot;there's some rather strange activity taking place here.&quot;  That line from an episode perfectly capsulates this album.\n\n  Listen as the crew flub lines, assistant directors yelling &quot;BEEP&quot; to fill in the now famous phaser sound effect, Shatner swearing, space hippies singing, Scotty &quot;playing football&quot; on the bridge (?), a rather &quot;delirious&quot; Dr. Janice Lester that sounds awfully X-rated, and the final lines Nurse Chapel (Majel Barrett - the future Mrs. Gene Roddenberry) ever uttered on the show.\n\n If you're a casual fan or a rabid &quot;Trekkie&quot;, you'll find this a &quot;fascinating&quot; listen.  Live long and... oh, SHUT UP!\n","torrent":{"xt":"urn:btih:674e819993090a999f39d2a894a41b70818aea70","amp;dn":"TREK+BOOPERS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"674e819993090a999f39d2a894a41b70818aea70","infoHashBuffer":{"type":"Buffer","data":[103,78,129,153,147,9,10,153,159,57,210,168,148,164,27,112,129,138,234,112]},"announce":[],"urlList":[]}}