{"title":"Sculpture since 1945 (Art Ebook).pdf","uid":12982036,"size":29242626,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:688a281caceab7cd39d868a6bc096fc085a97376&amp;dn=Sculpture+since+1945+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1450043469,"description":"Universe | 1987 | Pdf | Eng | 160 pages | ISBN10 0876636652 | 27.8 MB\r\n\r\nSculpture has generally occupied a secondary role to painting in the Modern Movement. Yet the way in which the word &quot;sculpture&quot; has been stretched to include so many different forms of activity has been one of the most distinctive and controversial aspects of post-war art. Works such as Carl Andre's notorious &quot;bricks&quot; or Christo's &quot;wrappings&quot; of public buildings have provoked reactions which range from adulation to outrage, stimulating discussion about the very meaning and function of art itself.\r\n\r\nThese styles in the forefront of the avant-garde are only part of the rich variety of sculpture produced since the war. In Sculpture since 1945, Edward Lucie-Smith classifies the full range of movements and provides an explanation of their development and how they are related to one another. He begins by reflecting on the work of the early modernists — Auguste Rodin, Pablo Picasso, Marcel Duchamp and Jacob Epstein — and proceeds to look at the succeeding influences and revolutions in sculpture, from the Constructivist and neo-classical works of the immediate post-war years to the Minimalism, Pop, Conceptual and Land Art of the sixties and seventies and the return to figurative imagery of the 1980s. Many of the major sculptors — Henry Moore, Alberto Giacometti, Marino Marini, David Smith — are dealt with at length, and altogether some 200 artists are discussed.\r\n\r\nThis authoritative book is the first comprehensive survey of modern sculpture, and it will serve as an invaluable reference work for students, art historians and critics. The text is complemented by the many illustrations, which convey the aesthetic and provocative qualities that have made sculpture such a potent element of modern art","torrent":{"xt":"urn:btih:688a281caceab7cd39d868a6bc096fc085a97376","amp;dn":"Sculpture+since+1945+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"688a281caceab7cd39d868a6bc096fc085a97376","infoHashBuffer":{"type":"Buffer","data":[104,138,40,28,172,234,183,205,57,216,104,166,188,9,111,192,133,169,115,118]},"announce":[],"urlList":[]}}