{"title":"Mistress of the Throne by Ruchir Gupta","uid":9624087,"size":504561,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68e733b2dff2b7a5b4efbf1810df2a0f5ba22b8a&amp;dn=Mistress+of+the+Throne+by+Ruchir+Gupta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1392562247,"description":"\n1631. The Empress of India Mumtaz Mahal has died. Yet, rather than anoint one of his several other wives to take her place as Empress of India, Mughal King Shah Jahan anoints his seventeen-year-old daughter Jahanara as the next Queen of India.\n\nBearing an almost identical resemblance to her mother, Jahanara is the first ever daughter of a sitting Mughal King to be anointed queen. She is reluctant to accept this title, but does so in hopes of averting the storm approaching her family and Mughal India. Her younger siblings harbor extreme personalities from a liberal multiculturalist (who views religion as an agent of evil) to an orthodox Muslim (who views razing non-Muslim buildings as divine will).\n\nMeanwhile, Jahanara struggles to come to terms with her own dark reality: as the daughter of a sitting King, she is forbidden to marry. Thus, while she lives in the shadow of her parents unflinching love story, she is devastated by the harsh reality that she is forbidden to share such a romance with another.\n\nMistress of the Throne narrates the powerful story of one of Indias most opulent and turbulent times through the eyes of an unsuspecting character: a Muslim queen. It uses actual historical figures to illuminate the complexity of an era that has often been called Indias Golden Age.\n\nGenre: Fiction/Historical","torrent":{"xt":"urn:btih:68e733b2dff2b7a5b4efbf1810df2a0f5ba22b8a","amp;dn":"Mistress+of+the+Throne+by+Ruchir+Gupta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68e733b2dff2b7a5b4efbf1810df2a0f5ba22b8a","infoHashBuffer":{"type":"Buffer","data":[104,231,51,178,223,242,183,165,180,239,191,24,16,223,42,15,91,162,43,138]},"announce":[],"urlList":[]}}