{"title":"DJ Crazy Toones: It's A CT Experience [Ice Cube|WC|Xzibit|Snoop","uid":6098967,"size":2873947557,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:69946bf90598ca26b30775e9eb84611adb0ceaea&amp;dn=DJ+Crazy+Toones%3A+It%5C%27s+A+CT+Experience+%5BIce+Cube%7CWC%7CXzibit%7CSnoop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BladeRoNNeR","files":16,"time":1294887462,"description":"Music Videos : Hip-Hop / Rap : DVD quality\nTitle: DJ Crazy Toones: It's A CT Experience [The DVD Files]\nYear: 2007\nFormat: DVD (Promo)\nMy rating: 9.0/10\nFeaturing: Ice Cube | WC | Xzibit | Snoop | King Tee | SupaFly | MC Eiht | Kurupt | Daz Dillinger\n\nThe art of mixtape creation has been lost in recent years with the advent of computers making it mainstream and easy to create. Now it seems everyday there is a swag of crappy mixes overlaying existing tracks with other lyrics and various annoying 'DJ's' promoting their name by shouting over the track ... DJ Crazy Toones is an exception to this trend and has produced a mixtape to bring it all back!\n\nWest Coast legend DJ Crazy Toones has long been a staple in the West Coast rap scene, and the personal DJ of both Ice Cube &amp; WC. He is proud to present his first DVD release. Last years acclaimed Mixtape of this millenium; &quot;CT Experience&quot; was hailed by many as a breath of fresh air. He, DJ Skee &amp; DJ Reflex put together what can only be referred to as a classic street album featuring all exclusive music done specifically for this mixtape from artists including Ice Cube, The Game, Snoop Dogg, WC, Daz, Damani, Xzibit, MC Ren, King Tee, Jayo Felony, Soopafly, Young Maylay, Bad Lucc and many more encompassing the brightest and hottest talent on the West Coast.\n\nThe acclaim and support this release generated was enough to make DJ Crazy Toones to go one step further and do something quite unique; record, produce and present a DVD collection of the mixtape in visual form - Music Videos for each track! The CT experience is the product of his mastermind to do just that.\n\n{I had been hunting for a long time to find this as it is only a promo DVD it is rare to find. The additional files in the torrent are for my Media Center (folder.jpg, backdrop.jpg, mymovies.xml). If you are just wanting to burn to DVD you do not need these files, but if you want to run through your PC I would check out MediaBrowser that is used through Windows 7 Media Center. It is an awesome free addon for W7MC.}\n\n\nWawawawaaa...westsiiiiiide!!!","torrent":{"xt":"urn:btih:69946bf90598ca26b30775e9eb84611adb0ceaea","amp;dn":"DJ+Crazy+Toones%3A+It%5C%27s+A+CT+Experience+%5BIce+Cube%7CWC%7CXzibit%7CSnoop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69946bf90598ca26b30775e9eb84611adb0ceaea","infoHashBuffer":{"type":"Buffer","data":[105,148,107,249,5,152,202,38,179,7,117,233,235,132,97,26,219,12,234,234]},"announce":[],"urlList":[]}}