{"title":"Harry Guntrip: Schizoid Phenomena, Object-relations and the Self","uid":10236440,"size":14165413,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69cd495714a1d23d671d954d8fb12b98aee8c580&amp;dn=Harry+Guntrip%3A+Schizoid+Phenomena%2C+Object-relations+and+the+Self&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1401190599,"description":"Synopsis:\nBased on a series of clinical studies of schizoid problems, this book is a sequel to Harry Guntrip's theoretical study of the emergence of the schizoid problem, Personality Structure and Human Interaction (1961). It includes revised versions of earlier papers, and also much original material.\n\nReviews and Endorsements:\nIn Part 1, a description of the schizoid position is given, in terms of relation to the external world, internal states of ego disintegration and, the core of the problem, the dissociated and lost emotional heart of the total self.\nPart 2 reviews the theoretical development which makes it necessary to see manic-depressive problems in the light of the deeper and more subtle schizoid condition. Part 3, on &quot;The Nature of Basic Ego-Weakness&quot;, seeks to assess fully the importance of Winnicott's research into the earliest beginnings of ego development, as the infant slowly grows into psychic separation from the mother, a process that involves both the opportunity for individuation and also the risk of loss of relationship, as well as the risk of possibly permanent stunting of the ego development instead of growth of basic ego relatedness in the mentally healthy person.\nPart 4 explores the implications for psychotherapy of the study of the schizoid problem, particularly in the matter of the personal therapeutic relationship of therapist and patient. And finally, in Part 5, the review of theory is put on a broad foundation with a chapter on &quot;The Concept of Psychodynamic Science&quot; and another comparing the ego theories of Hartmann and the &quot;object-relational&quot; thinkers, Melanie Klein, Fairbairn, and Winnicott.\n &lt;a href=&quot;\nhttps://www.karnacbooks.com/Product.asp?PID=753&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.karnacbooks.com/Product.asp?PID=753&lt;/a&gt;","torrent":{"xt":"urn:btih:69cd495714a1d23d671d954d8fb12b98aee8c580","amp;dn":"Harry+Guntrip%3A+Schizoid+Phenomena%2C+Object-relations+and+the+Self","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69cd495714a1d23d671d954d8fb12b98aee8c580","infoHashBuffer":{"type":"Buffer","data":[105,205,73,87,20,161,210,61,103,29,149,77,143,177,43,152,174,232,197,128]},"announce":[],"urlList":[]}}