{"title":"DVD KidsCrew Special Edition Groen (Dutch)(5 movies) Vlinder TBS","uid":6049819,"size":3898469116,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:6aa64e4864b8e991151cf59b688a772c637c49d1&amp;dn=DVD+KidsCrew+Special+Edition+Groen+%28Dutch%29%285+movies%29+Vlinder+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Vlinder2","files":-1,"time":1292683132,"description":"DVD KidsCrew Special Edition Groen Dutch 5 movies       \n\n\n\n\n\n\nHoe tem je een draak &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/52147&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/52147&lt;/a&gt;\nDe jonge viking Hiccup woont op het eiland Berk, waar draken bevechten een manier van leven is. De intelligentie en de eigenwijze humor van de tiener vallen niet in goede aarde bij de stamleden en het stamhoofd... dat niemand minder is dan de vader van Hiccup. Maar wanneer Hiccup samen met andere Vikingjongens drakentraining krijgt, ziet hij zijn kans schoon om te bewijzen dat hij uit het goede hout gesneden is om krijger te worden. Wanneer hij echter een gewonde draak ontmoet, wordt zijn wereld ondersteboven gegooid, en wat begon als de enige gelegenheid voor Hiccup om zichzelf te bewijzen, verandert in een kans op een nieuwe toekomst voor de hele stam...\n\n**************************************************************\n\n\nDraken Jagers &lt;a href=&quot;\nhttp://www.drakenjagers.nl/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.drakenjagers.nl/&lt;/a&gt;\nAls het rijk van Lord Arnold bedreigd wordt door een vreselijke draak, gaat zijn nichtje ZoÃƒÂ© op zoek naar helden die hen kunnen helpen. Haar zoektocht leidt haar naar Gwizdo en Lian-Chu, die eigenlijk niet meer op draken jagen. ZoÃƒÂ© probeert de jagers toch te overtuigen\n**************************************************************\n\n\nMonsters vs Aliens &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/46711&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/46711&lt;/a&gt;\nWanneer Susan Murphy uit CaliforniÃƒÂ« geraakt wordt door een meteoor, groeit ze vijftien meter en wordt ze meteen bestempeld als monster, genaamd Ginormica. Het leger neemt haar gevangen in een geheim kamp. Hier blijken door de jaren heen meer monsters vastgehouden te worden. Ginormica maakt kennis met de briljante dokter Cockroach, halfaap-halfvis The Missing Link, de glibberige en onverwoestbare B.O.B., en een gigantische rups die Insectosaurus wordt genoemd. Er komt echter een onverwacht einde aan hun gevangenschap. Want wanneer de aarde wordt aangevallen door buitenaardse robots, is alle hoop van de mensheid gevestigd op de monsters om de wereld te beschermen.\n**************************************************************\n\n\nKung Fu Panda de geheimen van de vurige vijf &lt;a href=&quot;\nhttp://www.bol.com/nl/p/dvd/kung-fu-panda-geheimen-van-de-vurige-vijf/1002004006438085/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bol.com/nl/p/dvd/kung-fu-panda-geheimen-van-de-vurige-vijf/1002004006438085/index.html&lt;/a&gt;\nSkadoosh! Het verhaal gaat verder! OkÃƒÂ©, hij mag dan Tai Lung verslagen hebben, nu staat Drakenkrijger Po (Jack Black) voor de grootste uitdaging waarvoor Shifu (Dustin Hoffman) hem ooit gesteld heeft: Kung Fu leren aan een groep enthousiaste konijntjes uit de Vallei van de Vrede. Po mag dan inmiddels in staat zijn de meest boosaardige schurken het hoofd te bieden, hij voelt zich totaal niet op zijn gemak in een klaslokaal. Om de aandacht van zijn onrustige pupillen vast te vast te houden, valt hij terug op iets wat hem na aan zijn hart ligt: zijn uitgebreide Kung Fu-kennis. Hij vertelt de kids over de belangrijke lessen waardoor de Vijf zo goed werden in wat ze doen en konden uitgroeien tot de Kung Fu-meesters die ze nu zijn. Po komt er uiteindelijk achter dat hij de konijntjes door deze verhalen veel belangrijker dingen heeft geleerd dan hem ooit zou zijn gelukt met Kung Fu-oefeningen.\n**************************************************************\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/43097&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/43097&lt;/a&gt;\n\nDe film draait om Igor, de gebochelde lab-assistent van een doldwaze wetenschapper. Hij heeft zelf grote dromen om ooit eens net zo\nwetenschapper als zijn chef te worden, en de eerste prijs te winnen van de jaarlijkse Evil Science Fair. Hij creÃƒÂ«ert daartoe Eva, die bedoeld is om als monster het daglicht te zien. Echter de zaken lopen niet zoals ze vooraf ingeschat zijn. En Eva houdt eigenlijk meer van dansen en wil actrice worden...\n**************************************************************\n\n\n\n\nCover en label zitten erbij!\n\nHave fun met deze green edition!\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\nSOURCE : DVD5 \n\nAUDIO : \n[X] Dutch\n\n[ ] DTS [ ] 5.1 DD [X] 2.0 DD \nOndertitels : Geen\n \nGenre : Animatie\nKinderfilm\nThanks : coolkidweb \n\nTBS\n\nblack-sam ","torrent":{"xt":"urn:btih:6aa64e4864b8e991151cf59b688a772c637c49d1","amp;dn":"DVD+KidsCrew+Special+Edition+Groen+%28Dutch%29%285+movies%29+Vlinder+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6aa64e4864b8e991151cf59b688a772c637c49d1","infoHashBuffer":{"type":"Buffer","data":[106,166,78,72,100,184,233,145,21,28,245,155,104,138,119,44,99,124,73,209]},"announce":[],"urlList":[]}}