{"title":"James Morrison feat. Nelly Furtado - Broken Strings","uid":4820249,"size":147613700,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6b41ae000a22b3b49602e9a9b83c637dd6c304b6&amp;dn=James+Morrison+feat.+Nelly+Furtado+-+Broken+Strings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1238740649,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Broken Strings&quot; is the third single by James Morrison from his second studio album &quot;Songs for You, Truths for Me&quot;. It was released on December 8. The song is a duet with Canadian pop/R&amp;B singer-songwriter Nelly Furtado. The single became Morrison's most successful single to date, peaking in the top ten on many European charts, in the top three in the UK and Ireland and topped the charts in Germany and Switzerland.\n\nA music video in support of James Morrison's &quot;Broken Strings&quot; has made its world premiere on 17 November. The video features the English musician performing the new track with Nelly Furtado also appearing in the video. Micah Meisner directed the video. Parts of the video are inspired by the film &quot;Paris, Texas&quot;, while the reversed explosion is inspired by the film &quot;Insignificance&quot;. Nelly and James filmed their parts on different days. On the video, James is in a hotel room and Nelly is behind the glass of the room, James starts to sing the song and when Nelly starts to sing her part, behind the glass, things begin to break, such as the guitar, the television and more. When the video is ending, everything that is broken goes back to normal and Nelly disappears.\n\nThe song received positives reviews from the critics.\n\nMichael Menachem from Billboard Magazine says:\n\nBroken Strings&quot; offers two of the most vulnerable performances yet from each artist, venting an obvious metaphor for the struggles at the close of a relationship beyond repair. Their voices are richly expressive, harmonizing in an aural marriage as the midtempo ballad quietly builds to an intense climax as they belt: &quot;Oh the truth hurts and lies worse/How can I give anymore when I love you a little less than before?&quot; Producer extraordinaire Mark Taylor energizes &quot;Broken Strings&quot; with just enough accompaniment to showcase the paralyzing performances. Morrison is a staple hitmaker overseas, but in the States, phenomenal singles like &quot;You Give Me Something&quot; and &quot;Wonderful World&quot; were snubbed. Furtado's visibility has already vaulted the song to most-added status at adult top 40. At last, Morrison gets his due.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:6b41ae000a22b3b49602e9a9b83c637dd6c304b6","amp;dn":"James+Morrison+feat.+Nelly+Furtado+-+Broken+Strings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b41ae000a22b3b49602e9a9b83c637dd6c304b6","infoHashBuffer":{"type":"Buffer","data":[107,65,174,0,10,34,179,180,150,2,233,169,184,60,99,125,214,195,4,182]},"announce":[],"urlList":[]}}