{"title":"Aleksandr Sokurov - Krug vtoroy AKA The Second Circle (1990)","uid":4493591,"size":733948031,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6c5595d9ecc6e1050dacbc0f19dfa887d13857bf&amp;dn=Aleksandr+Sokurov+-+Krug+vtoroy+AKA+The+Second+Circle+%281990%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Pirate344","files":2,"time":1226085525,"description":"Aleksandr Sokurov - The Second Circle\n\nA man tries to come to terms with his father's death and to deal with the mundane details of his burial in a society cut off from spirituality.\n\nA solitary figure trudges through the inclement weather of a vast, remote Siberian wilderness. An unyielding gust of wind brings the young man (Pyotr Aleksandrov) to his knees as he attempts to avert the caustic, sustained force of the snowstorm, momentarily obscuring him from view, erased from the harsh and desolate landscape. The stark, monochromatic image of the film then cuts to an ironically appropriate impersonal and nondescript official title sequence, as the premature sound of a knock on a door seemingly intrudes on the necessity to present information on the film's certification. It is a subtle reminder of life's evolving process: the intrusive nature and unexpected inevitability of death. The film reopens to a jarring, oddly lit image of the gaunt young man standing by the foot of his father's bed in a cramped and squalid apartment. The dispatched medical technicians dispassionately confirm his father's death from natural causes, but explain that they cannot issue a death certificate, pragmatically remarking &quot;You should have placed him in a hospital. Everything would have been easier then.&quot; Left alone in the apartment, the son compassionately observes his father's inanimate countenance before preparing his father's body for burial: selecting his best suit, bathing him in the snow in the absence of running water in the apartment, transporting his father's body to the outpatient clinic for a death certificate examination. Without knowing the actual cause of death, the doctor suggests a beaurocratically expedient determination of cancer, rationalizing that &quot;now everything is considered cancer.&quot; Having been issued a death certificate, the son then meets with the undertaker (Nadezhda Rodnova), an abrasive and insensitive businesswoman who is quick to assess the family's limited means and treats the overwhelmed young man with disrespect and open hostility, especially as the financially strapped son begins to question some ancillary costs included in the itemized funeral bill. As the dutiful son continues to encounter emotional isolation, antipathy, and an impersonal commodification of the burial process, can he restore the sanctity of the ritual and retain the dignity of his beloved father's memory?\n\nAleksandr Sokurov creates a haunting, austere, and emotionally honest examination of death, bereavement, and loneliness in The Second Circle. The title of the film refers to the second circle of hell depicted in The Divine Comedy, Volume I: Inferno by Dante Alighieri, the realm of damnation where the souls (of the lustful) are punished by the eternal lashing of a raging, infernal storm (note the referential parallel imagery of the opening blizzard scene). Using high contrast, raw, monochromatic imagery, and spare, but deliberate use of close-up shots, Sokurov reflects the soul's innate longing for compassion, human decency, and spiritual communion in an increasingly amoral, apathetic, and materialistic society: the atypical rapid intercutting of medium and long shots as the son washes his father's body in the snow; the innocent reassurance of the doctor's young son, Seyozha, who attempts to comfort him by saying &quot;everything's going to be all right&quot;; the chaotic and near violent bus ride that results in theft; the extended shot of the son's long, melancholic gaze after opening his father's eyes for a final glimpse. Inevitably, the doctor's parting words, &quot;the most terrible thing has been left behind&quot; echoes the resigned sentiment of the epilogue verse &quot;Lucky are the nearest and dearest of ours who died before us&quot; - a prophetic observation of the painful and isolating process of grief, longing, and survival.\n &lt;a href=&quot;\nhttp://bayimg.com/image/halpfaabm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/halpfaabm.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/image/halpiaabm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/halpiaabm.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/image/halphaabm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/image/halphaabm.jpg&lt;/a&gt;\n\n\n\n","torrent":{"xt":"urn:btih:6c5595d9ecc6e1050dacbc0f19dfa887d13857bf","amp;dn":"Aleksandr+Sokurov+-+Krug+vtoroy+AKA+The+Second+Circle+%281990%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c5595d9ecc6e1050dacbc0f19dfa887d13857bf","infoHashBuffer":{"type":"Buffer","data":[108,85,149,217,236,198,225,5,13,172,188,15,25,223,168,135,209,56,87,191]},"announce":[],"urlList":[]}}