{"title":"[Synth / Electronic] Komputer - THE WORLD OF TOMORROW","uid":3555356,"size":64212584,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6cba7c9ac0e09f8e61105893f8a4f63d72c5f964&amp;dn=%5BSynth+%2F+Electronic%5D+Komputer+-+THE+WORLD+OF+TOMORROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xenu dot net","files":12,"time":1163203863,"description":"Real Name:\tSimon Leonard, David Baker\nURLs:\thttp://www.komputer.org.uk/\nAliases:\tFortran 5, I Start Counting, John Came\n\nKomputer are Fortran 5 taking a more retro, electronic &amp;#039;Kraftwerk&amp;#039; sound.\n\nKomputer have a long history in electronic music which sometimes leaned toward the avantgarde and sometimes towards the finest example in their respect to Kraftwerk, Telex and YMO as the most obvious leanings... Of course there&amp;#039;s danger of plagiarism with every electronic act as we know it but Komputer albeit so obviously rearranging, somehow maintained the innovation and difference to the original blueprints, in their own right producing unique and often humouristic music...\n\nOriginally formed as avant-electronic pop duo I Start Counting releasing plenty of singles and couple of excellent state-of-technology albums, then resurrecting as equally thrilling Fortran 5 on the verge of the nineties rave-culture. Komputer finally settled in 1996. with their self-titled debut EP which launched The Model-esque hit &amp;#039;Valentina Tereshkova&amp;#039; (also known as &amp;#039;Valentina&amp;#039;)... One more single followed that same year, &amp;#039;Looking Down on London&amp;#039;, before &amp;#039;The World of Tomorrow&amp;#039;, in 1998. Their first proper long-player is also worth noting tracks like &amp;#039;Bill Gates&amp;#039;, &amp;#039;Terminus Interminus&amp;#039; and &amp;#039;More Automation&amp;#039; furtherly streching Kraftwerk into Komputer&amp;#039;s subversive form of recycling... In 2002 Komputer released their second, long awaited album, but unlike the soothing synth-pop of &amp;#039;Tomorrow&amp;#039;, &amp;#039;Market Led&amp;#039; is rather abbrasive take on vynil noise sampled into obscure ambience... By recognising themselves in the underground&amp;#039;s recent fashions, Komputer slowly drifted apart from their earlier infatuations...\n\n\n  \t&quot;Underwater cities, giant hovercraft, (something factories), trips to the stars... THE WORLD OF TOMORROW&quot; are the introductory lines of the first track, continuing on into colonies on Mars, flying cars, &quot;Jetson&quot;-like walkways (remember those?), among other things, a typical glimpse into the future -- what we expected to 50 or 60 years ago to be happening &quot;later on in the 90&amp;#039;s&quot;, at least. Like a Jules Verne or Ray Bradbury novel, Komputer&amp;#039;s &quot;The World of Tomorrow&quot; provides a glimpse into a future we will probably never see. Yet most of the futuristic imagery is not in the lyrics (the song &quot;World of Tomorrow&quot; could be just about the only &amp;#039;sci-fi&amp;#039; song in here), but rather the sound. While it may sound as if Komputer is &quot;ripping off&quot; the traditional executions of Kraftwerk, few critics of Komputer&amp;#039;s music see the truly unique half of the music. All of the music, of course, is entirely electronic, vocoders making frequent appearances (and possibly a Moog or two were used), especially prevalent &quot;Bill Gates&quot;, a parody of Kraftwerk&amp;#039;s &quot;The Man Machine&quot;, where a robotic voice repeats &quot;Bill Gates, Bill Gates, Bill Gates&quot; , resulting in something rather entertaining.\n\nThis album does have its many fine points, too. Some of the music in the songs -- Valentina, Terminus, Looking Down On London, and especially The Perfect Pop Band -- remind me of semi-early video game music, usually the buzzing, bleeping, sawtoothing chip music that would get stuck in your head if that game was especially addicting and imaginative. So, for me at least, Komputer&amp;#039;s chippy, Moogy, distant rhythms and primitive yet effective textures stir some kind of nostalgic thoughts in my head, somehow connecting my imagination to an impossibly futuristic world planted from reading too many sci-fi novels and playing too many sci-fi based video games. \n\n\n\nTracklisting:\n\n1 \t  \tThe World Of Tomorrow (4:11)\n2 \t  \tMore Automation (5:07)\n3 \t  \tBill Gates (4:26)\n4 \t  \tValentina (4:53)\n5 \t  \tLooking Down On London (4:14)\n6 \t  \tTerminus Interminus (7:40)\n7 \t  \tSingapore (4:50)\n8 \t  \tThe Perfect Pop Band (4:09)\n9 \t  \tKomputer Pop (5:17)\n10 \t  \tMotopia (3:00)\n11 \t  \tWe Are Komputer (Version) (2:41)\n\n\n\n\nEncoded with lame 3.97 -V4 --vbr-new (~170 kbit/s) and should be close to perceptual transparency.\n\n\nKids, always remember Xenu is your friend.\n\nwww.xenu.net\n\n \n\n","torrent":{"xt":"urn:btih:6cba7c9ac0e09f8e61105893f8a4f63d72c5f964","amp;dn":"%5BSynth+%2F+Electronic%5D+Komputer+-+THE+WORLD+OF+TOMORROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cba7c9ac0e09f8e61105893f8a4f63d72c5f964","infoHashBuffer":{"type":"Buffer","data":[108,186,124,154,192,224,159,142,97,16,88,147,248,164,246,61,114,197,249,100]},"announce":[],"urlList":[]}}