{"title":"Markus Zusak - A Menina que Roubava Livros {BrazilTorrents.com}","uid":5424658,"size":2689785,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d5e2f064cb7504edea519c13ace8eb4b16ef8d0&amp;dn=Markus+Zusak+-+A+Menina+que+Roubava+Livros+%7BBrazilTorrents.com%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SkaTeMasTer","files":2,"time":1268209835,"description":"\n\nEntre 1939 e 1943, Liesel Meminger encontrou a Morte trÃƒÂªs vezes. E saiu suficientemente viva das trÃƒÂªs ocasiÃƒÂµes para que a prÃƒÂ³pria, de tÃƒÂ£o impressionada, decidisse nos contar sua histÃƒÂ³ria, em A Menina que Roubava Livros, livro hÃƒÂ¡ mais de um ano na lista dos mais vendidos do The New York Times. Desde o inÃƒÂ­cio da vida de Liesel na rua Himmel, numa ÃƒÂ¡rea pobre de Molching, cidade desenxabida prÃƒÂ³xima a Munique, ela precisou achar formas de se convencer do sentido da sua existÃƒÂªncia. Horas depois de ver seu irmÃƒÂ£o morrer no colo da mÃƒÂ£e, a menina foi largada para sempre aos cuidados de Hans e Rosa Hubermann, um pintor desempregado e uma dona de casa rabugenta. Ao entrar na nova casa, trazia escondido na mala um livro, O Manual do Coveiro. Num momento de distraÃƒÂ§ÃƒÂ£o, o rapaz que enterrara seu irmÃƒÂ£o o deixara cair na neve. Foi o primeiro de vÃƒÂ¡rios livros que Liesel roubaria ao longo dos quatro anos seguintes. E foram estes livros que nortearam a vida de Liesel naquele tempo, quando a Alemanha era transformada diariamente pela guerra, dando trabalho dobrado ÃƒÂ  Morte. O gosto de rouba-los deu ÃƒÂ  menina uma alcunha e uma ocupaÃƒÂ§ÃƒÂ£o; a sede de conhecimento deu-lhe um propÃƒÂ³sito. E as palavras que Liesel encontrou em suas pÃƒÂ¡ginas e destacou delas seriam mais tarde aplicadas ao contexto a sua prÃƒÂ³pria vida, sempre com a assistÃƒÂªncia de Hans, acordeonista amador e amÃƒÂ¡vel, e Max Vanderburg, o judeu do porÃƒÂ£o, o amigo quase invisÃƒÂ­vel de quem ela prometera jamais falar. HÃƒÂ¡ outros personagens fundamentais na histÃƒÂ³ria de Liesel, como Rudy Steiner, seu melhor amigo e o namorado que ela nunca teve, ou a mulher do prefeito, sua melhor amiga que ela demorou a perceber como tal. Mas sÃƒÂ³ quem estÃƒÂ¡ ao seu lado sempre e testemunha a dor e a poesia da ÃƒÂ©poca em que Liesel Meminger teve sua vida salva diariamente pelas palavras, ÃƒÂ© a nossa narradora. Um dia todos irÃƒÂ£o conhece-la. Mas ter a sua histÃƒÂ³ria contada por ela ÃƒÂ© para poucos. Tem que valer a pena.\n\n* Editora: IntrÃƒÂ­nseca\n* Autor: MARKUS ZUSAK\n* ISBN: 9788598078175\n* Origem: Nacional\n* Ano: 2007\n* EdiÃƒÂ§ÃƒÂ£o: 1\n* NÃƒÂºmero de pÃƒÂ¡ginas: 494\n* Acabamento: Brochura\n* Formato: MÃƒÂ©dio\n\n\n\n\n\n\nBOOK COVER: http://eel.com.br/share.php?id=88AE_4B8D55D0\n\nSOURCE: http://braziltorrents.com/torrents.php?id=349","torrent":{"xt":"urn:btih:6d5e2f064cb7504edea519c13ace8eb4b16ef8d0","amp;dn":"Markus+Zusak+-+A+Menina+que+Roubava+Livros+%7BBrazilTorrents.com%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d5e2f064cb7504edea519c13ace8eb4b16ef8d0","infoHashBuffer":{"type":"Buffer","data":[109,94,47,6,76,183,80,78,222,165,25,193,58,206,142,180,177,110,248,208]},"announce":[],"urlList":[]}}