{"title":"Chicago - Live In Tronto 1969 (2014) [Teichiku Records] FLAC Beo","uid":10679835,"size":334082588,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6ddee15640b513229e10e70737761a834cb8b47f&amp;dn=Chicago+-+Live+In+Tronto+1969+%282014%29+%5BTeichiku+Records%5D+FLAC+Beo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Beolab1700","files":18,"time":1407019834,"description":"[center]\n\n[size=5]Chicago - Live In Tronto 1969 (2014) [Teichiku Records] FLAC Beolab1700[/size]\n\n[IMG]http://i.imgur.com/MptzhCm.jpg[/IMG]\n\n---------------------------------------------------------------------\nChicago - Live In Tronto 1969 [Teichiku Records, TECX-25272]\n---------------------------------------------------------------------\n\nArtist...............: Chicago\nAlbum................: Live In Tronto 1969\nGenre................: Rock\nSource...............: CD\nYear.................: 2014\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 60 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\nInformation..........: CD IMAGE - LOG - CUE - SCANS\n\nPosted by............: Beolab1700 on 01/08/2014\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. Once Or Twice - 3:04\n2. Your Are On My Mind - 3:22\n3. Skin Tight - 3:21\n4. If You Leave Me Now - 3:58\n5. Together Again - 3:53\n6. Another Rainy Day In New York City - 3:04\n7. Mama Mama - 3:33\n8. Scrapbook - 3:32\n9. Gently I'll Wake You - 3:36\n10. You Get It Up - 3:38\n11. Hope For Love - 3:03\n\n---------------------------------------------------------------------\n\nAlthough it may be difficult to believe now, in the late Sixties and early Seventies Chicago were something of a phenomenon. Their debut LP. b'Chicago Transit Authority', was certified platinum in the US, something no other CBS artist had ever achieved, even though the label boasted such names as Bob Dylan and Simon &amp; Garfunkel. Their second, simply titled 'Chicago', repeated the commercial success of their first, and singles from both sold strongly either side of the Atlantic.\n\nAs time passed, their music mellowed and interest waned, the critical acclaim turned to critical reviews, and although Chicago continued to record right through the Seventies and Eighties, they have never recaptured the excitement generated by those early releases. All but one of the band's original line-up hailed from the city which gave them their name. Their early days were spent largely unnoticed in the dingy bars and clubs of the Midwest, but a move to the West coast in 1968 proved crucial to their later success.\n\nHere they linked up with James William Guercio, who had established his credentials through production work with Blood, Sweat and Tears. Guercio not only secured the band dates at prestigious West coast venues, he also negotiated their recording contract with CBS. The volatile political scene of the late Sixties provided the other key element of their success. During 1968, protests at America's involvement in Vietnam were at their height, and racial tension was at fever pitch.\n\nDemonstrations outside the Democratic Convention in Chicago turned into full scale riots when police used tear-gas and clubs to disperse the crowds. Recordings of protesters were incorporated into one of the numbers on Chicago's debut LP. and this move, coupled with lyrics informed by the revolutionary rhetoric of the times, completed their identification with both their home town and the counter-culture. Their music had an exciting, innovative feel, and was probably the most successful attempt ever to marry the diverse elements of jazz, rock and white soul.\n\nIts precise brass arrangements blended with lengthy jazz guitar solos appealed to a late Sixties audience constantly searching for a more sophisticated sound. This recording of an early live performance at one of the famed Toronto Rock Festivals provides evidence of the band's ability and power.\n\nOn stage, although they obviously sought to reproduce the often complex arrangements arrived at the studio, they were never afraid to cut loose and explore the possibilities of the'jazzier side of their music. Faithful renditions of their hit singles '25 Or 6 To 4', 'Does Anybody Really Know What Time It Is? and the Steve Winwood penned 'I'm A Man' contrast with the looser improvisational approach employed on 'Liberation', the number which closes the set.\n\nThe shifting textures of this lengthy instrumental are epitomised by Terry Kath's exhilarating guitar - a key component of Chicago's characteristic sound and one sadly lost forever with his death in a firearms accident in 1978. Anyone with a taste for Chicago's early work will welcome this opportunity to hear the band run through these blistering versions of their best-loved numbers. Their unqiue blend of widely differing musical styles set apart from almost everyone around them - in their own distinctive way, Chicago were themselves a minor revolution.\n\n---------------------------------------------------------------------\n[/center]\n","torrent":{"xt":"urn:btih:6ddee15640b513229e10e70737761a834cb8b47f","amp;dn":"Chicago+-+Live+In+Tronto+1969+%282014%29+%5BTeichiku+Records%5D+FLAC+Beo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ddee15640b513229e10e70737761a834cb8b47f","infoHashBuffer":{"type":"Buffer","data":[109,222,225,86,64,181,19,34,158,16,231,7,55,118,26,131,76,184,180,127]},"announce":[],"urlList":[]}}