{"title":"The Small Faces - Collection 2 CD [2008]  FLAC","uid":6785299,"size":440609302,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6e234a836bbabfee8793075702c1011c5ad942ad&amp;dn=The+Small+Faces+-+Collection+2+CD+%5B2008%5D++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"keeybee","files":42,"time":1320020284,"description":"Please seed!\n\nThe Small Faces were an English rock and roll band from East London, heavily influenced by American rhythm and blues. The group was founded in 1965 by members Steve Marriott, Ronnie Lane, Kenney Jones, and Jimmy Winston, although by 1966 Winston was replaced by Ian McLagan as the band's keyboardist.\n\nThe band is remembered as one of the most acclaimed and influential mod groups of the 1960s. With memorable hit songs such as &quot;Itchycoo Park&quot;, &quot;Lazy Sunday&quot;, &quot;All or Nothing&quot;, &quot;Tin Soldier&quot;, and their concept album Ogdens' Nut Gone Flake, they later evolved into one of the UK's most successful psychedelic acts before disbanding in 1969. After the Small Faces disbanded, three of the members were joined by Ronnie Wood as guitarist, and Rod Stewart as their lead\nvocalist, both from The Jeff Beck Group, and the new line-up was renamed Faces.A revived version of the original Small Faces existed from 1975 to 1978.\n\nSmall Faces are also acknowledged as being one of the biggest original influences on the Britpop movement of the 1990s. Despite the fact the band were together just four years in their original incarnation, the Small Faces' music output from the mid to late sixties remains among the most acclaimed British mod and psychedelic music of that era. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Small_Faces&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Small_Faces&lt;/a&gt;\n\nNOTE: I've included a studio version of &quot;All or Nothing&quot; taken from the album\nThe British Invasion : The History of British Rock\n\n\nThe Small Faces - Collection CD1\n2008\n\n01  The Small Faces - Collection CD1 - Itchycoo Park\n02  The Small Faces - Collection CD1 - All Or Nothing [Live]\n03  The Small Faces - Collection CD1 - The Universal\n04  The Small Faces - Collection CD1 - Afterglow (Of Your Love)\n05  The Small Faces - Collection CD1 - I'm Only Dreaming\n06  The Small Faces - Collection CD1 - The Autumn Stone\n07  The Small Faces - Collection CD1 - Mad John\n08  The Small Faces - Collection CD1 - Feeling Lonely\n09  The Small Faces - Collection CD1 - Happydaystoytown\n10  The Small Faces - Collection CD1 - Rene\n11  The Small Faces - Collection CD1 - Things Are Going To Get Better\n12  The Small Faces - Collection CD1 - Picaninny\n\nThe Small Faces - Collection CD2\n2008\n\n01  The Small Faces - Collection CD2 - Lazy Sunday\n02  The Small Faces - Collection CD2 - Tin Soldier\n03  The Small Faces - Collection CD2 - Here Comes The Nice\n04  The Small Faces - Collection CD2 - If I Were A Carpenter [Live]\n05  The Small Faces - Collection CD2 - I Can't Make It\n06  The Small Faces - Collection CD2 - Every Little Bit Hurts\n07  The Small Faces - Collection CD2 - Collibosher\n08  The Small Faces - Collection CD2 - Something I Want To Tell You\n09  The Small Faces - Collection CD2 - I Feel Much Better\n10  The Small Faces - Collection CD2 - Happiness Stan\n11  The Small Faces - Collection CD2 - Red Balloon\n12  The Small Faces - Collection CD2 - The Journey\n &lt;a href=&quot;\nhttp://www.weton.nl/overlay.php?id=cd5989&amp;changelang=en&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.weton.nl/overlay.php?id=cd5989&amp;changelang=en&lt;/a&gt;","torrent":{"xt":"urn:btih:6e234a836bbabfee8793075702c1011c5ad942ad","amp;dn":"The+Small+Faces+-+Collection+2+CD+%5B2008%5D++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e234a836bbabfee8793075702c1011c5ad942ad","infoHashBuffer":{"type":"Buffer","data":[110,35,74,131,107,186,191,238,135,147,7,87,2,193,1,28,90,217,66,173]},"announce":[],"urlList":[]}}