{"title":"[Title Boxing DVD] Vol 18 - How To Effectively Lose Weight For B","uid":4589843,"size":373295010,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6f055872ff0c18784ced5e2d1e52cc7375ac8963&amp;dn=%5BTitle+Boxing+DVD%5D+Vol+18+-+How+To+Effectively+Lose+Weight+For+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fuminxue","files":1,"time":1229786503,"description":"The mysterious &quot;missing&quot; video from the collection. Not great to watch, poor production value, but lots of great information.\n\nDVD - How to Effectively Lose Weight for Boxing\n\nPermanent Weight Loss Dynamics and Nutrition Guidelines for Every Athlete\n\nWith the exception of the extremely elite, every athlete - at every level - is looking to achieve top physical form, lose weight and keep it off.\n\nJustin Fortune, professional trainer and conditioning coach, along with Freddie Roach, former top ranked boxer and hall-of-fame trainer for the Wild Card Boxing Gym in Hollywood, California, takes you through the nutrition, diet and weight loss recommendations that have proved successful for hundreds of former and current amateurs, professionals and world champions.\n\nLearn what foods to eat and avoid; meal frequency and portions, nutritional requirements, diet do's and don'ts, and much, much more. No fad or gimmick, discover tried-and-true principles and life-changing habits that have been the building blocks of boxers, athletes and nonathletes for years.\n\nComplete with a comprehensive diet and nutrition program plus a bonus training and workout recommendation list to help maintain ideal body weight upon reaching the goal.","torrent":{"xt":"urn:btih:6f055872ff0c18784ced5e2d1e52cc7375ac8963","amp;dn":"%5BTitle+Boxing+DVD%5D+Vol+18+-+How+To+Effectively+Lose+Weight+For+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f055872ff0c18784ced5e2d1e52cc7375ac8963","infoHashBuffer":{"type":"Buffer","data":[111,5,88,114,255,12,24,120,76,237,94,45,30,82,204,115,117,172,137,99]},"announce":[],"urlList":[]}}