{"title":"Watermelons: The Green Movement's True Colors","uid":11608083,"size":374833,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6fa86df21755e195f31807b7d884d4f212643018&amp;dn=Watermelons%3A+The+Green+Movement%27s+True+Colors&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1417417781,"description":"British author James Delingpole tells the shocking story of how an unholy mix of junk science, green hype, corporate greed and political opportunism led to the biggest - and most expensive - outbreak of mass hysteria in history.\n\nIn Watermelons, Delingpole explains the Climategate scandal, the cast of characters involved, their motives and methods. He delves into the background of the organizations and individuals who have sought to push global warming to the top of the political agenda, showing that beneath their cloak of green lurks a heart of red.\n\nWatermelons shows how the scientific method has been sacrificed on the altar of climate alarmism. Delingpole mocks the green movement's pathetic record of apocalyptic predictions, from the &quot;population bomb&quot; to global cooling, which failed to materialize. He reveals the fundamental misanthropy of green ideology, &quot;rooted in hatred of the human species, hell bent on destroying almost everything man has achieved&quot;.\n\nDelingpole gives a refreshing voice to widespread public skepticism over global warming, emphasising that the &quot;crisis&quot; has been engineered by people seeking to control our lives by imposing new taxes and regulations. &quot;Your taxes will be raised, your liberties curtailed and your money squandered to deal with this 'crisis'&quot;, he writes.\n\nAt its very roots, argues Delingpole, climate change is an ideological battle, not a scientific one. Green on the outside, red on the inside, the liberty-loathing, humanity-hating &quot;watermelons&quot; of the modern environmental movement do not want to save the world. They want to rule it","torrent":{"xt":"urn:btih:6fa86df21755e195f31807b7d884d4f212643018","amp;dn":"Watermelons%3A+The+Green+Movement%27s+True+Colors","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fa86df21755e195f31807b7d884d4f212643018","infoHashBuffer":{"type":"Buffer","data":[111,168,109,242,23,85,225,149,243,24,7,183,216,132,212,242,18,100,48,24]},"announce":[],"urlList":[]}}