{"title":"Chase Your Shadow -The Trials of Oscar Pistorius - John Carlin","uid":11666709,"size":1146083,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:704c1a68c0fe937d5c88c206a834ccfb974e027b&amp;dn=Chase+Your+Shadow+-The+Trials+of+Oscar+Pistorius+-+John+Carlin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1418067901,"description":"In Chase Your Shadow, journalist and author John Carlin tells the gripping story of Oscar Pistorius's tragic journey from sporting icon to accused murderer.\n\nBefore Valentine's Day of 2013, Pistorius was best known as an extraordinary athlete, the 'Blade Runner' who became the first amputee in history to compete in the Olympics. Everything changed after he shot his girlfriend Reeva Steenkamp dead in the early hours of 14 February. Overnight, the Olympian's status as a role model was replaced by tales of erratic behaviour and a violent dark side.\n\nHis seven-month trial was broadcast live around the globe, its twists and turns captivating millions. Carlin, who followed the drama inside the courtroom, provides a vivid first-hand account of Pistorius's wrenching emotional breakdowns, the merciless interrogation to which he was submitted by the prosecutor, and the highly controversial judgment.\n\nCarlin paints a portrait of a complex personality, a man whose life story reveals extremes of courage and insecurity, ambition and vulnerability, generosity and dangerous hot-headedness.\n \nNot since the O. J. Simpson case has the world been more riveted by a champion's heroic rise and calamitous fall","torrent":{"xt":"urn:btih:704c1a68c0fe937d5c88c206a834ccfb974e027b","amp;dn":"Chase+Your+Shadow+-The+Trials+of+Oscar+Pistorius+-+John+Carlin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"704c1a68c0fe937d5c88c206a834ccfb974e027b","infoHashBuffer":{"type":"Buffer","data":[112,76,26,104,192,254,147,125,92,136,194,6,168,52,204,251,151,78,2,123]},"announce":[],"urlList":[]}}