{"title":"Flick Soccer Android","uid":6796310,"size":21120888,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:70cfacea3ad577b2623edfdf497633559c9442e2&amp;dn=Flick+Soccer+Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".BONE.","files":-1,"time":1320465361,"description":"Use Flick Soccer's unique 'after-touch' ball control to try and hit the target like a real Pro.\nOnly Flick Soccer gives you this level of complete control and pinpoint accuracy.\nFeaturing 5 modes of play, gorgeous graphics and an intelligent goalkeeper, Flick Soccer really is one of a kind.\nFeatures\n* Full Fat Flick Controls mean everyone can play! \n* Shoot for insane scores in Quickshot mode, it's you vs the keeper.\n* Take it to the limit in Endurance mode, set piece action with bonus items!\n* Try out Challenge mode for the ultimate skill contest.\n* Have you got the accuracy to hit the bar? Find out in Crossbar mode.\n* Smash It! breaking glass panels against the clock. \n* Unbelievably accurate flick controls for stunning top-corner shots.\n* The most realistic goalkeeper on the Android Market.\n* Interactive defenders will jump and react to shots.\n* Gorgeous visuals and immersive sound\nThis season there will be a new champion walking away with the title!\n\nWhat the Press Say\nTapscape: &quot;Flick Soccer is a flawless handheld game.&quot;\nEdge: &quot;Flick Soccer has a great way of getting players into the zone quickly, and keeping them there... in full flow, it can provide a magical experience.&quot;\nEurogamer: &quot;just like Flick Golf, the tough part is finding the time to stop playing.&quot;\nPocket Gamer: &quot;If you're a fan of flicking balls towards targets - and, let's face it, who isn't? - this is the best way to do it.&quot;\n\nWhat's new:\nFixed issue with audio causing Dual Core devices running 2.3.x to crash.\nAddresses issues with Samsung Galaxy S2.","torrent":{"xt":"urn:btih:70cfacea3ad577b2623edfdf497633559c9442e2","amp;dn":"Flick+Soccer+Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70cfacea3ad577b2623edfdf497633559c9442e2","infoHashBuffer":{"type":"Buffer","data":[112,207,172,234,58,213,119,178,98,62,223,223,73,118,51,85,156,148,66,226]},"announce":[],"urlList":[]}}