{"title":"Marc Almond - Fantastic Star (1996) @flac","uid":5631765,"size":630801374,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:716d6bc446d59ed85339365ceabdf3d4f24b8583&amp;dn=Marc+Almond+-+Fantastic+Star+%281996%29+%40flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alekow1","files":34,"time":1276713161,"description":"Marc Almond's 'Fantastic Star' explores through the musical styles of 'Electro Cabaret' ('Out There'), 'Techno-Burlesque' ('Brilliant Creatures') and 'Glam Torch Rock 'N' Roll' ('The Idol'/'On The Prowl'etc.), a tightly structured album based on technology amd strong lyrical themes, the multi-faceted nature of the music &amp; entertainment industry and the complex issues and pitfalls involved with fame, publicity and artistic creativity through the lives of Almond's idols 'all fallen'.\n\nA 16 track production 'tour de force' form NYC to London, 'Fantastic Star' introduces Mike Throne, Martyn Ware (Heaven 17), Mike Hedges, The Beatmasters, Bizarre Inc. and UK Club DJ Mrs Wood to the remixing and production duties with lyrical collaborations from John Coxon, Neal Whitmore (Neal X formely of SS-Sputnik), Steve Nieve and Mrs Wood all working together to further Almond's:\n\nThe opening track, the 'trance' inspired 'Caged' produced by Martyn Ware, starts with some exotic Middle Eastern synth patterns and atmospheric textures set to a pulsating electro-beat. Check out 'Dancing In A Golden Cage' the B-side to 'The Days Of Pearly Spencer' (YZ638CDX9031) released in 1991. 'Out There' recalls Soft Cell's minimalist 'Northern Soul' electro period (a 1990's 'Fun City'?) complete with female backing vocals by BETTY (a 1990's 'Viscous Pink Phenomena'?). Thorne supplies the remix duties and is best known for Soft Cell's production credentials from 1981-1983. 'The Idol Parts (1 &amp; 2) All Gods Fall'is razor sharp both lyrically and musically, fusing clever sampling, (check out the inventive Soft Cell electro classic 'Tainted Love' manipulation), with additional backing vocals once again by BETTY. The cutting lyrics brutally revealing the duality of a teenage fans love/hate (wolf/lamb) relationship with their idol:\n\n&quot;We love you, we love you, We Love you, we love you, Nail up your hands to fulfill our demands&quot;\n\n&quot;We hate you, we hate you, We hate you, we hate you, Watch them turn cold as you start to turn old&quot;\n\n'Baby Night Eyes' sees Bizarre Inc on remix duties, utilising subtle yet effective drum programming (drawing upon 'drum 'n' bass' influences) to create a totally synthetic and mesmerising effect. 'Addicted' starts with Neal X's trademark guitar style before the beat starts to kick in, to set the scene for a powerful pumping electro track this time with The Beatmasters on additional production duties. 'Brilliant Creatures' is an awesome slice of Euro-Techno. The emphasis for Almond has always been on songwriting craftsmanship and vocal delivery, check out Almond's outstanding performance and vocal execution on the superlative 'Child Star'.\n\n'Fantastic Star' closes with the club euphoric 'Shining Brightly' an uplifting club track co-written and produced with UK Club DJ Mrs Wood and Kevin White, demonstrating Almond's allegiance with the European Club Circuit will no doubt continue to endure well into the next decade. Once again Almond delivers the goods with a thunderous mix of musical styles following the accomplished and disciplinarian 'Tenement Symphony - Grit and Glitter' concept LP of 1991.\n'Fantastic Star' is not just an album about stardom, addiction and love but about those who perform it and those who consume it. (Customer from Amazon)\n\n\n\n\n\n01 - Caged\n02 - Out There [Album Version]\n03 - We Need Jealousy\n04 - The Idol [Parts 1 &amp; 2 All Gods Fall]\n05 - Baby Night Eyes\n06 - Adored And Explored [7' Edit]\n07 - Child Star\n08 - Looking For Love (In All The Wrong Places)\n09 - Addicted\n10 - The Edge Of Heartbreak\n11 - Love To Die For\n12 - Betrayed\n13 - On The Prowl\n14 - Come In Sweet Assassin\n15 - Brilliant Creatures [LP Version]\n16 - Shining Brightly\n\n\n\nLabel: Mercury\nReleased: 1996\nCatalogue: 528 659-2\n\n\n\nCodec: Flac\nCompression Level: 5\nQuality: High\n\n\nCD-rip by alekow (EAC and Flac)\nCovers Included (400dpi)\n\n\n\n\n\nEnjoy, Seed and Share\n","torrent":{"xt":"urn:btih:716d6bc446d59ed85339365ceabdf3d4f24b8583","amp;dn":"Marc+Almond+-+Fantastic+Star+%281996%29+%40flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"716d6bc446d59ed85339365ceabdf3d4f24b8583","infoHashBuffer":{"type":"Buffer","data":[113,109,107,196,70,213,158,216,83,57,54,92,234,189,243,212,242,75,133,131]},"announce":[],"urlList":[]}}