{"title":"Foreigner - Dirty White Boy [promo].VOB","uid":9282068,"size":56659968,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7200bed3306dea21af2a6113cea2207c84f718e1&amp;dn=Foreigner+-+Dirty+White+Boy+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1385952487,"description":"Foreigner - Dirty White Boy [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Dirty White Boy&quot; is the first single taken from Foreigner's third album, Head Games. It is written by Lou Gramm &amp; Mick Jones. The B-side, &quot;Rev On The Red Line&quot; has also proven to be very popular among fans,[citation needed] but was never released as an A-side single on its own. Lou Gramm's trademark scream at the end of the song is missing from this abbreviated version of &quot;Dirty White Boy&quot;.[citation needed]\n\nThe song is featured in the 2013 video game Grand Theft Auto V on the in-game radio station Los Santos Rock Radio.\n\nHead Games is the third studio album by Anglo American rock band Foreigner, released in 1979. It charted at #5 on the Billboard 200 chart, and has sold over five million copies in the US alone. The album is perhaps as famous (or infamous) for its album cover - depicting a worried young woman (portrayed by actress Lisanne Falk) in a men's restroom - as it is for its music. The title track and &quot;Dirty White Boy&quot; were the album's big hits, peaking at #14 and #12, respectively. This was the album in which Rick Wills replaced Ed Gagliardi as bassist. It was the band's only album produced by Roy Thomas Baker, best known for producing Queen's classic albums.\n\nForeigner are a British-American rock band, originally formed in 1976 by veteran English musicians Mick Jones, ex-King Crimson member Ian McDonald along with American vocalist Lou Gramm. Foreigner have sold more than 70 million albums worldwide (including over 37.5 million in the United States alone).\n\nSince its inception, Foreigner has been led by English musician Mick Jones (former member of Nero and the Gladiators, Spooky Tooth and The Leslie West Band) who, in early 1976, met with ex-King Crimson member Ian McDonald and formed Foreigner with Lou Gramm (ex-Black Sheep), Dennis Elliott, Al Greenwood, and Ed Gagliardi as a sextet. Jones came up with the name from the fact that no matter what country they were in, three would be foreigners, because he, McDonald, and Elliott were English, while Gramm, Greenwood, and Gagliardi were Americans.\n(video does not have any logos)\n\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Dirty_White_Boy_(song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Dirty_White_Boy_(song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/NaCocaafJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/NaCocaafJ&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 9800kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 192kbps\n   Duration: 00:03:14\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.1\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:7200bed3306dea21af2a6113cea2207c84f718e1","amp;dn":"Foreigner+-+Dirty+White+Boy+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7200bed3306dea21af2a6113cea2207c84f718e1","infoHashBuffer":{"type":"Buffer","data":[114,0,190,211,48,109,234,33,175,42,97,19,206,162,32,124,132,247,24,225]},"announce":[],"urlList":[]}}