{"title":"Sin City[HDrip][Spanish]","uid":4877078,"size":2409424896,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:72b691a4f126702c3827c9148202e7160d6cc751&amp;dn=Sin+City%5BHDrip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sahae","files":1,"time":1241184819,"description":"TÃƒÂ­tulo original: Sin City\nAÃƒÂ±o: 2005\nPaÃƒÂ­s: USA\nDuraciÃƒÂ³n: 126 min\nEstreno en EspaÃƒÂ±a: 12-08-2005\nEstreno en USA: 01-04-2005\nDirector: Robert Rodriguez, Frank Miller\nReparto: Bruce Willis, Jessica Alba, Clive Owen, Mickey Rourke, Josh Hartnett, Marley Shelton, Jaime King, Maria Bello, Kate Bosworth, Jason Douglas, Carla Gugino, Brittany Murphy, Katherine Willis, Elijah Wood, Benecio del Toro\nGuiÃƒÂ³n: Frank Miller &amp; Robert RodrÃƒÂ­guez (CÃƒÂ³mic: Frank Miller)\nMÃƒÂºsica: John Debney, Graeme Revell, Robert Rodriguez\nProductora: Dimension Films\nGÃƒÂ©nero: AcciÃƒÂ³n - Thriller\n\nSinopsis: Bienvenido a SIN CITY. Una ciudad que atrae a los tipos duros, a los corruptos y los solitarios. Para algunos es un lugar oscuro. Insensible. Para otros es su hogar. PolicÃƒÂ­as corruptos. Mujeres sensuales. Vigilantes desesperados. Muchos quieren vengarse. Otros redimir sus pecados. Y tambiÃƒÂ©n hay quien espera conseguir un poco de las dos cosas. Un universo de hÃƒÂ©roes extraÃƒÂ±os y reticentes que intentan hacer lo correcto en una ciudad que rechaza el bien. Sus historias personales pasan a primera plana en la nueva pelÃƒÂ­cula de los co-directores Frank Miller y Robert RodrÃƒÂ­guez, y que cuenta con la colaboraciÃƒÂ³n de Quentin Tarantino. Miller y RodrÃƒÂ­guez tomaron las ideas de la historia de SIN CITY directamente de las pÃƒÂ¡ginas de un cÃƒÂ³mic. Y utilizando un formato digital de ÃƒÂºltima tecnologÃƒÂ­a, adaptaron las leyendas urbanas de gamberros, patanes, hÃƒÂ©roes y mujeres desvergonzadas a la gran pantalla sin perder el marcado estilo del cÃƒÂ³mic y su ritmo frenÃƒÂ©tico. SIN CITY muestra un mundo de luz y sombras por medio de extractos de diÃƒÂ¡logos, interpretaciones estilizadas y una gran imaginaciÃƒÂ³n visual. La historia central se centra en Marv, un matÃƒÂ³n callejero de toda la vida. Cuando Marv acoge en su casa a una diosa de la belleza llamada Goldie, sÃƒÂ³lo para conservar su cadÃƒÂ¡ver en la cama, peinÃƒÂ³ la ciudad para vengarse de la pÃƒÂ©rdida del ÃƒÂºnico amor que habÃƒÂ­a sentido en su corazÃƒÂ³n. Otra de las historias es la de Dwight, un investigador privado que se empeÃƒÂ±a una y otra vez en dejar atrÃƒÂ¡s los problemas a pesar de que no consigue deshacerse de ellos. DespuÃƒÂ©s de que muera un policÃƒÂ­a en el casco antiguo de la ciudad, Dwight no se detiene ante nada para proteger a sus amigos entre las damas de la noche. Y finalmente, estÃƒÂ¡ la historia de John Hartigan - el ÃƒÂºltimo policÃƒÂ­a honrado de SIN CITY. Su vida profesional estÃƒÂ¡ a punto de terminar. En su ÃƒÂºltimo caso trata de salvar a una niÃƒÂ±a de 11 aÃƒÂ±os de las manos del sÃƒÂ¡dico hijo de un senador... con sorprendentes resultados.\n\t\n\n","torrent":{"xt":"urn:btih:72b691a4f126702c3827c9148202e7160d6cc751","amp;dn":"Sin+City%5BHDrip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72b691a4f126702c3827c9148202e7160d6cc751","infoHashBuffer":{"type":"Buffer","data":[114,182,145,164,241,38,112,44,56,39,201,20,130,2,231,22,13,108,199,81]},"announce":[],"urlList":[]}}