{"title":"[Accelerati 01] Tesla's Attic by Neal Shusterman &amp; Eric Elfm","uid":11612183,"size":14590884,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73719642a04efc564a93ce9d1f17e63415931f1f&amp;dn=%5BAccelerati+01%5D+Tesla%27s+Attic+by+Neal+Shusterman+%26amp%3B+Eric+Elfm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gratefuldawg77","files":6,"time":1417465059,"description":"esla's Attic is the first book in a brilliantly imagined and hilariously written trilogy that combines science, magic, intrigue, and just plain weirdness, about four kids who are caught up in a dangerous plan concocted by the eccentric inventor Nikola Tesla.\n\nAfter their home burns down, fourteen-year-old Nick, his younger brother, and their father move into a ramshackle Victorian house they've inherited. When Nick opens the door to his attic room, he's hit in the head by a toaster. That's just the beginning of his weird experiences with the old junk stored up there. After getting rid of the odd antiques in a garage sale, Nick befriends some local kids-Mitch, Caitlin, and Vincent-and they discover that all of the objects have extraordinary properties. What's more, Nick figures out that the attic is a strange magnetic vortex, which attracts all sorts of trouble. It's as if the attic itself has an intelligence . . . and a purpose.\n\nUltimately Nick learns that the genius Nikola Tesla placed the items-his last inventions-in the attic as part of a larger plan that he mathematically predicted. Nick and his new friends must retrieve everything that was sold at the garage sale and keep it safe. But the task is fraught with peril-in addition to the dangers inherent in Tesla's mysterious and powerful creations, a secret society of physicists, the Accelerati, is determined to stop Nick and alter destiny to achieve its own devious ends. It's a lot for a guy to handle, especially when he'd much rather fly under the radar as the new kid in town.\n\nFans of intrigue, action, humor, and nonstop surprises are guaranteed a read unlike any other in Tesla's Attic, Book One of the Accelerati Trilogy","torrent":{"xt":"urn:btih:73719642a04efc564a93ce9d1f17e63415931f1f","amp;dn":"%5BAccelerati+01%5D+Tesla%27s+Attic+by+Neal+Shusterman+%26amp%3B+Eric+Elfm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73719642a04efc564a93ce9d1f17e63415931f1f","infoHashBuffer":{"type":"Buffer","data":[115,113,150,66,160,78,252,86,74,147,206,157,31,23,230,52,21,147,31,31]},"announce":[],"urlList":[]}}