{"title":"A History of the Modern Chinese Army  [blackatk]","uid":8653848,"size":7309638,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73c273fea91ecb55495588fe434c0856d70053e9&amp;dn=A+History+of+the+Modern+Chinese+Army++%5Bblackatk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1373168919,"description":"Since the establishment of the Red Army in 1927, China's military has responded to profound changes in Chinese society, particularly its domestic politics, shifting economy, and evolving threat perceptions. Recently tensions between China and Taiwan and other east Asian nations have aroused great interest in the extraordinary transformation and new capabilities of the Chinese army. In A History of the Modern Chinese Army, Xiaobing Li, a former member of the People's Liberation Army (PLA), provides a comprehensive examination of the PLA from the Cold War to the beginning of the twenty-first century that highlights the military's central function in modern Chinese society. In the 1940s, the Chinese army was in its infancy, and many soldiers were rural conscripts and volunteers who had received little formal schooling. The Chinese military rapidly increased its mobility and weapon strength, and the Korean War and Cold War offered intense combat experience that not only allowed soldiers to hone their fighting techniques but also helped China to develop military tactics tailored to the surrounding countries whose armies posed the most immediate threats. Yet even in the 1970s, the completion of a middle school education (nine years) was considered above-average, and only 4 percent of the 224 top Chinese generals had any college credit hours. However, in 1995 the high command began to institute massive reforms to transform the PLA from a labor-intensive force into a technology-intensive army. Continually seeking more urban conscripts and emphasizing higher education, the PLA Reserve Officer Training and Selection program recruited students from across the nation. These reservists would become commissioned officers upon graduation, and they majored in atomic physics, computer science, and electrical engineering. Grounding the text in previously unreleased official Chinese government and military records as well as the personal testimonies of more than two hundred PLA soldiers, Li charts the development of China's armed forces against the backdrop of Chinese society, cultural traditions, political history, and recent technological advancements. A History of the Modern Chinese Army links China's military modernization to the country's growing international and economic power and provides a unique perspective on China's esttablishment and maintenance of one of the world's most advanced military forces.\n\n\n\n432 Pages\nPublisher \tThe University Press of Kentucky; 1 edition (July 2, 2009)\nLanguage \tEnglish\nISBN-10 \t0813192404\nISBN-13 \t978-0813192406\n\n &lt;a href=&quot;\nhttp://www.amazon.com/History-Modern-Chinese-Army/dp/0813192404/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1373161310&amp;sr=1-1&amp;keywords=a+history+of+the+modern+chinese+army&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/History-Modern-Chinese-Army/dp/0813192404/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1373161310&amp;sr=1-1&amp;keywords=a+history+of+the+modern+chinese+army&lt;/a&gt;\n\n\n\n\n\nTags: \n\n\n\nmilitary, china, navy, PLA, PLAN, li song, sun tzu, Taiwan, formosa, japan, invasion, war, pacom, pacific, rise, china , zhongguo, ba yi, mao, deng xiaoping, hu jintao, xi jiping, dynasty, phillipines, senkaku, vietnam, ww3, world war 3 , 1927, 1949, cpc, communist, party, zhonggong, guerilla warfare, people, peoples army, revolution, lenin, stalin, soviet, russia, dprk, korea, korean, kim jong il, kim jong nam, kim il sung ","torrent":{"xt":"urn:btih:73c273fea91ecb55495588fe434c0856d70053e9","amp;dn":"A+History+of+the+Modern+Chinese+Army++%5Bblackatk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73c273fea91ecb55495588fe434c0856d70053e9","infoHashBuffer":{"type":"Buffer","data":[115,194,115,254,169,30,203,85,73,85,136,254,67,76,8,86,215,0,83,233]},"announce":[],"urlList":[]}}