{"title":"Noticias Cuatro - AmarÃƒÂ¡s al lÃƒÂ­der sobre todas las cosas","uid":4575002,"size":670693376,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:73cb5b058fc5e07df082aaeb755178e86a8c4d60&amp;dn=Noticias+Cuatro+-+Amar%C3%83%C2%A1s+al+l%C3%83%C2%ADder+sobre+todas+las+cosas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"egns","files":1,"time":1229197755,"description":"Ã‚Â¡Nuestros lÃƒÂ­deres nunca se equivocan!, asegura un alto funcionario del Gobierno de Corea del Norte. Cuando el periodista le pregunta quÃƒÂ© pasarÃƒÂ¡ el dÃƒÂ­a que se equivoquen, si podrÃƒÂ¡n ser sustituidos, el mismo funcionario se lo piensa y responde: No sÃƒÂ©, eso nunca ha pasado&quot;... AsÃƒÂ­ comienza el reportaje de Jon Sistiaga AmarÃƒÂ¡s al lÃƒÂ­der sobre todas las cosas, un viaje por el ÃƒÂºltimo bastiÃƒÂ³n comunista del planeta donde todavÃƒÂ­a se vive con los esquemas de la Guerra FrÃƒÂ­a. Un inmenso GULAG de inspiraciÃƒÂ³n estalinista donde el culto al lÃƒÂ­der Kim Jong Il es obligatorio, si no se quiere acabar en un campo de reeducaciÃƒÂ³n. La novena potencia nuclear que alardea de su fuerza bÃƒÂ©lica, mientras la mitad de la poblaciÃƒÂ³n vive en los lÃƒÂ­mites de la malnutriciÃƒÂ³n. Donde las masas son movilizadas a diario para mantenerlas alerta ante enemigos imaginarios y se bloquean las emisoras extranjeras para que no se filtre ninguna informaciÃƒÂ³n del exterior. Una enorme cÃƒÂ¡rcel de las ideas donde todo el mundo es supuestamente igual, aunque las elites del partido se muevan en Mercedes y el resto del pueblo lo haga en bicicleta... Un supuesto paraÃƒÂ­so social que confina a sus deficientes psÃƒÂ­quicos en cooperativas agrÃƒÂ­colas como mano de obra defectuosa. Un lugar donde todavÃƒÂ­a hay campos de concentraciÃƒÂ³n para disidentes polÃƒÂ­ticos y los periodistas se tienen que camuflar de turistas para entrar...\n\nTres agentes de la seguridad del Estado velaron constantemente para que sÃƒÂ³lo se grabara lo que ellos querÃƒÂ­an enseÃƒÂ±ar. Salir solo del hotel estaba terminantemente prohibido bajo amenaza de expulsiÃƒÂ³n del paÃƒÂ­s. Aun asÃƒÂ­, el reportaje logra ofrecer un retrato aproximado de la verdadera realidad de un paÃƒÂ­s que se despierta por las maÃƒÂ±anas con las mÃƒÂºsicas patriÃƒÂ³ticas que suenan en cada fÃƒÂ¡brica o escuela, y que se acuesta cuando en la alienante televisiÃƒÂ³n estatal retumban los acordes del himno nacional. En Corea hay inmensas autopistas de cinco carriles por las que apenas circulan vehÃƒÂ­culos, pero en las que se pueden observar numerosas cuadrillas de obreros barriendo el asfalto.\n\nUn paÃƒÂ­s que se dice orgulloso de haber alcanzado el estatus de potencia nuclear. Que tiene mÃƒÂ¡s de un millÃƒÂ³n de soldados en estado de alerta, y otros tres millones de reservistas de la Guardia Campesina. Un Estado incluido por George Bush en el nefasto eje del mal junto a Siria e IrÃƒÂ¡n. El reportaje muestra un inquietante desfile de miles de soldados y miembros del Partido ÃƒÂºnico avanzando al &quot;paso de la oca&quot; en una movilizaciÃƒÂ³n de masas que recuerda cierta iconografÃƒÂ­a nazi. El periodista cuenta como pasan los misiles nucleares a su lado, como la gente se acerca a tocarlos y bromear haciendo como que aprietan el botÃƒÂ³n de la lanzadera.\n\nCorea del Norte es un enorme juguete de 22 millones de personas para un lÃƒÂ­der que se cree un semidios. Un hombre que se hace llamar el sol del siglo XXI y al que le encanta levantar estatuas y retratos suyos por todo el paÃƒÂ­s. Un estadista que asegura que ha escrito de su puÃƒÂ±o y letra mÃƒÂ¡s de 18.000 libros. Ã‚Â¡18.000! Un libro por dÃƒÂ­a durante 49 aÃƒÂ±os. Y todavÃƒÂ­a, cuando se pregunta a los miembros del rÃƒÂ©gimen que eso es imposible, olvidÃƒÂ¡ndose del sentido comÃƒÂºn, son capaces de responder: &quot;Es que es muy listo...&quot;","torrent":{"xt":"urn:btih:73cb5b058fc5e07df082aaeb755178e86a8c4d60","amp;dn":"Noticias+Cuatro+-+Amar%C3%83%C2%A1s+al+l%C3%83%C2%ADder+sobre+todas+las+cosas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73cb5b058fc5e07df082aaeb755178e86a8c4d60","infoHashBuffer":{"type":"Buffer","data":[115,203,91,5,143,197,224,125,240,130,170,235,117,81,120,232,106,140,77,96]},"announce":[],"urlList":[]}}