{"title":"Amalgam Illness","uid":11060499,"size":16603334,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73e88145578edfb2455bcd22bdf1fd3329b1313b&amp;dn=Amalgam+Illness&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ShadowRaven66669","files":1,"time":1411164550,"description":"This book presents a wealth of information on mercury poisoning such as you might have gotten from dental amalgam fillings, laboratory accidents, occupational exposure to mercury, exposure to mercury preservatives in health care products such as eye care products and contraceptives, etc. The book discusses how to tell if you have mercury poisoning, what to do about it, how to get help, and how to deal with physicians. Much of this information is covered several times at different levels so that you can find the amount of detail that best suits you. The book is straightforward and factual. The book is a tool for solving intractable health problems.\n\nThis book need not be read cover to cover or in any particular order. Figures and tables have been included to rapidly convey how the different symptoms are interrelated and how different medicines and nutritional supplements can be used.\n\nThis book is intentionally very broad. A large number of supplements and medicines are discussed. Thus there will be SOMETHING that each individual patient's metabolism tolerates, and SOMETHING that each physician is familiar and comfortable with.\n\nThis book gives you the options you need - you decide what to use.\n\nThis book discusses methods to diagnose and treat some of the physiological and metabolic dysfunctions which are a part of chronic fatigue, fibromyalgia, and environmental illness. Some of the information will be helpful even if mercury isn't the root of your problems.\n\nThe book is written as a straightforward reference book for you, not as super sophisticated research treatise for medical school professors. Everyday terms have been used when possible. Thus &quot;low thyroid&quot; instead of &quot;hypothyroid,&quot; &quot;poisoned&quot; instead of &quot;intoxicated,&quot; etc. Where medical words need to be used, they are explained.\n\nInstead of a very long list of esoteric and obscure references, there is a short list of helpful and interesting books and papers that explains what they are so you can decide if they would help you. This book covers:\n\nhow to find and work with good doctors;\n\nthe effects of chronic mercury poisoning, and how mercury causes these effects;\n\nhow to diagnose chronic mercury poisoning;\n\nhow to treat chronic mercury poisoning;\n\nscientific evidence that a lot of people are mercury poisoned.\n\nThis book is especially valuable because some physicians are not yet familiar with the diagnosis and treatment of chronic mercury poisoning. Their textbooks state that there is no suitable biological index for the amount of mercury in the target organ, the brain, but do not explain what tests to use in place of the old fashioned ones that miss 2 cases out of 3. Worse, the textbooks offer no guidance on how to cure chronic mercury poisoning or control symptoms during treatment. This book gives your physician the information they need to help you.\n\nSince the medical textbooks aren't up to date on chronic mercury poisoning yet, the burden is on you, the patient, to decide whether to accept a physician's diagnosis and proposed treatment plan, or to seek another. If you are getting diagnoses like &quot;there is nothing wrong,&quot; or &quot;it's all in your head&quot; and proposed treatment plans like &quot;try ignoring it and seeing if it goes away,&quot; this is the right book for you. Don't suffer silently. Read Amalgam Illness: Diagnosis And Treatment and get well. ","torrent":{"xt":"urn:btih:73e88145578edfb2455bcd22bdf1fd3329b1313b","amp;dn":"Amalgam+Illness","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73e88145578edfb2455bcd22bdf1fd3329b1313b","infoHashBuffer":{"type":"Buffer","data":[115,232,129,69,87,142,223,178,69,91,205,34,189,241,253,51,41,177,49,59]},"announce":[],"urlList":[]}}