{"title":"De Bijbel Jeremiah DVD NL (dvd5)(Nl subs) RETAIL TBS","uid":6737177,"size":4117826074,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7455a0d689638bff0268f4dc6c17bae694ba9e62&amp;dn=De+Bijbel+Jeremiah+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sammynet","files":18,"time":1318370257,"description":"De Bijbel: Jeremia\n\n\nNedelands \nDe profeet Jeremia verlaat zowel zijn familie als Judith, de vrouw waarvan hij houdt, om de boodschap van God in Jeruzalem te verkondigen. Hij waarschuwt de mensen dat de Heilige stad door de Babyloniers zal worden vernietigd. De wrede koning Jojakim ziet Jeremia als verrader en laat hem vervolgen. Jeremia blijft echter volharden in zijn missie, daarbij bijgestaan door de schriftgeleerde Baruch, en vlucht. Onder leiding van Safan, de generaal van de koning, wordt Jeremia toch gevangen genomen. Zijn geliefde Judith wordt voor zijn ogen doodgestoken. Als blijkt dat de Egyptenaren de koning niet te hulp zullen komen, laat hij Jeremia vrij en vraagt hem om advies. Safan ziet kans Jeremia in een verlaten regenput te gooien. Als de koning daar via een eunuch achterkomt, zet hij de profeet toch weer gevangen. Tenslotte vallen de Babyloniers inderdaad het land binnen. Zij vernietigen Jeruzalem en zo komt Jeremias voorspelling toch uit. Hun koning Nebukadnessar geeft de profeet zijn vrijheid terug: hij is het immers die hun triomf had voorzien.\n\nFilm informatie\nDuur \t    : \t130 min\nMedia       : \tDVD\nTaal \t    : \tEngels\nOndertitels : \tNederland\n\nEngels\nThe young Jeremiah grows up in a priest's family in the village of Anathoth, near Jerusalem. God appears to Jeremiah in different human guises on several occasions, and makes it clear to him that he has been selected to announce God's message to the people of Jerusalem: a mighty ruler from the north will attack the Kingdom of Judah if the people there continue to worship false idols, and fail to remember the One God. No-one in Anathoth believes Jeremiah's prophecy, however. Instead, he is accused of blasphemy and is physically attacked - and not even his family comes to his aid. Nevertheless, with the help of Baruch, a temple scribe who hears Jeremiah's first sermon and becomes his disciple, Jeremiah succeeds in announcing the word of God. The prophet's message of impending doom incurs only the wrath and rejection of the ruling classes, the priesthood and the King... \n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/27887/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/27887/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0174792/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0174792/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7455a0d689638bff0268f4dc6c17bae694ba9e62","amp;dn":"De+Bijbel+Jeremiah+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7455a0d689638bff0268f4dc6c17bae694ba9e62","infoHashBuffer":{"type":"Buffer","data":[116,85,160,214,137,99,139,255,2,104,244,220,108,23,186,230,148,186,158,98]},"announce":[],"urlList":[]}}