{"title":"Guided By Voices - Sunfish Holy Breakfast (1996)","uid":9816341,"size":221779812,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:74e077a02566b5ee0f984e021d77153a1af028cd&amp;dn=Guided+By+Voices+-+Sunfish+Holy+Breakfast+%281996%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"seckatary","files":13,"time":1395625254,"description":"\nThanks to Pollutix for starting this flood. I have more.\n\n Review by Jack Rabid from AllMusic\n\nThe difference between the inconsistent, scrappy, at times terrific Alien Lanes and the better-developed follow-up, Under the Bushes Under the Stars -- aside from the recording upgrade to 24-track -- was that Guided by Voices canned the impulse to include every little 20-to-50-second idea they came up, however fragmentary. Instead, Robert Pollard and Tobin Sprout worked harder, composing more satisfying, finished tunes, without compromising the spontaneous combustion. Ever wonder what happened to the lesser-developed pieces that didn't make Bushes? They arrived, behind schedule, on the ten-song, 23-minute Sunfish Holy Breakfast, and the results are mixed, like some of their previous &quot;leftovers&quot; EPs. At EP cost, Sunfish is a boisterous bargain, thanks to the cream material that starts with song five, the super-riff shine of Pollard's &quot;Cocksoldiers and Their Postwar Stubble,&quot; continuing through the nimble, harsh acoustic waltz of (the previously released on 7&quot;) &quot;If We Wait,&quot; another GBV gem! Even bassist Jim Greer gets in on the act with a hummable guitar-and-voice ditty, &quot;Trendspotter Acrobat.&quot; Not a bad little stopgap release -- this crop of crumbs from the most prolific pack of popsters in 20 years.\n\n","torrent":{"xt":"urn:btih:74e077a02566b5ee0f984e021d77153a1af028cd","amp;dn":"Guided+By+Voices+-+Sunfish+Holy+Breakfast+%281996%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74e077a02566b5ee0f984e021d77153a1af028cd","infoHashBuffer":{"type":"Buffer","data":[116,224,119,160,37,102,181,238,15,152,78,2,29,119,21,58,26,240,40,205]},"announce":[],"urlList":[]}}