{"title":"The Struggle for Modernity: Nationalism, Futurism, and Fascism","uid":11723029,"size":633203,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:75ab7a5a9c42fad6217935d21e036991c90cf42c&amp;dn=The+Struggle+for+Modernity%3A+Nationalism%2C+Futurism%2C+and+Fascism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424933654,"description":"During the 20th century, Italy experienced some regrettable political developments. It was the first European nation after World War I in which a mass militia-party of revolutionary nationalism achieved power and abolished parliamentary democracy with the goal of building a totalitarian state. It was also the first in Europe to institutionalize the sacralization of politics and to celebrate officially the cult of the leader as a demi-God. These achievements were not accidents. Since the beginning of the 20th century, Italian nationalist movements, from the national radicalism of La Voce to futurist nationalism and fascism, fostered one of the strongest waves of European right-wing radicalism.\n\nThe confrontation between nationalism and modernity is one of the main keys to understanding to the permutations of Italian radical nationalism from modernist avant-gardes up to the fascist regime. This book analyzes the ideological undercurrents and cultural myths that unite all these movements. Looking at Italian nationalism from its risorgimento roots to the neo-fascist heritage, Gentile considers the relationship between myth and organization in the making of the fascist state, the role of the party, the liturgy of mass politics in Italy, the fascist organizations abroad, and the attitude of fascist culture toward the United States","torrent":{"xt":"urn:btih:75ab7a5a9c42fad6217935d21e036991c90cf42c","amp;dn":"The+Struggle+for+Modernity%3A+Nationalism%2C+Futurism%2C+and+Fascism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75ab7a5a9c42fad6217935d21e036991c90cf42c","infoHashBuffer":{"type":"Buffer","data":[117,171,122,90,156,66,250,214,33,121,53,210,30,3,105,145,201,12,244,44]},"announce":[],"urlList":[]}}