{"title":"Real Secrets of David Stone","uid":8303638,"size":571434080,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:76babf31eaef6fd0f729b7a6db746e323e6f4845&amp;dn=Real+Secrets+of+David+Stone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lethal111","files":4,"time":1364320145,"description":"You may have received the Real Secrets of Magic, but now acquire the secrets of Stone himself.\n\nCameras followed David Stone into14 countries capturing over 120 performances and lectures over 2 years of filming. The result is a wealth of gems.\n\nPeel back the layers of the mind of David Stone to understand what exactly makes him tick, how he comes up with such effective magic, how he practices, and why nerves always have been - and still are - a tremendous factor for him... and how he gets over them.\n\nIn addition you will learn tricks with coins, cards, and amazing Stone productions.\n\nFULL OVERVIEW\n\n&quot;David Stone leads one of the most interesting lives...&quot;\n- Lee Asher, High Quality Card Expert\n\n\nAfter releasing the best-selling DVD's &quot;The Real Secrets of Magic&quot; World Champion FISM Winner, David Stone went on a world tour with his lecture.\n\nMore than 120 performances in almost 2 years. The last one took place at the most attended convention: Blackpool, where 700 magicians witnessed the outstanding show that built David Stone's fame, making him one of the worlds best magic performers today.\n\nThis film is so much more than a lecture, it's a master class of entertainment and showmanship, mixing the art of close up with a twisted, fun mind. An act full of energyAn act full of energy delivered with 10 of David's Strongest effects taught right here.\n\nGet in on the insiders view of a life dedicated to the art of presentation and magic and how you can effectively apply it to yours.","torrent":{"xt":"urn:btih:76babf31eaef6fd0f729b7a6db746e323e6f4845","amp;dn":"Real+Secrets+of+David+Stone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76babf31eaef6fd0f729b7a6db746e323e6f4845","infoHashBuffer":{"type":"Buffer","data":[118,186,191,49,234,239,111,208,247,41,183,166,219,116,110,50,62,111,72,69]},"announce":[],"urlList":[]}}