{"title":"Nanking [2007 Documentary]","uid":4412956,"size":1536142427,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:772289602bd7bc3415d1ec3b153331ea49471039&amp;dn=Nanking+%5B2007+Documentary%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"toetag","files":1,"time":1222359932,"description":"The diaries and letters of Western observers, combined with the testimonies of still-living Chinese eyewitnesses, create an intimate and wrenchingly compelling depiction of the Japanese invasion of Nanking in 1937. Nanking focuses on the Safety Zone established by a bizarre combination of American missionaries and Nazi businessmen, a haven that saved the lives of over 200,000 Chinese too poor to flee the marauding army. The words of these missionaries and businessmen are read by a cast of famous actors, including Woody Harrelson, Jurgen Prochnow (Das Boot), and Mariel Hemingway (Manhattan); this could have turned out unbearably precious, but the restraint and respect of the performances allows the voices of the writers to come through with understated power. The documentary is filled with gruesome details (&quot;The dead covered the ground like a straw mat,&quot; declares a Japanese soldier) and the atrocities at times verge on unendurable; there&amp;#039;s a reason this occupation is commonly held up as a definitive example of man&amp;#039;s inhumanity to man. But throughout the horror are glimpses of astonishing courage and the deepest generosity, some of it driven by what can only be described as fierce pacifism. There are startlingly instructive moments (for example, while soldiers raped and looted the city, the Japanese army made propaganda films of soldiers giving candy to hungry children), but the culminating emotional impact of the documentary goes beyond anything didactic. The invasion of Nanking provokes controversy even now, 70 years later. Nanking is unlikely to lay denials to rest, but it&amp;#039;s a potent and valuable reminder of the degradation of war. --Bret Fetzer\n","torrent":{"xt":"urn:btih:772289602bd7bc3415d1ec3b153331ea49471039","amp;dn":"Nanking+%5B2007+Documentary%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"772289602bd7bc3415d1ec3b153331ea49471039","infoHashBuffer":{"type":"Buffer","data":[119,34,137,96,43,215,188,52,21,209,236,59,21,51,49,234,73,71,16,57]},"announce":[],"urlList":[]}}