{"title":"Puzzle Arcade Game Collection [PC WinAll]","uid":4226838,"size":179610557,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7766ff48c45e6930fa8f5cfd1ab4b45738dfcbb0&amp;dn=Puzzle+Arcade+Game+Collection+%5BPC+WinAll%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jdowner99","files":11,"time":1212870311,"description":"Puzzle Arcade Game Collection [PC WinAll]\n\nMystery P.I. - The Vegas Heist [Reality Arcade]\n\nThe heist of the century has just happened! You&amp;#039;ve been hired by the casino to find and return the stolen money before its grand opening...in 16 hours! Search for more than 2300 cleverly hidden objects in 25 hot Las Vegas locations to solve the case and unlock Unlimited mode to search for every hidden object in every scene with no time limits! It&amp;#039;s the perfect investigation, in the coolest location, for the master Mystery P.I.!\n\nCLUE Classic [Reality Arcade]\n\nColonel Mustard, Professor Plum, Miss Scarlet and the rest of the usual suspects have gathered together in stately Tudor Mansion to determine who killed Mr. Boddy, where the murder was committed, and how it was done. Was it Mr. Green in the Hall with the revolver? Or perhaps it was Mrs. Peacock in the ballroom with the lead pipe? With six suspects, six possible murder weapons and nine rooms in the mansion, there are hundreds of possibilities, and plenty of clues to investigate!\n\nWomen&amp;#039;s Murder Club: Death in Scarlet [Reality Arcade]\n\nInvestigate this unique blend of seek and find and puzzle games combined with an all new tale from America&amp;#039;s #1 storyteller, James Patterson! In this thrilling page-turner, take on the roles of a homicide detective, a medical examiner and an ace crime reporter to solve a series of ghastly murders in San Francisco. Featuring nine investigations, brain-bending puzzles and a spine tingling, all-new storyline, Women&amp;#039;s Murder Club: Death in Scarlet will have you racing to the finish to discover the killer!\n\nPastry Passion [Reality Arcade]\n\nWhip up a passion for puzzles with this sweet treat! Help Henri, a high-spirited baker with a penchant for pastries, arrange scrumptious ingredients into groups of three or more to make colorful confections. Boost your bakery with helpful tools and rise to the rank of Master Pastry Chef in level after level of mouth-watering matching fun! Featuring two original game modes, special in-game trophies, and rich full-screen graphics, Pastry Passion is a delightful indulgence for your mind!\n\nMoney Tree [Reality Arcade]\n\nWho says money doesn&amp;#039;t grow on trees? William the gardener has inherited a very strange house, with an even stranger tree in the yard. Help him catch the falling leaves and transplant them on apple, pear, cherry and orange trees to earn his daily money goals. If William can sell enough fruit, fight off the garden pests, and earn enough money, he&amp;#039;ll be that much closer to winning the affections of his one true love, Elizabeth Grant!\n","torrent":{"xt":"urn:btih:7766ff48c45e6930fa8f5cfd1ab4b45738dfcbb0","amp;dn":"Puzzle+Arcade+Game+Collection+%5BPC+WinAll%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7766ff48c45e6930fa8f5cfd1ab4b45738dfcbb0","infoHashBuffer":{"type":"Buffer","data":[119,102,255,72,196,94,105,48,250,143,92,253,26,180,180,87,56,223,203,176]},"announce":[],"urlList":[]}}