{"title":"Alex Jones Show - 2011 Dec 18 SU [sebaygo1]","uid":6897687,"size":42647868,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7863b1465278eca8284145738382e4261916e988&amp;dn=Alex+Jones+Show+-+2011+Dec+18+SU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":8,"time":1324267078,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nSunday, 18 December 2011\n\n\n[sebaygo1]\n\n\nThe 2 hour Sunday show is typically a review of the past week's news and a look forward to the coming week's events.\n\nThe Infowars web site describes today's broadcast as follows.\n\nThis LIVE Sunday edition serves as a red alert, a warning that America is slipping into a Soviet-style nightmare. In this special broadcast, Alex urges listeners to realize the grave choice we must all make-- to face up to the harsh realities happening around us, or ignore it and allow the country and globe to slip into total tyranny. It is all happening now -- from a Pentagon-led takeover of the Internet and bills authorizing the clamp down of free speech online to a military takeover in the homeland, emboldened by NDAA legislation authorizing the indefinite detention of Americans without trial and a martial law emergency response grid. Preparations are in place to launch World War III and totally supplant the Constitutional basis for legitimate government in the free world.\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:7863b1465278eca8284145738382e4261916e988","amp;dn":"Alex+Jones+Show+-+2011+Dec+18+SU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7863b1465278eca8284145738382e4261916e988","infoHashBuffer":{"type":"Buffer","data":[120,99,177,70,82,120,236,168,40,65,69,115,131,130,228,38,25,22,233,136]},"announce":[],"urlList":[]}}