{"title":"Avengelyne #1-8 (2011-2012) [Image Comics]","uid":7815705,"size":161792628,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:797760576c2da0a82a850f8d67254842f53d0ec3&amp;dn=Avengelyne+%231-8+%282011-2012%29+%5BImage+Comics%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackcanary","files":-1,"time":1352654483,"description":"English | CBR | 9 Issues\n\nAvengelyne #1-8 (2011-2012)\nPublisher:  Image Comics\nPublication Date:  July 2011 - May 2012\n\nThere are two releases of #1 in here each with a different cover.\n\nWritten by Rob Liefeld (#1-2) and Mark Poulton (#1-8)\nArt by Owen Gieni\n\nAvengelyne #1\n'DEVIL IN THE FLESH,' Part One The legendary fallen angel returns to comics. As New York City's sins are covered with a fresh blanket of snow, the psychotic serial killer, Torment, is hard at work creating new ones. Meanwhile, Avengelyne has her hands full with the Red Dragon who has taken a human vessel in search of a new apprentice. Who has the Dragon chosen as his vessel and does it have anything to do with Avengelyne's new look? All this plus the introduction of the stunning, Heaven Starr! AVENGELYNE is a new ongoing supernatural series written by MARK POULTON (Koni Waves) with art by OWEN GIENI and letters and color assists by DEXTER WEEKS.\n\nAvengelyne #2\n'DEVIL IN THE FLESH,' Part Two In his search for a new apprentice, the Red Dragon has taken control of Avengelyne's body forcing her essence into Heaven Starr. Meanwhile, Torment targets the New Church of the People. Plus, the return of Passover!\n\nAvengelyne #3\n'DEVIL IN THE FLESH,' Conclusion The thrilling conclusion to the first story arc! Has Hell found its new second in command? As Avengelyne battles the serial killer Torment, the Red Dragon shows his true form in battle against Passover!\n\nAvengelyne #4\n'THE HAND OF GOD,' Part One The Coven guest star! A newspaper headline sends Avengelyne and Passover to a sleepy little beach town in Southern California to investigate a demon sighting. Meanwhile, Father Peter welcomes Father Michael O'Bannon, who has left Boston for the New Church of the People. Unfortunately, he doesn't leave behind his violent past as the bible thumping vigilante Priest makes his return! Plus, an 'Extreme Origins' back-up written by MARK POULTON, with art by a guest artist!\n\nAvengelyne #5\nAvengelyne and Passover question the Four Horsemen about their reappearance on Earth, as Heaven Starr nurses a recuperating Father Peter back to health after a recent attack. Meanwhile, Operation Hellstrike sends their latest recruit, Special Agent Devlin to investigate the recent paranormal activity in New York City, which puts him right in the path of Priest. Plus, an 'Extreme Origins' back up story written by MARK POULTON, with art by a guest artist!\n\nAvengelyne #6\nConclusion to the second story arc! Avengelyne and Passover join Devlin on his exploration of the paranormal and learn more about his secret past with Operation Hellstrike. Meanwhile, Father Michael pays a visit to Torment, Ned Crowley, as he awaits trial! Will Priest tag along for the visit? Plus, an Extreme Origins back-up written by MARK POULTON with art by a guest artist!","torrent":{"xt":"urn:btih:797760576c2da0a82a850f8d67254842f53d0ec3","amp;dn":"Avengelyne+%231-8+%282011-2012%29+%5BImage+Comics%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"797760576c2da0a82a850f8d67254842f53d0ec3","infoHashBuffer":{"type":"Buffer","data":[121,119,96,87,108,45,160,168,42,133,15,141,103,37,72,66,245,61,14,195]},"announce":[],"urlList":[]}}