{"title":"PC Ã‚Â» FALLOUT NEW VEGAS Full Game directplay by globe@","uid":5899283,"size":4391503882,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7b121cb981a2a0e4a9cabcd40c4fa1c7c014a51c&amp;dn=PC+%C3%82%C2%BB+FALLOUT+NEW+VEGAS+Full+Game+directplay+by+globe%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":-1,"time":1287623576,"description":"* Hello PC games fans ...\n\n\n* Play the new FALLOUT game ...\n\n\n* The freeware FREEARC is needed to extract the arc file\n\n\n* FILE INFO :  COMPLETE GAME with only 1 video worked and correct adjustments not interfering minimally with the gameplay\n\n\n* GAMEPLAY : *\n\n* Obsidian Entertainment presents new features and improvements in Fallout: New Vegas that are implemented upon the foundation of Fallout 3.\n The Vault-Tec Assisted Targeting System, or V.A.T.S., will have the ability to use new special attacks.Usage of certain melee weapons will trigger unique attack animations. For example, using a 9 iron would show up as &quot;Fore!&quot;, and sends the enemy reeling for a period of time. Also, the developer added the ability to use the iron sights on almost all guns, excluding larger weapons that are shot from the hip, with better over-the-shoulder view for third-person combat. New weapons, some Fallout 3 weapons, and a weapon modification system are introduced in Fallout: New Vegas. The modification system allows for weapon modifications, such as mounting scopes, modifying rate of fire, and changing size of magazine. Crafting will also play a role in weaponry, with the player being able to craft ammunition, such as hand-loaded rounds. In addition, a plant-harvesting system similar to The Elder Scrolls series will be in place for the player to use such plants in bullets, chems, for healing, stats, and for other handy uses.\n The quantity of factions prompted developers to reintroduce the reputation system that was absent in Fallout 3. The degree of faction loyalty influences the \nplayer's reputation. Reputation affects the behavior of faction non-player characters (NPCs) toward the player, and reflects the impacts of selected choices in \nthe world. Availability of dialogue options with NPCs are based upon skills, reputation and karma. Skills have a bigger effect on conversation choices. The \nsuccess or failure of speech is dependent on skill level rather than chance as seen in Fallout 3. Companion behavior and tasks are controlled using the new &quot;companion wheel.&quot; Fallout 3 presented companion commands in a conversational dialogue menu. The new Companion Wheel offers command execution by selecting commands that are presented in a radial and graphical menu. Josh Sawyer states the Companion Wheel offers ease of companion interaction.Such examples of companion commands include setting and changing its combat tactics, its default behavior towards foes and usage frequency of available resources. The player receives a special perk dependent upon the companion recruited.[citation needed]\n In New Vegas, the player can visit casinos to participate in mini-games, including blackjack, slots, and roulette. You can either win or lose money at these mini \ngames. Designer Chris Avellone said the mini-games were done by a programmer experienced in programming non-table gaming machines.\n\n\nMINIMUM SYSTEM REQUIREMENTS :\n========================  \n\n* Windows 7/Vista/XP\n* Dual Core 2.0GHZ\n* 2GB Ram\n* 10GB HDD Space\n* GeForce 6 Series or ATI 1300 Series Video Card\n\n-Supported Video Card Chipsets:\nATI HD 5800 series\nATI HD 5700 series\nATI HD 4800 series\nATI HD 4600 series\nATI HD 3800 series\nATI HD 3600 series\nATI HD 3400 series\nATI HD 2900 series\nATI HD 2600 series\nATI HD 2400 series\nATI X1900 series\nATI X1800 series\nATI X1600 series\nATI X1300 series\nATI X850 series\n\nNVIDIA GeForce 400 series\nNVIDIA GeForce 200 series\nNVIDIA Geforce 9800 series\nNVIDIA Geforce 9600 series\nNVIDIA Geforce 8800 series\nNVIDIA Geforce 8600 series\nNVIDIA Geforce 8500 series\nNVIDIA Geforce 8400 series\nNVIDIA Geforce 7900 series\nNVIDIA Geforce 7800 series\nNVIDIA Geforce 7600 series\nNVIDIA Geforce 7300 series\nNVIDIA GeForce 6800 series\n\n\nSPECIAL NOTE ABOUT THE REQUIREMENTS : the minimum indicators says that 2 gb ram is the minimum but i think the probability of xp users with 1 gb or 1.5 gb ram to play the game it is possible .\n\n\n\n\n* enjoy ... *","torrent":{"xt":"urn:btih:7b121cb981a2a0e4a9cabcd40c4fa1c7c014a51c","amp;dn":"PC+%C3%82%C2%BB+FALLOUT+NEW+VEGAS+Full+Game+directplay+by+globe%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b121cb981a2a0e4a9cabcd40c4fa1c7c014a51c","infoHashBuffer":{"type":"Buffer","data":[123,18,28,185,129,162,160,228,169,202,188,212,12,79,161,199,192,20,165,28]},"announce":[],"urlList":[]}}