{"title":"Marvel vs Capcom 2 - DVD Rebuild - NTSC-U (MvC 2)","uid":3674135,"size":121450489,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:7b546ba69a4f3422355e7ae99a772dd68a1cc93a&amp;dn=Marvel+vs+Capcom+2+-+DVD+Rebuild+-+NTSC-U+%28MvC+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FieroGT42","files":5,"time":1177650090,"description":"[===== Stuff =====]\n\nMarvel vs Capcom 2 PS2 (NTSC U), CD-to-DVD rebuild\n\nAwesome game, often hard to find, and even used copies sell for far too much.\n\nThis rebuild gives slightly shorter load times on most PS2s, lets fliptops &amp;\nSlim Kit systems boot with Swap Magic DVD rather than the Swap Magic CD\n(which is notoriously terrible quality and refuses to boot), and also\neliminates the need to use CD/DVD Loader v7 with earlier versions of SM.\n\nIt should load in any system capable of booting PS2 DVD backups.  I&amp;#039;ve already\ntested this on my own fliptop with SM 3.3 and my friend&amp;#039;s Slim Kit Pro with SM\n3.6.  It loads faster, and never fails to boot.\n\nPlease be patient while downloading, and please stay online until this gets a\nfew distributed copies.  My upload bandwidth is terrible at the moment\ncompared to my downstream.  Thank you, and enjoy the game!\n\n&quot;Rule the arena of the world&amp;#039;s two most powerful fighting universes.  Marvel\nvs. Capcom 2 is bar-none, the most insane tag-team fighting game on the\nplanet!  An unprecedented 56 playable characters raises the bar on arcade\nfighting with 3 on 3 tag-team battles, unbelievable control and hyper-fast\nanimation.  Pick a fight with your favorite legendary Capcom characters and\nSuper Heroes from the Marvel Universe and watch the super combos fly.&quot;\n\n\n[===== What to Do Next =====]\n\nRun the EXE file to extract the ISO image.\n\nBurn to DVD at the slowest speed your burner supports, or at 4x, using good\nquality media.  I suggest certified Taiyo Yuden above all others, even over\nRitek RiData.  At the time I wrote this, you can still get a spindle of 100\nfor about $0.40 each AFTER shipping, so there is NO reason to skimp on media.\n\nBoot on any modified PS2 as you would with any DVD backup.\n\n\n[===== Bit Twiddling =====]\n\nPackaged as a self-extracting UHArc archive, better than ZIP and RAR all\naround, faster than 7zip and usually the same compression as well.\n\nBrought to you by gh0st - Member of the underground returned once again from\nthe legion of dead and defunct.  Hacking, cracking, ripping, and fone\nphreaking since before most of those other jokers got their first console ;)\n\nIf you have any requests for rare, old, or hard-to-find games or applications,\nbeam me a few electron pulses.  The best way to do so at this time is to\nmessage FieroGT42 on Demonoid or gh0st on Blackcats-Games.\n\nomg hax,\ngh0st","torrent":{"xt":"urn:btih:7b546ba69a4f3422355e7ae99a772dd68a1cc93a","amp;dn":"Marvel+vs+Capcom+2+-+DVD+Rebuild+-+NTSC-U+%28MvC+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b546ba69a4f3422355e7ae99a772dd68a1cc93a","infoHashBuffer":{"type":"Buffer","data":[123,84,107,166,154,79,52,34,53,94,122,233,154,119,45,214,138,28,201,58]},"announce":[],"urlList":[]}}