{"title":"I Have A Dream","uid":7735828,"size":876820,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7bd74ba04027e586a0e581434e9cb636caf40c0f&amp;dn=I+Have+A+Dream%09&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ganeshbgl23","files":1,"time":1350484311,"description":"The most cherished feeling in this entire world is just dream about your entire life. Having previously penned down bestsellers on the domain of entrepreneurship, Connect the Dots and Stay Hungry Stay Foolish, Rashmi Bansal has penned down her third book I have a Dream on the same lines. The context in which this book differs from the others is that it is centered on the topic of Social Entrepreneurship.\n\nThese books has the inspiring and interesting stories of 20 idealists who act and think like entrepreneurs, but have dedicated their lives to various causes that do good to mankind in one way or the other.\n\nI Have A Dream is divided into three parts: Rainmakers, Changemakers and Spiritual Capitalists. The first section, Rainmakers has stores of 11 entrepreneurs whose organizations make profits but for them profit making is not the sole driving force.\n\nThe next section belongs to the Changemakers, genuine and inspirational change agents who have started movements that would have a positive impact on the society we live in. These areas range from topics ranging from education to RTI activism.\n\nThe third section, Spiritual Capitalists is about those people who have imbibed the art of spiritualism and common good.\n\nThe book covers entrepreneurial figures like Dhruv Lakra, Mirakle Couriers, Arvind Kejriwal, Parivartan and more.\n\nAbout the Author\nRashmi Bansal is an entrepreneur, writer and a youth expert. She started off as a blogger and is now the proud author of three bestselling books. This book sold more than 300,000 copies and was also translated into 8 languages. She is also an IIM Ahmedabad alumnus. Her blog, Youth Curry has articles on entrepreneurship, youth and careers. Rashmi is also the Consulting Editor for a TV show on UTVI called Cracking Careers.\n\nOther Popular Rashmi Bansal Books\n\nConnect the Dots\nI Have a Dream\nWriting Style\n\nThe book has a very conversational tone and hence is very appealing in its approach. As Rashmi Bansal is an entrepreneur herself, she delves deep down into the personas of the entrepreneurs. The book was greatly appreciated for its helpful and inspirational content.","torrent":{"xt":"urn:btih:7bd74ba04027e586a0e581434e9cb636caf40c0f","amp;dn":"I+Have+A+Dream%09","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bd74ba04027e586a0e581434e9cb636caf40c0f","infoHashBuffer":{"type":"Buffer","data":[123,215,75,160,64,39,229,134,160,229,129,67,78,156,182,54,202,244,12,15]},"announce":[],"urlList":[]}}