{"title":"Uprising! Hungary 1956: One Nation's Nightmare","uid":11691292,"size":2579650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c5baf1acd0b1bf143afbcd12a3b31b924067f11&amp;dn=Uprising%21+Hungary+1956%3A+One+Nation%27s+Nightmare&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1423550867,"description":"David Irving, author of many well known dissident histories including The Rise and Fall of the Luftwaffe, the Destruction of Dresden, and Hitler's War, began to re-examine another piece of the world's tragic history: the spontaneous national uprising of the Hungarians against against rule from Moscow against the faceless, indifferent, incompetent functionaries who had turned their country into a pit of Marxist misery in one short decade: the funkies, Irving calls them, adapting the Hungarian word funkcionariusok, and there is no doubt that after this book the word funky will have a new meaning in the English language. He could hardly have found a more topical year to publish his results: the year in which the Russians invaded Afghanistan, in which Rhodesia has chosen a Marxist government, in which Yugoslavia faces a new Soviet presence. Irving was officially permitted to visit Budapest several times, he talked with eye witnesses and survivors there and obtained new documents and photographs from them. He traced and questioned the men who had been kidnapped, exiled, imprisoned and put on trial with the prime minister Imre Nagy, who was sentenced to death, and members of Nagy's family. It is Irving's assessment of Imre Nagy that will raise eyebrows, together with his discovery among official records of evidence that anti-Semitism was one of the motors of the popular uprising. He has made use of hundreds of interrogation reports prepared at the time by American agencies, and supports this material by diplomats' diaries and the recollections of western newspapermen who went into Hungary. The resulting study is a compelling autopsy of a failed revolution: viewed both from inside the council chambers of the powerful and from street level, where the nameless rebels are given names and personalities and profiles by Irving, thanks to the detailed records of the American psychiatrists who saw them. It is a book with a cast of ten million. David Irving tries with humor and concrete examples to understand what built up the revolutionary rage within them. The real lessons are about the Soviet Union's unfrontiered cynicism: the Kremlin leaders have never cared about world opinion, and it is folly to expert them to abide by normal rules of diplomacy when their own imperialistc conquests are at stake. The funkies know that the world has a short memory. In fact the funkies bank on it","torrent":{"xt":"urn:btih:7c5baf1acd0b1bf143afbcd12a3b31b924067f11","amp;dn":"Uprising%21+Hungary+1956%3A+One+Nation%27s+Nightmare","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c5baf1acd0b1bf143afbcd12a3b31b924067f11","infoHashBuffer":{"type":"Buffer","data":[124,91,175,26,205,11,27,241,67,175,188,209,42,59,49,185,36,6,127,17]},"announce":[],"urlList":[]}}