{"title":"Marvin Gaye - What's Going On [Deluxe] 2001 320 vtwin88cube","uid":6657562,"size":379498410,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7cb6f92da8413d576d38444ae7a51a2c997a1fbd&amp;dn=Marvin+Gaye+-+What%5C%27s+Going+On+%5BDeluxe%5D+2001+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1315377891,"description":"Marvin Gaye\nWhat's Going On\n2 CD Deluxe Edition (2001)\n\n\n\n\nOne of the most gifted, visionary, and enduring talents ever launched into orbit by the Motown hit machine, Marvin Gaye blazed the trail for the continued evolution of popular black music. Moving from lean, powerful R&amp;B to stylish, sophisticated soul to finally arrive at an intensely political and personal form of artistic self-expression, his work not only redefined soul music as a creative force but also expanded its impact as an agent for social change.\n\nMarvin Pentz Gay, Jr. (in the style of his hero Sam Cooke, he added the &quot;e&quot; to his surname as an adult) was born April 2, 1939, in Washington, D.C. The second of three children born to the Reverend Marvin Gay, Sr., an ordained minister in the House of God -- a conservative Christian sect that fuses elements of orthodox Judaism and Pentecostalism, imposes strict codes of conduct, and observes no holidays -- he began singing in church at the age of three, quickly becoming a soloist in the choir. Gaye later took up piano and drums, and music became his escape from the nightmarish realities of his home life -- throughout his childhood, his father beat him on an almost daily basis. \n\n\n\n\nFormat:\t\t\tMp3\nBitrate:\t\t320 CBR\nContains:\t\tAlbum Art &amp; ID Tags\nOriginal Release:\t1971\n\n\n\n\nIf it's easy to be a little cynical about Universal/Motown's 2001 Deluxe Edition reissue of Marvin Gaye's What's Going On, it's only because Motown endlessly reissued the album during the CD era, trumpeting each as the definitive issue (rather ironic for an album Berry Gordy didn't even want to release at the time). Still, Universal's Deluxe Edition series is proving to be a phenomenal collectors-oriented line, filled with lavish, detailed packaging and unpredictable turns, and What's Going On is no exception to the rule. To begin with, the remastering of the original album is excellent, the best yet, although that still isn't enough to make this worth buying for the hardcore fans who have purchased the album again and again over the years. That's what the other disc and a half of bonus material is for. First, there's the &quot;original Detroit mix&quot; of the album prepared while Gaye was out of town, filming a movie. A little bolder and sparer than the released record, with the strings noticeably relegated to the background, it's interesting, not revelatory, though its stripped-back feel is refreshing after hearing the album countless times. A rhythm-and-strings mix of &quot;What's Going On&quot; is tacked onto the end of the first disc, before the second disc begins with a new, previously unreleased live album that finds Gaye running through the album (minus &quot;Mercy Mercy Me [The Ecology]&quot;) and performing a medley of '60s hits. It was his first performance in four years, and while unnecessary, it is fascinating and certainly worth the time of hardcore fans, as are the original single versions of &quot;What's Going On,&quot; &quot;God Is Love,&quot; and &quot;Sad Tomorrows,&quot; plus the previously unreleased &quot;Head Title&quot; (aka &quot;Distant Lover&quot;). This is certainly a package for fans, but it's also the ideal fan package -- beautifully made and filled with rarities that are necessary for fans, making them feel fine about buying this record again. Especially since this is so well done, it's hard to imagine Universal/Motown bettering it.\n\n\n\n\n\nAudio-Info:\n\n\n\nDisc 1\n\n\n\n01. What's Going On\n02. What's Happening Brother\n03. Flyin' High (In The Friendly Sky)\n04. Save The Children\n05. God Is Love\n06. Mercy Mercy Me (The Ecology)\n07. Right On\n08. Wholy Holy\n09. Inner City Blues (Make Me Wanna Holler)\n10. What's Going On (Original Detroit Mix)\n11. What's Happening Brother (Original Detroit Mix)\n12. Flyin' High (In The Friendly Sky) (Original Detroit Mix)\n13. Save The Children (Original Detroit Mix)\n14. God Is Love (Original Detroit Mix)\n15. Mercy Mercy Me (The Ecology) (Original Detroit Mix)\n16. Right On (Original Detroit Mix)\n17. Wholy Holy (Original Detroit Mix)\n18. Inner City Blues (Make Me Wanna Holler) (Original Detroit Mix)\n19. What's Going On (Rhythm And Strings Mix)\n\n\n\n\n\nDisc 2\n\n\n\n01. Sixties Medley: That's The Way Love Is/You/I Heard It Through The Grapevine\n02. Right On (Live)\n03. Wholy Holy (Live)\n04. Inner City Blues (Make Me Wanna Holler) (Live)\n05. What's Going On (Live)\n06. What's Happening Brother (Live)\n07. Flyin' High (In The Friendly Sky) (Live)\n08. Save The Children (Live)\n09. God Is Love (Live)\n10. Stage Dialogue (Live)\n11. Inner City Blues (Make Me Wanna Holler) (Reprise) (Live)\n12. What's Going On (Reprise) (Live)\n13. What's Going On (Original Single Version)\n14. God Is Love (Original Single Version)\n15. Sad Tomorrows (Original Single Version)\n16. Head Title  (aka Distant Lover)\n\n\n\n\n\n\n\n\n\n            ****Support The Artists &amp; Buy It If You Like It.****\n\n\n                ****Enjoy &amp; Please Don't Forget To Seed!****\n\n\n\n\n\n","torrent":{"xt":"urn:btih:7cb6f92da8413d576d38444ae7a51a2c997a1fbd","amp;dn":"Marvin+Gaye+-+What%5C%27s+Going+On+%5BDeluxe%5D+2001+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cb6f92da8413d576d38444ae7a51a2c997a1fbd","infoHashBuffer":{"type":"Buffer","data":[124,182,249,45,168,65,61,87,109,56,68,74,231,165,26,44,153,122,31,189]},"announce":[],"urlList":[]}}