{"title":"MK-ULTRA and the launching the psychedelic and environmental mov","uid":14142997,"size":566363462,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7cd3e03f44c5a97dff288cc2da4571f967c35131&amp;dn=MK-ULTRA+and+the+launching+the+psychedelic+and+environmental+mov&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"holocen","files":6,"time":1459634006,"description":"The authors of the database are people behind Gnostic Media research &amp; publishing. I included the full version of Personal Brain software for your convenience.The subject is MK-ULTRA and the launching the psychedelic and environmental movements. As far as I know this is the best Intelligence database available for ordinary citizens.\r\n\r\nHow to install and use the database:\r\n\r\nFor use in the software version only (this version is the best, clearest representation of the database and the easiest to follow and research). 1) This version must be OPENED into the Brain software after installation. Once the importation is complete, 2) the software will attempt to ask you for a username and password to log into the server. Click &quot;Do not connect to a server&quot;. 3) A window will pop up and ask &quot;If you do not connect to a server, you will not be able to put your Brains online nor sync between computers. Are you sure you don't want to connect?&quot; Select the check-box &quot;Always do this&quot; 4) and then click &quot;Do Not Connect&quot;. 5) You will be brought to a window showing the available &quot;Investigating Wasson Brain&quot; - double click and you're now in the database viewing the information.\r\n\r\nHow to view the information in the database:\r\n\r\nConnections Above each data point are things that influence that data point: Such things can be parents, or organizations like the CIA, or fraternities, employers, etc. Below each data point are things that the data point created or influenced - such as children, books they authored, programs they started or directed, companies they ran or directed, or people they had serious influence over, etc. To the far left are husbands, wives, brothers, sisters, cousins, friends and associates of each data point and leads to possibly related information or ideas. To the far right are 3rd hand investigative leads that are pulled up by the other related entries in the data base. On the bottom of the screen, if not minimized, will show citations: in the text box, as well links, videos, audio, books, and other information relating to that data point and how it relates to the others around it. Each citation should be studied. If you don't find the citation there, check those directly around the center connection, and if that doesn't provide the citations, usually a quick online search will be all you need to find the information to explain that connection. Sometimes it will require reading a book to get the exact information","torrent":{"xt":"urn:btih:7cd3e03f44c5a97dff288cc2da4571f967c35131","amp;dn":"MK-ULTRA+and+the+launching+the+psychedelic+and+environmental+mov","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cd3e03f44c5a97dff288cc2da4571f967c35131","infoHashBuffer":{"type":"Buffer","data":[124,211,224,63,68,197,169,125,255,40,140,194,218,69,113,249,103,195,81,49]},"announce":[],"urlList":[]}}