{"title":"I'm Sorry, I Love You/Mianhada, saranghanda(2004)","uid":8731674,"size":11754121377,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7ee714dc56c1ab443c65cadb07438220cf6ba179&amp;dn=I%27m+Sorry%2C+I+Love+You%2FMianhada%2C+saranghanda%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"app1985","files":-1,"time":1374616928,"description":"Year: 2004\nCountry: South Korea\nGenre: Drama, Romance\nDuration: 16 episodes, 70 minutes\n\nRussian subtitles\n\nVariants of the name: Mianhada, Saranghanda / MiSa / Sorry I Love You / Sorry But I Love You\n\nDirector: Lee Hyung Min / Lee Hyung Min (Let's Go To School, Sang Doo!)\nScreenwriter: Lee Kyung-hee (A Love To Kill, Let's Go To School, Sang Doo!, Thank You)\n\nStarring: So Ji Sup as Cha Moo-hyuk (Cha Moo-hyuk) (What Happened in Bali)\nIm Su Jung as Song Eun-chae (Eun Chae Son) (I'm A Cyborg, But Thats Ok, Happiness, ... ing)\nJung Kyung Ho as Choi Yune (Choi Yune) (Time of Dog &amp; Wolf)\nSuh Ji Young as Kang Min-joo (Kang Min Zhu)\nChoi Yeo Jin as Moon Ji-young (Moon Ji Young)\n\nDescription: The Story of an abandoned child. Cha Moo Hyuk was adopted by foreigners and taken to Australia. But the foster family threw him into the street. His girlfriend throws him for a rich foreigner. He's like a dog sleeping in doorways and makes a living robbery and fraud.\nA tragic accident returns it to Korea, where he discovers that his mother is rich and famous, she threw it not from want and hunger, but just on a whim. And she has another adored and spoiled son - a popular singer in Korea.\nHis heart corrodes resentment and hatred of the mother and to the world, to such an unjust and cruel.\nBut the case brings him to sleep Eun Chae, naive, kind and caring woman, his manager moody brother, singer, hopeless and hopelessly in love with her ward. She reveals to him that loyalty and devotion are still alive in this world.\nTook up the translation, because today it is the most powerful of the Korean dramas I have visited.\nFirst, it is based is really a touching story of an abandoned child, abandoned by the whole world, whose heart is hardened and filled with righteous anger and resentment. And as he learns to love again, to live and die.\nSecondly, it is a good combination of a great script and a talented director's work.\nThirdly, terrific acting. All the actors are coping magnificently, each character is bright and has a meaning.\nFourth, the soundtrack of unearthly beauty.\nAnd finally, this dorama has long been &quot;recognized classic of the genre&quot;, ranking her show in Korea itself was an all-time high, and fans of dramas invariably mark it as one of the best Korean dramas ...\n\n\n\nQuality: HDTVrip\nFormat: AVI\nVideo codec: DivX\nAudio codec: MPEG Audio\n &lt;a href=&quot;\nhttp://movie.douban.com/subject/1782142/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://movie.douban.com/subject/1782142/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7ee714dc56c1ab443c65cadb07438220cf6ba179","amp;dn":"I%27m+Sorry%2C+I+Love+You%2FMianhada%2C+saranghanda%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ee714dc56c1ab443c65cadb07438220cf6ba179","infoHashBuffer":{"type":"Buffer","data":[126,231,20,220,86,193,171,68,60,101,202,219,7,67,130,32,207,107,161,121]},"announce":[],"urlList":[]}}