{"title":"Nightcore -  Demons.mp4","uid":10990871,"size":10836051,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7f604f425199bccd87e0b1c19ddc1bd9f9e022b1&amp;dn=Nightcore+-++Demons.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1409965056,"description":"&quot;Demons&quot; is a song recorded by American rock band Imagine Dragons. It was produced by record producer Alex da Kid, written by Imagine Dragons and Alex da Kid, and recorded by the band. The song appears on their major-label debut extended play Continued Silence and also makes an appearance on their debut studio album Night Visions as the fourth track. &quot;Demons&quot; was solicited to American triple-A radio stations on January 28, 2013 and to modern rock stations on April 1 and serves as the album's overall fifth single and was released as the third single from Night Visions in the United States,[1][2][3] and was later released to contemporary hit radio stations on 17 September 2013 as an official single.[4] &quot;Demons&quot; is an indie rock ballad while the lyrics portray the protagonist warning the significant other of his or her flaws.\n\nThe song has been a commercial success, becoming their second top ten single after &quot;Radioactive&quot;. It spent twelve weeks in the top ten on the Billboard Hot 100, four of which were spent at its number six peak. It is Imagine Dragons' second song to stay more than one year on the Hot 100. It has sold over 3 million copies in the US as of January 2014.[5] It has also been a moderate commercial success worldwide, charting in several countries. The song won a MuchMusic Video Award for International Video of the Year - Group (2014) and an iHeartRadio Music Award for Alternative Rock Song of the Year (2014).","torrent":{"xt":"urn:btih:7f604f425199bccd87e0b1c19ddc1bd9f9e022b1","amp;dn":"Nightcore+-++Demons.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f604f425199bccd87e0b1c19ddc1bd9f9e022b1","infoHashBuffer":{"type":"Buffer","data":[127,96,79,66,81,153,188,205,135,224,177,193,157,220,27,217,249,224,34,177]},"announce":[],"urlList":[]}}