{"title":"Reinventing Collapse (2008) by Dmitry Orlov","uid":10482970,"size":5072255,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82801d12a16dd0afcbb1956ea481da7147a7211b&amp;dn=Reinventing+Collapse+%282008%29+by+Dmitry+Orlov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1404420564,"description":"Reinventing Collapse - The Soviet Example and American Prospects (2008) by Dmitry Orlov.pdf\n\nThe United States is in steep decline. Plagued by runaway debt, a shrinking economy, and environmental catastrophes to rival Chernobyl, the United States has been retracing the trajectory of the Soviet Union in the early 1980s toward national bankruptcy and political dissolution. By comparing a collapse that has run its course to one that is now unfolding, Dmitry Orlov holds a unique lens up to America's present and future.\n\nAs Orlov's predictions continue to come true, his writing continues to gain mainstream acceptance. This revised and updated edition of Reinventing Collapse examines the circumstances of the demise of the Soviet superpower and offers clear insights into how we might prepare for the events that are unfolding here.\n\nOrlov gives no quarter to prophets of doom and gloom, finding plenty of room for optimism, if only we focus our efforts on personal and cultural transformation instead of trying to perpetuate an impossible status quo. This challenging yet inspiring and surprisingly upbeat work is a must-read for anyone concerned about peak oil, the environment, geopolitics, international relations, and life in a resource-constrained world.\n\nPaperback: 177 pages\nPublisher: New Society Publishers\nLanguage: English\nISBN-10: 0865716854\nISBN-13: 978-0865716858","torrent":{"xt":"urn:btih:82801d12a16dd0afcbb1956ea481da7147a7211b","amp;dn":"Reinventing+Collapse+%282008%29+by+Dmitry+Orlov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82801d12a16dd0afcbb1956ea481da7147a7211b","infoHashBuffer":{"type":"Buffer","data":[130,128,29,18,161,109,208,175,203,177,149,110,164,129,218,113,71,167,33,27]},"announce":[],"urlList":[]}}