{"title":"Johnny Winter-Live Bootleg Series, Vol. 3(2008)[EAC-FLAC][TWR123","uid":4850196,"size":362811280,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:82daece9eaabd58ef0b2fc972cf2c925ed484d2c&amp;dn=Johnny+Winter-Live+Bootleg+Series%2C+Vol.+3%282008%29%5BEAC-FLAC%5D%5BTWR123&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thewall68","files":19,"time":1239838516,"description":"Releaser: thewall\n\nExtractor: EAC 0.99 prebeta 4  \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD \nArtwork:  Full Scans 300dp \n\n\nProduct Description\n\n\nLike any life-changing, chromosome-rearranging event, all guitar fans remember their\nfirst time seeing Johnny Winter perform live. For me, the year was 1973, at Madison Square Garden in New York City. Johnny was then embarking on his Still Alive and Well comeback tour. Appearing onstage all in white, his platinum-white hair flowing down to his elbows and playing a blinding white Gibson Firebird V, Johnny beamed with the unbridled energy of a force from some distant galaxy. His performance a combination of earth-shattering guitar playing, searing vocals and wildly energetic stage presence--was nothing short of brilliant. He rocked the Garden so hard that night, the entire building shook in rhythm with the music. During the barn-burning boogie track Rock &amp; Roll, I literally believed that the Garden was going to blast apart at the seams.\n\nIn the ensuing years, I have seen Johnny perform countless times in arenas, amphitheaters, 1200-seaters, sardine-canned packed clubs (such as NYC s legendary Lone Star CafÃƒÂ©), rehearsal studios, and even Johnny s own living room. Seeing and hearing Johnny Winter play live is an experience like no other, because, simply stated, no other guitar player has ever entwined raw power, pure emotion, conviction, and virtuosity more effectively than he has.\n\nLive Bootleg Series: Vol. 3 opens with Mojo Boogie. Johnny leads off the tune with some unaccompanied virtuoso slide work, his guitar tuned to open D (one of his favorite tunings for slide), before the band kicks in for a blazing extended intro solo, with bassist Paris offering some double duty by coping Johnny s slide melodies note-for-note on harmonica.\n\nThe second cut, Stranger Blues, is a killer Elmore James boogaloo that Johnny rips apart with more slide work in open D. This is the type of hard-rockin blues Johnny first introduced to the world back in 1969 with his seminal release, The Progressive Blues Experiment.\n\nOn the third track, I Smell Trouble Johnny displays the kind of mind-blowing speed and virtuosity that he usually reserves for long workouts over slow blues, while Boot Hill is a hard-driving mid-tempo shuffle on which Johnny effortlessly combines slide guitar with some of the fastest single-note work he s ever recorded.\n\nNext up is a very rare live take of Robert Johnson s Stones in My Pass Way, played in front of a small but appreciative audience. Johnny performs the song unaccompanied with a slide on a National steel guitar tuned to open G. I learned about open tunings from listening to Robert Johnson's King of the Delta Blues, Johnny told me back in 1989. I picked up the concept of using open tunings just by using my own ears, and when I discovered how the open tunings worked with the slide, it was quite a revelation.\n\nI m Gonna Murder My Baby, was written by one of Johnny s big guitar influences, Pat Hare. Says Johnny, I m Gonna Murder My Baby is the heaviest blues song ever written!\n\nThis collection rounds out with a smoldering version of Johnny s most well known track, his slide guitar tour-de-force arrangement of Bob Dylan s Highway 61 Revisited. Johnny Winter is regarded as one of the greatest, most original and most influential slide guitarists ever, and this track offers ample testament to that fact.\n\nToday, Johnny Winter is still touring steadily all over the globe, playing and singing as only he can and bringing audiences to their feet wherever he goes. Until the next time you get to see him perform live, Live Bootleg Vol. 3 will keep you covered.\n--Andy Aledort...........................................................................\n\n\nProduced by Johnny Winter from the original source tapes\nRemastered by Joe Reagoso (Deep Purple/Boz Scaggs/Canned Heat) at Friday Music Studios \n\n---------------------------------------------------------------------------------------------\n\n\nFive BLAZING Stars!! WOW! A rockin' live blues compilation that is not to be missed! Virtuoso guitarist and blues-belter Johnny Winter has cranked up another scorcher with Volume 3 of his Bootleg series. Don't let the &quot;Bootleg&quot; title fool you, this, along with Live Bootleg Series, Vol. 1 and Live Bootleg Series, Volume Two, is a Johnny Winter-project from beginning to end with high production values, great liner notes, and excellent sound for the most part. Everything you hear is rare stuff from the personal archives of Johnny Winter that he wanted the fans to hear. Over five decades into his very imposing musical career, which has also seen him play with and produce some of the world's greatest blues legends while becoming a blues legend himself, with this CD compilation Mr Winter has 'cranked it up a notch' with these rare recordings. His vital vocals are especially raw and his slide-friendly Firebird &amp; potent Lazer guitar solos are as awe-inspiring and mind-boggling as ever. Backed by solid groups, there are no 'slick' songs to be heard as Mr Winters and his groups keep one foot in the 'gut-bucket' at all times. BTW, the CD cover features one of the coolest Winter photos ever.\n\nThe 'best of the best' begins with an amazing 15-minute version of the Bobby &quot;Blue&quot; Bland-associated &quot;I Smell Trouble' and it is breathtaking to hear from the standpoint of the group interplay, urgent vocal delivery, and the guitar wizardry which are on full display: add this to your list of very special Johnny Winter performances. For many of us, Johnny has just taken over ownership of Bob Dylan's classic &quot;Highway 61 Revisted&quot; and any Winter live appearance is automatically amped up when it's included. Here he serves it up again BIG TIME, adding in some blazing Firebird guitar licks along with his trademark slide-guitar chordings and echo tremolos. The appearance of the legendary but under-appreciated guitarist and composer Pat Hare's star-crossed song &quot;I'm Gonna Murder My Baby&quot; should attract the interest of any blues fan to 'this song with a true life twist' (unfortunately Hare did just that and died in prison) and Mr Winter's performance is AWESOME. Then Robert Johnson's venerable &quot;Stones In My Pass Way&quot; is Johnny and his steel guitar alone in a mesmerizing, heartfelt performance that seems to stun the audience. One of the best CDs of 2008, &quot;Johnny Winter, Live Bootleg Series, Vol. 3&quot; gets My Highest Recommendation. Bravo, Johnny Winter! Five HUGE Stars\n\n[Amazon user]\n\n\n1.\tMojo Boogie\t \n2.\tStranger Blues\t \n3.\tI Smell Trouble\t \n4.\tBoot Hill\t \t\n5.\tStones in My Pathway\t \n6.\tPenitentiary Blues\t \n7.\tHighway 61 Revisited\n\n","torrent":{"xt":"urn:btih:82daece9eaabd58ef0b2fc972cf2c925ed484d2c","amp;dn":"Johnny+Winter-Live+Bootleg+Series%2C+Vol.+3%282008%29%5BEAC-FLAC%5D%5BTWR123","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82daece9eaabd58ef0b2fc972cf2c925ed484d2c","infoHashBuffer":{"type":"Buffer","data":[130,218,236,233,234,171,213,142,240,178,252,151,44,242,201,37,237,72,77,44]},"announce":[],"urlList":[]}}