{"title":"Neon Trees - Pop Psychology (2014) [FLAC]","uid":10028822,"size":284278876,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:83456147d5e7bc60b3216642fca61e60616ab827&amp;dn=Neon+Trees+-+Pop+Psychology+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1398304384,"description":"\n  Neon Trees - Pop Psychology (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: New Wave, Indie\n  Source: WEB\n  Codec: FLAC\n  Bitrate: ~ 900 kbps \n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Love in the 21st Century\n  02 Text Me in the Morning\n  03 Sleeping with a Friend\n  04 Teenager In Love\n  05 I Love You (But I Hate Your Friends)\n  06 Unavoidable\n  07 Voices in the Hall\n  08 Foolish Behavior\n  09 Living In Another World\n  10 First Things First\n\n  During the time between Neon Trees' 2012 album Picture Show and Pop Psychology, frontman Tyler Glenn went through some big changes, including seeking therapy and coming out as a gay man. It's not surprising, then, that the band's third album is also its most confessional, but Glenn and company still manage to have fun with their emotional crises. The album's song titles read like advice column headlines, and the name Pop Psychology itself is a clever and accurate manifesto: for Neon Trees, the therapeutic value of dancing on your troubles to the perfect pop song always comes first, even when Glenn is pouring his heart out. Fortunately, there's nothing boring about the inevitability of the verse-chorus-verse format when it's as satisfying as Pop Psychology is at its best. &quot;Love in the 21st Century&quot; kicks off the album with the kind of unabashedly catchy fare fans expect, with Glenn sounding equal parts bold and uncertain as he sings about &quot;broken heart technology&quot; over fizzy synths and handclaps. While Neon Trees have gradually tightened up their pop formula since Habits, their first hit, &quot;Animal,&quot; still remains the template for a lot of their music. It makes sense that they reunited with Habits producer Tim Pagnotta, who helps them double down on their new wave and synth pop obsessions and play to their strengths: Glenn's brash yet sensitive vocals and their undeniable way with hooks. Lead single &quot;Sleeping with a Friend&quot;'s breezy synths add '80s soft rock leanings that also pop up on &quot;Foolish Behavior&quot; and the standout &quot;Living in Another World&quot;; while it's not exactly the most expected direction for the band, it conveys the album's sleekness and vulnerability well. There's a similar tension in Pop Psychology's lyrics, which cram in plenty of detail (&quot;Unavoidable&quot; compares a bad relationship to mixed feelings about L.A.; &quot;Voices in the Halls&quot; name-checks Heaven or Las Vegas) while still seeming universal. Knowing Glenn's background gives an extra sting to &quot;Teenager in Love&quot; when he sings &quot;I'm a fool with a curse and a crush,&quot; yet &quot;Text Me in the Morning&quot;'s boy-girl shenanigans are just as vivid. Even if Neon Trees sometimes try a little too hard to be serious on Pop Psychology, it's some of their most heartfelt music and some of their finest.","torrent":{"xt":"urn:btih:83456147d5e7bc60b3216642fca61e60616ab827","amp;dn":"Neon+Trees+-+Pop+Psychology+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83456147d5e7bc60b3216642fca61e60616ab827","infoHashBuffer":{"type":"Buffer","data":[131,69,97,71,213,231,188,96,179,33,102,66,252,166,30,96,97,106,184,39]},"announce":[],"urlList":[]}}