{"title":"Mirage Men: Disinformation Paranoia &amp; UFOs | Mark Pilkington","uid":10879510,"size":798423,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:847f1851aa802bbb59d9b0aaaffeeb9bbccc1a6f&amp;dn=Mirage+Men%3A+Disinformation+Paranoia+%26amp%3B+UFOs+%7C+Mark+Pilkington&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1409018150,"description":"Mirage Men - A Journey into Disinformation, Paranoia and UFOs (2010) by Mark Pilkington.epub\n\nSeeking the truth about UFOs in America, Mark Pilkington and John Lundberg uncover a 60 year-old story stranger than any conspiracy thriller. Through the fascinating account of their quest Mark Pilkington reveals the long history of UFOria and its parallels in little known tales from the murky worlds of espionage, psychological warfare and advanced military technology. Along the way he discovers that the truth about flying saucers is stranger and more complex than either the ufologists or debunkers would have us believe. As he crossed the US meeting intelligence agents, disinformation specialists and UFO hunters Pilkington was confronted with a dizzying array of ever more outrageous claims and counter claims. As a result he began to suspect that, instead of covering up stories of crashed flying saucers, alien contacts and secret underground bases, the US intelligence agencies had actually been promoting them all along. Meanwhile he has to deal with his own uncertainties, the suspicions of the UFO community and a partner who is starting to believe that conspiracy theorists might be right after all. With a fresh, funny and objective approach, Pilkington is the ideal guide to steer us through these strange territories, where nothing is quite as it seems and reality is just a matter of managing perceptions.\n\n320 pages\nPublisher: Constable (July 29, 2010)\nLanguage: English\nISBN-10: 1845298578\nISBN-13: 978-1845298579","torrent":{"xt":"urn:btih:847f1851aa802bbb59d9b0aaaffeeb9bbccc1a6f","amp;dn":"Mirage+Men%3A+Disinformation+Paranoia+%26amp%3B+UFOs+%7C+Mark+Pilkington","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"847f1851aa802bbb59d9b0aaaffeeb9bbccc1a6f","infoHashBuffer":{"type":"Buffer","data":[132,127,24,81,170,128,43,187,89,217,176,170,175,254,235,155,188,204,26,111]},"announce":[],"urlList":[]}}