{"title":"The Long Summer: How Climate Changed Civilization","uid":6902291,"size":3163615,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8501f7e6a106aa39bd32e004e63005a948074b84&amp;dn=The+Long+Summer%3A+How+Climate+Changed+Civilization&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Djofullinn","files":1,"time":1324444619,"description":"Humanity evolved in an Ice Age in which glaciers covered much of the world. But starting about 15,000 years ago, temperatures began to climb. Civilization and all of recorded history occurred in this warm period, the era known as the Holocene-the long summer of the human species. In The Long Summer, Brian Fagan brings us the first detailed record of climate change during these 15,000 years of warming, and shows how this climate change gave rise to civilization. A thousand-year chill led people in the Near East to take up the cultivation of plant foods; a catastrophic flood drove settlers to inhabit Europe; the drying of the Sahara forced its inhabitants to live along the banks of the Nile; and increased rainfall in East Africa provoked the bubonic plague. The Long Summer illuminates for the first time the centuries-long pattern of human adaptation to the demands and challenges of an ever-changing climate-challenges that are still with us today.\n\nBrian Fagan was born in England and studied archaeology at Pembroke College, Cambridge. He was Keeper of Prehistory at the Livingstone Museum, Zambia, from 1959-1965. During six years in Zambia and one in East Africa, he was deeply involved in fieldwork on multidisciplinary African history and in monuments conservation. He came to the United States in 1966 and was Professor of Anthropology at the University of California, Santa Barbara, from 1967 to 2004, when he became Emeritus.\nSince coming to Santa Barbara, Brian has specialized in communicating archaeology to general audiences through lecturing, writing, and other media. He is regarded as one of the world's leading archaeological and historical writers and is widely respected popular lecturer about the past. His many books include three volumes for the National Geographic Society, including the bestselling Adventure of Archaeology. Other works include The Rape of the Nile, a classic history of archaeologists and tourists along the Nile, and four books on ancient climate change and human societies, Floods, Famines, and Emperors (on El NiÃƒÂ±os), The Little Ice Age, and The Long Summer, an account of warming and humanity since the Great Ice Age. His most recent climatic work describes the Medieval Warm Period: The Great Warming: Climate Change and the Rise and Fall of Civilizations. His other books include Chaco Canyon: Archaeologists Explore the Lives of an Ancient Society and Fish on Friday: Feasting, Fasting, and the Discovery of the New World and Cro-Magnon: How the Ice Age gave birth to the First Modern Humans. His recently published Elixir: A History of Water and Humankind extends his climatic research to the most vital of all resources for humanity.\n\nBrian has been sailing since he was eight years old and learnt his cruising in the English Channel and North Sea. He has sailed thousands of miles in European waters, across the Atlantic, and in the Pacific. He is author of the Cruising Guide to Central and Southern California, which has been a widely used set of sailing directions since 1979. An ardent bicyclist, he lives in Santa Barbara with his life Lesley and daughter Ana.\n &lt;a href=&quot;\nhttp://www.amazon.com/Long-Summer-Climate-Changed-Civilization/dp/0465022820/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1324441532&amp;sr=1-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Long-Summer-Climate-Changed-Civilization/dp/0465022820/ref=sr_1_1?s=books&amp;ie=UTF8&amp;qid=1324441532&amp;sr=1-1&lt;/a&gt;","torrent":{"xt":"urn:btih:8501f7e6a106aa39bd32e004e63005a948074b84","amp;dn":"The+Long+Summer%3A+How+Climate+Changed+Civilization","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8501f7e6a106aa39bd32e004e63005a948074b84","infoHashBuffer":{"type":"Buffer","data":[133,1,247,230,161,6,170,57,189,50,224,4,230,48,5,169,72,7,75,132]},"announce":[],"urlList":[]}}