{"title":"Flann O'Brien - The Best of Myles (pdf)","uid":8305171,"size":4547527,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8508b52387e356d9d7556ae3ae26fa7047b99ba2&amp;dn=Flann+O%27Brien+-+The+Best+of+Myles+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1364351147,"description":"Flann O'Brien - The Best of Myles (Dalkey Archive, 1968). 400 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nFlann O'Brien is best known for the very strange novels At-Swim-Two-Birds and The Third Polideman. This is a collection of his hilarious, very weird columns for the Irish Times, published under the name Myles na gCopaleen. Some of it's in Irish, and some is very topical to the time in which it was written. But much is still extremely funny.\n\ndescription:\n\n&quot;The best comic writer I can think of.&quot; - S.J. Perelman\n\nThe great Irish humorist and writer Flann O'Brien, aka Brian O'Nolan, aka Myles na Gopaleen, also wrote a newspaper column called &quot;Cruiskeen Lawn.&quot; The Best of Myles collects the best and funniest, covering such subjects as plumbers, the justice system, and improbable inventions.\n\nFrom Library Journal\n\nThough best known for his fine novels, Irish writer O'Brien also wrote under the name Myles na Gopaleen a newspaper column in the Irish Times called &quot;Cruiskeen Lawn&quot; for more than 30 years. This 1968 volume collects the best of those pieces. O'Brien leans on many Irish cliches (poverty, boozing, etc.) but uses them often with great humor. \n\nReview\n\n&quot;Brilliant, morosely inventive comic turns devoted to O'Brien's favourite topics: the literary life, the Gaelic Revival, civil service bureaucracy, booze and its discontents.&quot; (The Observer )\n\n&quot;This volume collects the best of [his newspaper] pieces. O'Brien leans on many Irish clichs (poverty, boozing, etc.) but uses them often with great humor.&quot; (Library Journal )\n\n&quot;Not to be missed.&quot; (Washington Post )","torrent":{"xt":"urn:btih:8508b52387e356d9d7556ae3ae26fa7047b99ba2","amp;dn":"Flann+O%27Brien+-+The+Best+of+Myles+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8508b52387e356d9d7556ae3ae26fa7047b99ba2","infoHashBuffer":{"type":"Buffer","data":[133,8,181,35,135,227,86,217,215,85,106,227,174,38,250,112,71,185,155,162]},"announce":[],"urlList":[]}}