{"title":"Dane Cook - ISolated INcident","uid":4898327,"size":92172752,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8586856d89712459e7aa780df479adf60adebaf7&amp;dn=Dane+Cook+-+ISolated+INcident&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"-drift-","files":-1,"time":1242432312,"description":"Dane Cook: ISolated INcident is a Comedy Central special which premiered on May 17, 2009 with the CD/DVD release following on May 19[1][2]. In the special, Cook performs to a crowd of only 30 people, at the Laugh Factory[3]. He will begin performing the new material live for the ISolated INcident - Global Thermo Comedy Tour, which began on April 25, 2009[4].\n\n[edit] Track listing\n\n   1. Intro - 0:26\n   2. Obama - 3:45\n   3. Self Assassination - 1:52\n   4. Vernacular - 2:45\n   5. Pissed Off - 1:49\n   6. Twat Swatters - 2:21\n   7. Banter #1 - 0:35\n   8. Mom &amp; Pops - 3:10\n   9. Haters - 4:30\n  10. Adoption - 1:24\n  11. Syncing Feelings - 1:01\n  12. W.W.Y.D.I?? - 4:21 (What Would You Do, If??)\n  13. Interracial Tail - 2:01\n  14. Remote Location - 4:48\n  15. Push And Prey - 0:58\n  16. Big Shot - 2:40\n  17. Rigamarole - 2:26\n  18. Role Play - 4:56\n  19. Hidden Gems - 1:08\n  20. Peanut Butter Smack - 7:04\n  21. War Gamer - 1:47\n  22. Banter #2 - 0:33\n  23. The 'C' Word - 2:19\n  24. Novel Ideas - 1:23\n  25. Spiritual Comeback - 1:23\n  26. Alternate Ending To Track 13 - 0:26\n  27. Banter #3 - 2:53\n\n    * *Tracks 21 - 27 not on TV special.\n\n_____________\n\n-Dane Cook's dualities revealed in 'ISolated Incident' - Geoff Boucher\n\nOn a Sunset Strip balcony, sitting beside an azure pool, Dane Cook makes the confession that America has been waiting for during his two decades as a comic. &quot;Can I just admit to you, you're right,&quot; the 37-year-old said, holding his palms up to the sky. &quot;Look . . . I'm not funny. I'm OK with that. I'm cool with that.&quot;\n\nCook is, of course, joking about his lack of humor, which, if you think about it, is kind of funny -- or maybe it's not funny at all. This is the sort of paradox that swirls around the wildly successful touring comic who, more than anyone else on the comedy scene today, can polarize a cocktail party conversation.\n\nSunday night, Comedy Central will air Cook's new stand-up special, &quot;ISolated INcident,&quot; which be released as an audio album Tuesday and as a DVD later this year. Cook is on tour right now, with three shows in Las Vegas next weekend and a Staples Center appearance on May 30.\n\nBefore hitting the road, he sat down a few weeks ago at the Sunset Tower Hotel to talk about comedy, death, success and controversy, as well as technology, which has been a backbeat to his success in a singular fashion.\n\nWith half-a-million hits per month on his website, a popular blog and 2.5 million friends on his MySpace page, Cook is hard-wired for the digital age in a way that no other comic can rival.\n\n&quot;He built his career leveraging MySpace, but he now has 300,000 Twitter fans and 500,000 Facebook fans, and that's gone up 200,000 in recent weeks,&quot; said Adam Zbar, chief executive of Zannel, which partnered with Cook on his own iPhone application. &quot;He's is the digital-age comedian with the largest online footprint of anyone in comedy.&quot;\n\nThat's a major reason he sells out arenas with startling ease and racks up box-office numbers that are more like Bruce Springsteen than Lenny Bruce; in 2005, for example, he played two shows at Boston Gardens, his hometown, with a combined audience of 38,000. (He is also the first comedian to sell out Staples.) &quot;I've embraced this technology; it's the thing that built my career, but it's also going to be the thing that capsizes me every once in a while,&quot; said Cook, who is attacked with venom and glee across the Internet as unfunny, a joke thief and a star only frat boys could love. &quot;I respond directly to some of it, or I have in the past, but if you do that, well, that's one day a week you have to set aside, a B.S. day.&quot;\n\nIn some ways, Cook's success is a bit like the 1980s music career of Phil Collins -- the more you pull it apart, the harder it is to explain. There's nothing especially mysterious about Cook (far from it, he's pure Boston dude-speak), but many of his comedy peers are mystified by him.\n\nVeteran comic Robert Klein summed up the skeptics' side a few years ago when he said, &quot;With Dane Cook, I just don't see it. I'm going, 'Where's the beef here?' I just don't get it. He made a career for himself on the Internet.&quot;\n\nCook's comedy is observational, antic and smirking. Many comedians are outsiders, either by heritage or disposition, and there's anger or iconoclasm in the best of their jokes. Not Cook, who is white, handsome, tall and cheery. This might explain why he is so popular -- and so ridiculed.\n\n&quot;People want to escape, they want to laugh, and a lot of the stuff that's there right now -- 'The Daily Show,' Letterman and Stephen Colbert -- it's still got a lot of the stuff that's stressing us. The pinprick and the healing is great, but sometimes people want to set all of it aside and just be entertained.&quot;\n\nIn Hollywood\n\nCook is coming off a foray into Hollywood films that didn't go as planned. He starred in a romantic comedy called &quot;Good Luck Chuck&quot; that was neither good nor lucky, and while he held his own as a wannabe serial killer in &quot;Mr. Brooks&quot; (with Oscar winners Kevin Costner and William Hurt), the movie earned more respect than money. Cook has decided to go back the stage, where he has been telling jokes since he was 17 in Boston.\n\n&quot;I think for the first time in a long time I have perspective about what I've accomplished and where I've, well, I don't want to say where I failed, but where I had some bad at-bats,&quot; Cook said. &quot;I didn't have that while it was happening.&quot;\n\nIn the comedy special airing Sunday night, there is a lone camera and a no-frills approach. &quot;When I did the 'Vicious Circle' special it was so huge,&quot; he said referring to the 2006 HBO special that was a career peak. &quot;Here I am in front of 20,000 people, and it's broad and theatrical and 1,000 edits and cuts from show one and show two when I'm pivoting. As much fun as it was to get in there and figure out how to create the perfect show, this time I wanted to flip that completely on its head. One guy, one camera, one night, the good, the bad, the screw-ups.&quot;\n\nThe show was the third of three nights at the Laugh Factory on the Sunset Strip, a venue that has been a home base for Cook since he moved west in the mid-1990s to pursue some sitcom opportunities. (He was in five episodes of &quot;Maybe This Time,&quot; starring Marie Osmond, which didn't fulfill its hopeful title.)\n\n&quot;I was shy and had panic attacks at the beginning, and by the time I got to L.A. I was still introverted but I could put on a brave face,&quot; Cook said. &quot;I had wanted to be on stage doing comedy since I was a little kid, but I would have the hummingbird heartbeat. I was a lot more manic on stage, a lot more physical in my comedy. I'd be sweating by the end.&quot;\n\nJamie Masada, the Laugh Factory's owner since the club opened in 1979, immediately keyed into Cook's enthusiasm and crowd-pleasing sensibilities, which set the newcomer apart from many of the ironic, detached or edgy personas who held the microphone on most nights. &quot;He was happy to be on stage,&quot; Masada said, &quot;and it showed.&quot;\n\n&quot;I'm an entertainer and I'm here to put on a show, and I own that,&quot; Cook said. &quot;It happened to me in New York too, the criticism from other guys backstage, 'You're smiling on stage. What are you smiling about?' &quot;\n\nSome surprises\n\nIn Sunday night's show, Cook doesn't flail nearly as much as he did in his early days, a style that was mocked on YouTube with &quot;MADtv's&quot; Ike Barinholtz doing an unflattering Cook imitation. As with everything involving Cook, the little video has big numbers; it's been viewed more than 1.1 million times and there is a long, raging debate in the comments section -- more than 10,000 opinions, many of them sputtering with passion.\n\nCook isn't quite the guy many people think he is. For one thing, despite the keg-party persona, he says he's never had a drink in his life and doesn't do drugs either. The reason? He says he is so competitive that if he started drinking he would have to be the best at it and that wouldn't end well. He also seems to be trying to review his material to make sure he isn't purposefully hurtful to people, especially women. Cook has five sisters, who have given him a lot of feedback.\n\nPersonally, it's been a difficult few years for Cook, who lost his mother in 2006 after her battle with cancer and then his father the following year. There was also an ugly embezzlement scandal that had Cook's half-brother, Darryl McCauley, charged with siphoning off millions from the comedian's earnings. After those bruising incidents and the Hollywood humbling, the overgrown-kid Cook seems more mature and reserved. His new comedy set reflects some of his pain and the resulting change in demeanor.\n\n&quot;I've been doing this material about deleting my mom from the cellphone,&quot; Cook said. &quot;That moment when I was looking at the number and just as her son and a human being, what it meant that this person was gone and the number was still here. The second thing is the comic mind going, everyone goes through this -- a little dual push and pull. So I told it on stage one night, just really authentically and without too much polish. It felt right.&quot;\n\nCook is no longer jumping at every opportunity that presents itself and he is also trying to enjoy success, which had been difficult in his career ramp-up because his parents' health was eroding. Cook said he is looking for new things to laugh at and, just maybe, he will win over some of the skeptics who believe he is more flash than substance.\n\n&quot;The stuff about my mom and dad, it was a new beginning for me of stepping away from some of the old approaches and tricks and tools,&quot; Cook said. &quot;It was the beginning of figuring out what the new stuff is. I'm very proud of this new show. I wish they could see it.&quot;","torrent":{"xt":"urn:btih:8586856d89712459e7aa780df479adf60adebaf7","amp;dn":"Dane+Cook+-+ISolated+INcident","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8586856d89712459e7aa780df479adf60adebaf7","infoHashBuffer":{"type":"Buffer","data":[133,134,133,109,137,113,36,89,231,170,120,13,244,121,173,246,10,222,186,247]},"announce":[],"urlList":[]}}