{"title":"''Spider'' John Koerner and Willie Murphy - Running Jumping Stan","uid":11029274,"size":318018349,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:85cef73d0a9c31c596a581b3333cd7eb1dcab97c&amp;dn=%27%27Spider%27%27+John+Koerner+and+Willie+Murphy+-+Running+Jumping+Stan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"muttley9","files":14,"time":1410656244,"description":"&quot;Koerner's inspired guitar playing and distinctive singing made the ecstatic album one of the most acclaimed releases of 1969...folk blues and jug-band music blended into a giddy electronic hoedown...its spirit is even more welcome in these decidedly more sober times. Four Stars.&quot; - Rolling Stone\n\nAn oddly effective, one-off marriage of folk-blues and ragtime piano that kicks, to paraphrase Bob Wills, &quot;like four mules pullin' out of a bog hole.&quot; Koerner, Ray &amp; Glover's &quot;Spider&quot; John Koerner provides the playful, what-me-worry, Piedmont-by-way-of-Minnesota blues, and Willie Murphy adds inspired, loose-keyed, ragtime piano. At times, songs like &quot;Red Palace&quot; and &quot;Sometimes I Can't Help Myself&quot; sound like the perfect backdrop for Lilly Langtree in a Dodge City saloon circa 1883. Electric bass crops up here and there for emphasis, but the main vibe is Jesse Fuller meets Big Tiny Little. &quot;Magazine Lady,&quot; a wildly in-the-groove tale of photo lust, is not to be missed. Kudos to eclectic producer Frazier Mohawk (Holy Modal Rounders, Kaleidoscope, Nico) for holding this stew together.","torrent":{"xt":"urn:btih:85cef73d0a9c31c596a581b3333cd7eb1dcab97c","amp;dn":"%27%27Spider%27%27+John+Koerner+and+Willie+Murphy+-+Running+Jumping+Stan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85cef73d0a9c31c596a581b3333cd7eb1dcab97c","infoHashBuffer":{"type":"Buffer","data":[133,206,247,61,10,156,49,197,150,165,129,179,51,60,215,235,29,202,185,124]},"announce":[],"urlList":[]}}