{"title":"Dave Sim - Glamourpuss ","uid":7650332,"size":450072516,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:85d52c3af191e29a70afd435c54180a1002611a4&amp;dn=Dave+Sim+-+Glamourpuss+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"LeonardTSpock","files":-1,"time":1348004920,"description":"Issues 1-26 of 'Glamourpuss' plus issues 2-5 of 'Zootanapuss'\n\nAardvark-Vanaheim, 2008-2012\n\nWritten and Illustrated by Dave Sim\n\n\nThe premise of the book is threefold: a parody of fashion magazines, a history of photorealism in comics, and a surreal super-heroine comic.\n\nIn reality, it turned out to be four-fold, and then more focused, as it told the story of 'The Strange Death of Alex Raymond'.\n\nIssue four of the book was offered with &quot;Zombie&quot; variant covers (as were several other issues), featuring &quot;zombie-fied&quot; covers instead of the traditional fashion magazine versions.\n\nIssue 18, March 2011, featured the first new Cerebus comic book story in seven years.\n\nIn July, 2012, with issue 26, sadly, Sim ended the series. There is a letter from Sim at the end of the issue explaining why and what his future plans, if any, may be. \n\nHe seems very fatalistic about his future interaction with ANY comic books (or the world at large, for that matter), including Cerebus, even though he's receiving offers from very solid and respectable companies (Fantagraphics, for one) to help him out. Such is the way of world when Sim is involved. The man has brought huge amounts of happiness to my comic book reading life (not to mention quite possibly be the only book to ever change and/or expand my way of thinking about and viewing the world), but near equal frustration with his sometimes stupefying opinions (even though I agree with a great many more of them than most people I know), epic levels of stubbornness, and his own forced martyrdom. \n\nRegardless of all that, Glamourpuss has always been a find read. One that deserved far more attention and sales than it ever received. It's funny, educational, insightful and very well drawn (regardless of Sim's opinion of his own abilities). \n\n","torrent":{"xt":"urn:btih:85d52c3af191e29a70afd435c54180a1002611a4","amp;dn":"Dave+Sim+-+Glamourpuss+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85d52c3af191e29a70afd435c54180a1002611a4","infoHashBuffer":{"type":"Buffer","data":[133,213,44,58,241,145,226,154,112,175,212,53,197,65,128,161,0,38,17,164]},"announce":[],"urlList":[]}}