{"title":"The Great Darkness Saga (Complete) (No ads)","uid":7822358,"size":376563837,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:86f544b63989d2f374c620b18fc8eda8a4758647&amp;dn=The+Great+Darkness+Saga+%28Complete%29+%28No+ads%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SplhcbPrime","files":-1,"time":1352851891,"description":"The Great Darkness Saga is a five-issue American comic book story arc featuring the Legion of Super-Heroes.  It was written by Paul Levitz, with art by Keith Giffen and Larry Mahlstedt.  Published by DC Comics in 1982, the arc first appears in Legion of Super-Heroes Volume 2, Numbers 290-294.  It is notable for featuring appearances by virtually every living past and present Legionnaire as of 1982, as well as most of the team's 30th-century allies.  This list includes:  The Legion Of Substitute Heroes; The Wanderers; The Heroes Of Lallor; and the 20th-century Kryptonian refugee, Dev-Em.  The heroes battle an immensely powerful being shrouded in darkness, ultimately revealed to be the ancient ruler of Apokolips, Darkseid.\n\nFollowing the events of the Zero Hour mini-series, this storyline (and all other Legion stories predating October, 1994) were removed from continuity.  However, a new incarnation of the original Legion was introduced in 2007, in The Lightning Saga storyline in The Justice League Of America and Justice Society Of America titles.  DC writer Geoff Johns later stated that this incarnation of the Legion shares the same history as the original Legion up to the events of Crisis On Infinite Earths, including the events of The Great Darkness Saga.  Moreover, when DC released its post-Infinite Crisis version of Darkseid's origin in 2008, The Great Darkness Saga was listed as one of the character's essential storylines, strongly suggesting that the events of this tale were included in post-Infinite Crisis continuity.  Additionally, a subsequent Legion tale explicitly referred to this series in general, and Darkseid's victory over Mordru (on the planet Avalon) in particular. \n\nNOTE:  These are not my scans.  All praise and glory to the original scanners (and of course the authors, artists and publishers,) please.\n\nEnjoy, and please seed.\n","torrent":{"xt":"urn:btih:86f544b63989d2f374c620b18fc8eda8a4758647","amp;dn":"The+Great+Darkness+Saga+%28Complete%29+%28No+ads%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86f544b63989d2f374c620b18fc8eda8a4758647","infoHashBuffer":{"type":"Buffer","data":[134,245,68,182,57,137,210,243,116,198,32,177,143,200,237,168,164,117,134,71]},"announce":[],"urlList":[]}}