{"title":"Sexually Broken--Phoenix Marie extreme bondage  Phoenix Marie  M","uid":7785754,"size":1014790628,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:8704c376ef76e0946f0cbfd1fc969e115dc6f3f3&amp;dn=Sexually+Broken--Phoenix+Marie+extreme+bondage++Phoenix+Marie++M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"merzedes","files":-1,"time":1351888392,"description":"Phoenix Marie extreme bondage, tickling, deep throating, orgasms and Category 5 choking hogtie | Phoenix Marie | Matt Williams            \n\nNovember 2, 2012\n\n\nMP4 only.  \n\n\nWelcome back super starlet Phoenix Marie to Sexually Broken. \nPhoenix is very formitable, at 5'9 with huge tits, a perfect \nass and strong tan legs, she is one of Porn's hottest talents! \n\n\nThis is our &quot;Meet and Greet&quot; with Phoenix. All the bondage is \ndone on screen. The entire tie from start to finish evolves \nbefore your eyes. It is the most realistic sex and submission \nscene you will ever see captured. No acting, no script, The \nrigger and the model, one on one with great bondage and sex. \nNo other site in the world gives you this realism. All other \nsites have the girl all ready bound and a professional porn \nACTOR steps in and awkwardly tries to Dominate and fuck the \ngirl. Sexually Broken is the next evolution of bondage and sex \nsites.\n\nWith her elbows and wrists tightly bound behind her, Phoenix \nis kneeling, worshiping a hard cock. We let her enjoy the \ncock, she only has her mouth to work with. We let her go slow, \ndeep, she makes love to the cock with just her mouth and \ntongue. Sensual deep throating and cock worship at it's best \nfrom one of the best cock suckers in the industry. she sucks \nto impress, but we do not impress easily.\n\nTruth be told, soon we are bored, and we proceed to brutal \nfuck Phoenix's pie hole. We skull fuck the fuck out of the \nback of her throat. All the way down, cutting off her ability \nto breathe. We control her life with cock. She breathes when \nwe want her to. We blast her into sub space, lack of air and \nthe constant feel of the cock fucking the very deep part of \nher throat causes Phoenix to go into survival mode. When we \nthink she might pass out from her catastrophic skull fucking, \nwe pull her up to her feet, bend her over and jam the hard \ncock balls deep into her wet, tight pussy. Within seconds she \ncums, and cums hard, her ability to stand is impaired. \n\nWe fuck her hard and deep, then quickly knock her to her \nknees, and blast her throat with cock again. This is what is \nknown as being used and used hard. All she knows is cock. Her \nbrain flashes from lack of air from the extreme throat \nfucking. We quickly move her into a brutal standing modified \nstrappado. Her arms over her head to the floor, her legs bent \nand her amazing ass just sticking out, begging for cock. We \nfuck her to orgasm again, then knock her to the floor.\n\nWe quickly bind her into a Category 5 choking hogtie. She must \nmaintain her arch with what strength she has left or slowly \nchoke out. She gets weaker and weaker, the bondage is winning, \nthe darkness approaches....\n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/11_02phoenix/SexuallyBroken-Phoenix-Marie-Matt-Williams-Phoenix-Marie-extreem-bondage-tickling-deep-throating-orgasms-and-Category-5-choking-hogtie.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/11_02phoenix/SexuallyBroken-Phoenix-Marie-Matt-Williams-Phoenix-Marie-extreem-bondage-tickling-deep-throating-orgasms-and-Category-5-choking-hogtie.php&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:8704c376ef76e0946f0cbfd1fc969e115dc6f3f3","amp;dn":"Sexually+Broken--Phoenix+Marie+extreme+bondage++Phoenix+Marie++M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8704c376ef76e0946f0cbfd1fc969e115dc6f3f3","infoHashBuffer":{"type":"Buffer","data":[135,4,195,118,239,118,224,148,111,12,191,209,252,150,158,17,93,198,243,243]},"announce":[],"urlList":[]}}