{"title":"Imax Deep Sea DVDRip XviD LKRG[ExtraTorrent]","uid":5632278,"size":1871010266,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8724cf32312883ad4b4e901f8deb4712cb4cb1d3&amp;dn=Imax+Deep+Sea+DVDRip+XviD+LKRG%5BExtraTorrent%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"raymondhome","files":-1,"time":1276731229,"description":"Love for All and Sharing is the first step to solving all the problems of humanity.\n\nWebsites I want to share.\n\n     &lt;a href=&quot;\nhttp://www.shareintl.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shareintl.org/&lt;/a&gt;\n\n     &lt;a href=&quot;\nhttp://www.lightmiddleway.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lightmiddleway.com&lt;/a&gt;\n\n\nThank you very much\n\nNo credit for me...credit to EVERYONE for sharing\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/raymondhome/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/raymondhome/&lt;/a&gt;\n\nPLOT\nThe balance of the earth's ecosystems is continually changing and no where is this more apparent than in fascinating world beneath the sea. Narrated by Johnny Depp and Kate Winslet, this 41-minute IMAX film features breathtaking underwater photography from the coral reefs to the cold waters of British Columbia with a focus on underwater inhabitants, their symbiotic relationships, and the ever-shifting balance between predator and prey. While viewing this DVD on even the largest home television screen can't compare with the stories high IMAX theatre experience, underwater footage including a California mantis shrimp fighting off an octopus and a wolf eel eating a sea urchin is riveting in any venue. The footage of the mysterious once-a-year spawning of the coral reef in the Gulf of Mexico can only be described as truly amazing. Enchantment with underwater beauty gives way in the end to a chilling message about man's over-fishing of the sea and his leading role in the unraveling of the sea's delicate ecosystem. (Ages 3 and older) --Tami Horiuchi\n\nProduct Description\nDive in! A sea full of wonders awaits. Famed oceanic filmmaker Howard Hall (Into the Deep) guides this immersive adventure that lets you swim alongside some of the most exotic creatures of the planet. Johnny Depp and Kate Winslet provide the narration. And an unusual array of finned and scaled stars are ready to steal every scene. Among them: Green Sea Turtles who gather off Kona so that Surgeonfish can strip harmful algae from their shells...an ominous, predatory Humboldt Squid that changes color four times per second like a flashing strobe light...an underdog Mantis Shrimp, whose claws have the speed of a 22-caliber bullet, in battle against a hungry octopus (the shrimp wins!). So many creatures. So many amazing stories. Sea them all.\n\ncredit Legend.Killer.RG BIG BIG BIG TIME &amp; to all the people who made it possible for us to share this...especially EVERYONE involve in the production of the movie...IF YOU LIKE IT...BUY IT :)\n\n*****help what we can with others in need...the world is ONE big family*****","torrent":{"xt":"urn:btih:8724cf32312883ad4b4e901f8deb4712cb4cb1d3","amp;dn":"Imax+Deep+Sea+DVDRip+XviD+LKRG%5BExtraTorrent%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8724cf32312883ad4b4e901f8deb4712cb4cb1d3","infoHashBuffer":{"type":"Buffer","data":[135,36,207,50,49,40,131,173,75,78,144,31,141,235,71,18,203,76,177,211]},"announce":[],"urlList":[]}}