{"title":"Iron Maiden - Aces High (Live)","uid":5166616,"size":203956228,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8748dfc456e5d8694cdf2f205320d16fa9952eff&amp;dn=Iron+Maiden+-+Aces+High+%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1258440722,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nA live performance by Iron Maiden - Aces High from the Somewhere In Time Tour.\n\n\n&quot;Aces High&quot; is a song written by Steve Harris. It is Iron Maiden's eleventh single and the second from the 1984 album Powerslave. The song tells the story of a British RAF pilot fighting against the German Luftwaffe during the Battle of Britain (1940), the first battle to be completely fought in the skies of the UK. The song topped at number 20 on the UK Singles Chart. Aces High is one of Iron Maiden's most popular songs, and has been covered numerous times, by bands including Arch Enemy and Children Of Bodom. It was released as a single over a month after Powerslave came out.\n\nPowerslave is the fifth studio album by the English heavy metal band Iron Maiden, released on September 2, 1984 on EMI in Europe and its sister label Capitol Records in the US (it was re-released by Sanctuary/Columbia Records in the US in 2002). It is notable for its Egyptian theme displayed in the album art, as well in the title track's musical style. It contains a musical re-telling of Samuel Taylor Coleridge's &quot;Rime of the Ancient Mariner&quot;, which uses pieces of the original poem as lyrics, and is the longest song Iron Maiden have ever recorded at a length of 13 minutes and 38 seconds. The album is also notable amongst the band's albums as being the first album to feature the same lineup as the previous one. As of 2009, this is the last of the band's albums to contain an instrumental track: &quot;Losfer Words (Big 'Orra).&quot;\n\n&quot;2 Minutes to Midnight&quot; and &quot;Aces High&quot; were released as singles, the former being a staple in nearly all of the band's concert tours.\n\nWorld Slavery Tour was the tour supporting the album.\n\nThe lyrics to &quot;Rime of the Ancient Mariner&quot; are mainly influenced from Samuel Taylor Coleridge's poem of the same name, and directly quote two passages from the poem, the former including the famous lines of 'Water, water everywhere - nor any drop to drink'. The song can be divided into three phases, the first subscribing to the quintessential 'galloping' metal, the second (around 5 minutes in) being simple and quiet yet dark, and the final stage returning to an upbeat instrumental, and lastly repeating the initial tune. Often played in set lists from its release, the &quot;Rime of the Ancient Mariner&quot; is a very popular and highly-regarded song from the band. During the 'Somewhere Back In Time World Tour', Dave Murray, Bruce Dickinson and Steve Harris citied the song as their favourite to play.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:8748dfc456e5d8694cdf2f205320d16fa9952eff","amp;dn":"Iron+Maiden+-+Aces+High+%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8748dfc456e5d8694cdf2f205320d16fa9952eff","infoHashBuffer":{"type":"Buffer","data":[135,72,223,196,86,229,216,105,76,223,47,32,83,32,209,111,169,149,46,255]},"announce":[],"urlList":[]}}