{"title":"Showcase '93-'96","uid":5218073,"size":708467468,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:875f547b6926142c734819991497654073c70544&amp;dn=Showcase+%5C%2793-%5C%2796&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1260820930,"description":"Showcase has been the title of several anthology series published by DC Comics. The general theme of these series has been to feature new and minor characters as a way to gauge reader interest in them, without the difficulty and risk of featuring &quot;untested&quot; characters in their own ongoing titles. The original series ran from March 1956 to September 1970 and then was revived for eleven issues from August 1977 to September 1978.\n\nThis torrent contains the Showcase series from 1993-1996.  Each year was published as a 12-issue limited series.  The first two, Showcase '93 and Showcase '94 featured characters related to Batman titles.  The last two, Showcase '95 and Showcase '96 featured characters from the Superman books.  The series also linked into several ongoing storylines, such as the Batman Knightfall saga and Zero Hour.  Showcase '96 #3 was a prelude to the Bird of Prey Series featuring a team-up between Black Canary, Oracle and Lois Lane.\n\nHowever, because unsold comics were no longer returnable, retailers had become reluctant to stock series that did not feature consistent characters and creators from month to month, and despite being linked each year to the popular characters of Batman or Superman, reader demand was lukewarm leading to the cancelation of the series.\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:875f547b6926142c734819991497654073c70544","amp;dn":"Showcase+%5C%2793-%5C%2796","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"875f547b6926142c734819991497654073c70544","infoHashBuffer":{"type":"Buffer","data":[135,95,84,123,105,38,20,44,115,72,25,153,20,151,101,64,115,199,5,68]},"announce":[],"urlList":[]}}