{"title":"The Great British Dream Factory (gnv64)","uid":16024341,"size":25885169,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:87f7b3c945e2d3b90332fe89cb78fa3ccdb05eeb&amp;dn=The+Great+British+Dream+Factory+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":10,"uploader":"gnv65","files":4,"time":1476367403,"description":"The Great British Dream Factory: The Strange History of Our National Imagination\r\nby Dominic Sandbrook\r\nAllen Lane | October 2015 | ISBN: 0241004659 | ePUB | 24.6 mb\r\n\r\nBritain's empire has gone. Our manufacturing base is a shadow of its former self; the Royal Navy has been reduced to a skeleton. In military, diplomatic and economic terms, we no longer matter as we once did. And yet there is still one area in which we can legitimately claim superpower status: our popular culture.\r\nIt is extraordinary to think that one British writer, J. K. Rowling, has sold more than 400 million books; that Doctor Who is watched in almost every developed country in the world; that James Bond has been the central character in the longest-running film series in history; that The Lord of the Rings is the second best-selling novel ever written (behind only A Tale of Two Cities); that the Beatles are still the best-selling musical group of all time; and that only Shakespeare and the Bible have sold more books than Agatha Christie. To put it simply, no country on earth, relative to its size, has contributed more to the modern imagination.\r\nThis is a book about the success and the meaning of Britain's modern popular culture, from Bond and the Beatles to heavy metal and Coronation Street, from the Angry Young Men to Harry Potter, from Damien Hirst to The X Factor.\r\n\r\nAbout the Author\r\nDominic Sandbrook's most recent book for Penguin was Seasons in the Sun: The Battle for Britain, 1974-79. He is the presenter of a number of highly successful BBC television series, on subjects as diverse as the joys of the Volkswagen and the history of science fiction. He writes reviews and articles principally for the Daily Mail and Sunday Times","torrent":{"xt":"urn:btih:87f7b3c945e2d3b90332fe89cb78fa3ccdb05eeb","amp;dn":"The+Great+British+Dream+Factory+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87f7b3c945e2d3b90332fe89cb78fa3ccdb05eeb","infoHashBuffer":{"type":"Buffer","data":[135,247,179,201,69,226,211,185,3,50,254,137,203,120,250,60,205,176,94,235]},"announce":[],"urlList":[]}}