{"title":"Rodrigo y Gabriela - Rodrigo y Gabriela [flac] DVD Bonus","uid":7722775,"size":713114855,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:894deb078bc665aea1e5f37cc1df41a4b9d5154a&amp;dn=Rodrigo+y+Gabriela+-+Rodrigo+y+Gabriela+%5Bflac%5D+DVD+Bonus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1350119330,"description":"The sleeve photo of a crocodile's eye with a faint image of Rodrigo and Gabriela superimposed, suits the artists' desire for something which didn't shout &quot;Mexican guitarists&quot; or &quot;Couples.&quot; &quot;It reminded us of Tamacun, the famous Mexican eccentric who is in Ixtapa where we lived for a while&quot;. Tamacun -&quot;Tamacun's message is to teach kids to respect nature.&quot; He handles crocodiles, and tourists come to photograph him. Diablo Rojo - Inspired by a wild rollercoaster called 'Red Devil' at a theme park in Copenhagen, Denmark. Three rides in a row, each. Viking Man - Another Danish inspired piece. The Viking Man was a homeless guy who encouraged Rod &amp; Gab to tough it out on the streets, busking in minus zero conditions at Christmastime. John Leckie adds radio static. Satori - Experiencing self doubt shortly after arriving in Ireland, Rodrigo y Gabriela were at a low ebb. No money, poor English and a deep sense of uncertainty. Only an unshakeable faith in perseverance kept them going. Satori describes the Zen - like moment of enlightenment they felt when they came through the storm. Ixtapa - &quot;Ixtapa is a very beautiful, very Mexican town.&quot; Roby Lakatos' wildly soaring violin solo is a perfect counterpoint to the melodic and percussive guitars. Stairway to Heaven - &quot;Ixtapa was our very own Stairway to Heaven!&quot; Rod &amp; Gab's take was initially inspired by Stanley Jordan's interpretation of the Led Zep warhorse. Growing from snippets in their live show, their unique version is at once both respectful and innovative. Orion - This epic reworking of the Metallica song is the second time Rodrigo y Gabriela have covered Messrs Hetfield, Ulrich &amp; Co: &quot;A tribute to the style of music we love, it's what kept us playing the guitar through all those Spinal Tap years&quot; Juan Loco - The first attempt at recording this album in Mexico in Summer 2005 resulted in three weeks of sunbathing, beer drinking and power cuts. Enter Mr John Leckie, legendary producer of Radiohead, The Stone Roses and Muse, to name but a few; to midwife Rod &amp; Gab's musical vision into what you hear today. 'Juan Loco' ('Mad John') is their Mexican nickname for Mr Leckie. PPA - &quot;The first P of PPA stands for Pinche, a Mexican term meaning f**king asshole. This is for all the people in the music business who think they know what's going on but actually don't have a clue&quot;.\n\nReleased: February 17, 2006\nRecorded: N/A\nGenre: Acoustic Rock\nLength: 42:49\nLabel: Rubyworks\n\n1.\tTamacun\t3:25\n2.\t Diablo Rojo\t4:56\n3.\t Vikingman\t4:03\n4.\t Satori\t5:04\n5.\t Ixtapa\t5:13\n6.\t Stairway to Heaven\t4:44\n7.\t Orion\t7:44\n8.\t Juan Loco\t3:27\n9.\t PPA\t4:13","torrent":{"xt":"urn:btih:894deb078bc665aea1e5f37cc1df41a4b9d5154a","amp;dn":"Rodrigo+y+Gabriela+-+Rodrigo+y+Gabriela+%5Bflac%5D+DVD+Bonus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"894deb078bc665aea1e5f37cc1df41a4b9d5154a","infoHashBuffer":{"type":"Buffer","data":[137,77,235,7,139,198,101,174,161,229,243,124,193,223,65,164,185,213,21,74]},"announce":[],"urlList":[]}}