{"title":"Corporal Hitler and the Great War 1914-1918: The List Regiment","uid":11707929,"size":1079129,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89e6d170ffeac5367a60b5de62a684ef1dd35e4d&amp;dn=Corporal+Hitler+and+the+Great+War+1914-1918%3A+The+List+Regiment&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424213286,"description":"Adolf Hitler enlisted in the Bavarian Army in august 1914 as a war volunteer. Fanatically devoted to the German cause, between 1914 and 1918 Hitler served with distinction and sometimes reckless bravery, winning both classes of Iron Cross. Using memoirs, military records, regimental, divisional and official war histories as well as (wherever possible) Hitler's own words, this book seeks to reconstruct a period in his life that has been neglected in the literature. It is also the story of a German regiment (16th Bavarian Reserve Infantry, or List Regiment), which fought in all the main battles on the Western Front. As a frontline soldier Hitler began his 'study' of the black art of propaganda; and, as he himself maintained, the List Regiment provided him with his 'university of life'.\n\nThis is not only an account of the fighting, however. Some of the most profound influences on Hitler occurred on home leave or as a result of official wartime propaganda, which he devoured uncritically. His conversion from passive pathological anti-Semitism began while invalided in Germany in 1916-17. The language of anti-Bolshevik 'Jewish virus' propaganda became Hitler's language, confirmed, as he saw it, by the 'infected' recruits to the List Regiment in 1918.\n\nHitler is here presented less as the product of high-cultural forces than as an avid reader and gullible consumer of state propaganda, which fed his prejudices. He was a 'good soldier' but also a 'true believer' in fact and practice. It is no exaggeration to say that every military decision made by Hitler between 1939 and 1945 was in some way influenced or coloured by his experiences with the List Regiment between 1914 and 1918","torrent":{"xt":"urn:btih:89e6d170ffeac5367a60b5de62a684ef1dd35e4d","amp;dn":"Corporal+Hitler+and+the+Great+War+1914-1918%3A+The+List+Regiment","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89e6d170ffeac5367a60b5de62a684ef1dd35e4d","infoHashBuffer":{"type":"Buffer","data":[137,230,209,112,255,234,197,54,122,96,181,222,98,166,132,239,29,211,94,77]},"announce":[],"urlList":[]}}