{"title":"POtHS - Creation - 81 - Genetic Entropy and Junk DNA","uid":9421336,"size":5780133816,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8a05fefa0ede70a7cdc4277e260ac1b4c1495465&amp;dn=POtHS+-+Creation+-+81+-+Genetic+Entropy+and+Junk+DNA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":58,"time":1388598390,"description":"\nPOtHS - E V I L - U T I O N - School Your Professor on The Facts\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8865248/POtHS_-_E_V_I_L_-_U_T_I_O_N_-_School_Your_Professor_on_The_Facts&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8865248/POtHS_-_E_V_I_L_-_U_T_I_O_N_-_School_Your_Professor_on_The_Facts&lt;/a&gt;\n\nreligious-christian-icons-337.gif\n\n\n\n\n PO t HS\n\nPouring Out the Holy Spirit\n\nPOtHS - Creation - 81 - Genetic Entropy and Junk DNA\n\n\nPOtHS Comment: Anybody that believes Darwins Theory of Evolution had NO KNOWLEDGE of Scientific Fact. Download the Torrent at the Top of The Page for Scientific Proof Evolution is a LIE.\n\nGenetic Entropy_ amino acid substitutions and mutation:\nEvolutionists demonstrate the non-scientific, anti-scientific basis of their concept by claiming biological processes which are degratory are mechanisms for evolution. It may have been plausible that mutation was the mechanism for evolution in 1950, but it has long since been proven to be not only no mechanism for evolution but a mechanism that causes great reduction in the fitness of life - the very opposite of what evolutionists want others to believe. The genones of all life is degenerating because of mutation and doing so at a rate that not only proves evolution has not been going on for tens of thousands much less millions of years, but also that evolution is false.\n----------------------------------------------------------------------------------------------------------------\n\nJohn Sanford on Genomic Entropy:\nDr. John Sanford lectures at Loma Linda University on &quot;genomic entropy&quot; - how the human genome (and other genomes of essentially all slowly reproducing living things) are degenerating over time. Such discoveries, of course, fundamentally undermine the claims of neo-Darwinists and have produced significant controversy in the world of mainstream science.\n\nThere is a growing awareness that information is the unique non-material force which makes life possible. This growing awareness comes as we are discovery the labyrinth of informational networks in even the simplest cells. This cellular network is similar to today's Internet.\n\nThere is rapidly growing evidence that the principles of information run parallel to the laws of thermodynamics. The first law of thermodynamics essentially says that matter and energy cannot just arise from nothing. This is also true of information - it does not arise spontaneously from matter, it only arise through the operation of intelligence. The second law of thermodynamics essentially says that useful things always degenerate into useless things, apart from intelligent intervention. This is also true of information - apart from intelligent intervention, information always degenerates. All this strongly indicates that the biological information networks within cells and organisms must have been intelligently designed, but should now be decaying. This growing new consensus provides astounding affirmation of the Biblical view of reality - that is a recent and miraculous creation, a fallen and dying world, and a profound need for a Saviour.\nDr John Sanford, Ph.D.\n-----------------------------------------------------------------------------------------------------------------\n\nJunk DNA, Parts 1 &amp; 2:\nby Dr. Charles Jackson &lt;a href=&quot;\nhttp://www.creationtruth.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.creationtruth.com/&lt;/a&gt; and http://youngearth.org Ç€ Rocky Mountain Creation Fellowship's speaker on March 8, 2013 was Dr. Charles Jackson, founder of Points of Origins Ministries, the college ministry division of Creation Truth Foundation of Dallas, Texas. &quot;Dr. J&quot; is an educator, a Mensan, debater in creation science, and dynamic speaker. His presentation gave a historical retrospect covering decades of genomic research that has completely reversed evolutionists' theory, that the non-protein coding sequences of human DNA are the discarded residue of evolution (so-called &quot;Junk DNA&quot;). As a young college professor, Dr. J. had to walk a tight rope because of his objections to evolution theory, and was eventually fired because he didn't agree that DNA had &quot;junk&quot;.\n\nThis idea about &quot;junk DNA&quot; comes from a long history of misdirected thinking, a history of wildly rampant egos and arrogance that goes back to the 1920's, when evolutionists falsely claimed that so-called vestigial organs (appendix, tonsils, tailbone) were proof of evolution. Having unknown functions, these organs were said to be useless &quot;leftovers&quot; from the days when we were fish and rats and worms, and had all these different organs that natural selection hasn't weeded out of us yet. This myth reflected an attitude: &quot;Since we're so smart, and we can't figure out what it does, it must not have any function or be doing anything.&quot; It was arguing from ignorance, providing an ignorant hypothesis to an Unanswered Question. Evolution thrives in the gray areas and the uncertainties; it is cast into the darkness, and then said to answer the questions. The amazing part is that after the truth is found, which rejects the hypothesis, they continue in their erroneous thinking. Vestigial organs are still in the textbooks, even though now they are scientifically indefensible.  The same faulty logic used for vestigial organs came into play in the 1970's to explain why only 2% of the human genome had a known function. Eureka! Evidence for evolution: vestigial DNA, or 'Junk', left over from a trial and error genetic system.\n\nThe true genetic story began to unfold in the year 2000, when we first got a hint that the junk DNA had a purpose, regarding the function of the double X chromosomes in females. It was discovered that there was a DNA sequence that was controlling the entire operation, telling which genes to shut down, which to power up and which genes to pump out extra proteins.  And it was all being coordinated by DNA sequences that weren't making proteins; they were in the junk region.\n\nIt turns out that the junk genes were not making proteins, but telling all the other genes when to do it. They were the main circuit board for the entire operation.\n\nBy the year 2006, it was public knowledge that junk DNA was probably not junk. Quote Time, 10/9/06: &quot; The non-coding region of the genome, . . is crucial.&quot; It's a fantastically complex, crisscrossing network of gene communications that we have only scratched the surface on. Many genes overlap one another and share stretches of molecular code. A gene that controls the production of a protein coded gene was often found on different chromosomes.\n\nThen it was announced in 2007 that the entire genome (including Junk regions) gets transcribed, and that both DNA strands are translated. &quot;There is an interleaved structure of overlapping segments with typically 5, 7, or 9 or more transcripts coming from one gene.&quot; The information coding system is so complex, it means the file management system is way beyond anything we understand.\n\nThe last nail in Darwin's coffin came in the Sept. 6, 2012 issue of the NY Times (reported in this newsletter,Vol. 77) as follows: &quot;At least 4 million gene switches\nturn out to play critical roles in controlling how cells, organs and other tissues behave.&quot; There are master control genes that don't produce any proteins, but stimulate other genes that produce proteins. Dr. John Sanford, the brilliant geneticist and a born again creationist, says that codes are overlaying within codes\nand nested within other codes, and are read in both\ndirections. What an awesome Creator!\n\nAbout Dr. J...\nAs a former youth pastor and schoolteacher, the work of &quot;Dr. J&quot; has been primarily focused toward Christian youth. Dr. J and his wife, Bonnie, are missionaries to American College Students, and have served Creation Truth Foundation in that capacity since January 2009. They are keenly interested in the liberation of Bible-believing college students, from the delusion that their faith has been refuted by modern scientific understandings. Dr. J has crusaded against evolutionary dogma on college campuses across the mainland United States, and also in Venezuela and Peru, in lecture settings and academic debates.\n\nThe secret to the success of Dr. J's ministry has not merely been the God-given gifts of academic and communication skills, but an ultimate dependence upon the Spirit of God, while debating the issues in the public forum. [ &quot;If any of you lack wisdom, let him ask of God.&quot; [James 1:5 ]\n-----------------------------------------------------------------------------------------------------------------\n\nAlso includes various Creation video shorts\n\n\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\n\nMay Yahweh Bless You as He has me. Seed long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the TRUTH.  Other Torrents in this Series at\n\n\nGet info on the Take Over by The New World Order Below a\n\n &lt;a href=&quot;\nhttp://end-times-prophecy.com/blog/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://end-times-prophecy.com/blog/&lt;/a&gt;                                                                  Prophecy from Susan Davis &lt;a href=&quot;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://jesus-talks.com/blogs/blog1.php/creating-an-event-in-heaven&lt;/a&gt;                   A place where Jesus would feel at home. This is a new site still under construction. &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;                                                       Free online Bible Study &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;                                                            End Times Prophecy - Who is Babylon the Great &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt;                                                                                Daily Bible Study in Your Email &lt;a href=&quot;\nhttp://www.khouseafrica.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouseafrica.com/&lt;/a&gt;                                                                           Chuck Missler - Africa &lt;a href=&quot;\nhttp://www.store.khouse.org/store/catalog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.store.khouse.org/store/catalog&lt;/a&gt;                                                        Chuck Missler - USA &lt;a href=&quot;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&lt;/a&gt;                                       Dehydrated Survival Food -  Excellent Taste &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&lt;/a&gt;          Chuck Missler - New Zealand, Australia, Pacific Rim\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:8a05fefa0ede70a7cdc4277e260ac1b4c1495465","amp;dn":"POtHS+-+Creation+-+81+-+Genetic+Entropy+and+Junk+DNA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a05fefa0ede70a7cdc4277e260ac1b4c1495465","infoHashBuffer":{"type":"Buffer","data":[138,5,254,250,14,222,112,167,205,196,39,126,38,10,193,180,193,73,84,101]},"announce":[],"urlList":[]}}