{"title":"Treasure Planet","uid":9711380,"size":1754524423,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8b8e5ae2b909f29c66af0515eafab79d7b4b5b31&amp;dn=Treasure+Planet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BrisaG","files":1,"time":1394117648,"description":"Treasure Planet is a 2002 American animated science fiction film produced by Walt Disney Animation Studios, and released by Walt Disney Pictures on November 27, 2002. It is the 43rd animated feature in the Walt Disney Animated Classics series. The film is a science fiction adaptation of Robert Louis Stevenson's adventure novel Treasure Island and was the first film to be released simultaneously in regular and IMAX theaters.[2][3] The film employs a novel technique of hand-drawn 2D traditional animation set atop 3D computer animation.\nThe film was co-written, co-produced and directed by Ron Clements and John Musker, who had pitched the concept for the film at the same time that they pitched The Little Mermaid. Treasure Planet features the voices of Joseph Gordon-Levitt, Brian Murray, David Hyde Pierce, Martin Short, Roscoe Lee Browne, Emma Thompson, Laurie Metcalf, and Patrick McGoohan (in his final film role). The musical score was composed by James Newton Howard, while the songs were written and performed by John Rzeznik. Despite positive critical reception, the film performed poorly in the United States box office, costing $140 million to create while earning $38 million in the United States and Canada and just shy of $110 million worldwide.[1] It was nominated for the 2002 Academy Award for Best Animated Feature.\n\nEnjoy this movie and please let me know your opinion about this torrent!!!!","torrent":{"xt":"urn:btih:8b8e5ae2b909f29c66af0515eafab79d7b4b5b31","amp;dn":"Treasure+Planet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b8e5ae2b909f29c66af0515eafab79d7b4b5b31","infoHashBuffer":{"type":"Buffer","data":[139,142,90,226,185,9,242,156,102,175,5,21,234,250,183,157,123,75,91,49]},"announce":[],"urlList":[]}}