{"title":"Born to Manage The Autobiography by Terry Venables (Perseu)","uid":10370579,"size":12424650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8bc3386378bb677c926b776fed58b105d36c2204&amp;dn=Born+to+Manage+The+Autobiography+by+Terry+Venables+%28Perseu%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"perseu","files":1,"time":1402930113,"description":"After a playing career that spanned more than 15 years, and took\nin golden spells in the sixties with Chelsea and Spurs, it was\nalmost inevitable that Terry Venables would move into management.\nFollowing early success with Crystal Palace and Queens Park Rangers,\nhe was appointed to the plum job of managing Barcelona, one of the\nbiggest clubs in Europe. The Spanish giants had been struggling,\nbut he soon turned them around and brought them trophy success,\nwhich inevitably earned him the nickname 'El Tel'.\n\nHe returned to England to take charge of Spurs, where he helped save\nthe club from financial troubles, and formed an ill-fated partnership\nwith Alan Sugar. Again there was trophy success, as Venables worked\nwith top England stars such as Paul Gascoigne, Gary Lineker and Chris\nWaddle, and when the England job fell vacant, he was the obvious\nchoice for the role, leading the nation to the semi-finals of Euro 96\nwhere they lost out on a place in the final after a penalty shoot-out.\nAfter leaving the England job, he has subsequently worked in numerous\ndifferent roles. A charismatic and gregarious personality, Venables\nis widely viewed as one of football's great tacticians and is the\nmost successful English manager of recent years. His story is sure to\nfascinate and entertain all followers of the game, providing a unique\ninsight based on more than 50 years at the top. \n\nBorn to Manage: The Autobiography\nBy: Terry Venables\nFormat: EPUB\nLanguage: EN\nPages: 803\nISBN: 9781471129940","torrent":{"xt":"urn:btih:8bc3386378bb677c926b776fed58b105d36c2204","amp;dn":"Born+to+Manage+The+Autobiography+by+Terry+Venables+%28Perseu%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bc3386378bb677c926b776fed58b105d36c2204","infoHashBuffer":{"type":"Buffer","data":[139,195,56,99,120,187,103,124,146,107,119,111,237,88,177,5,211,108,34,4]},"announce":[],"urlList":[]}}