{"title":"Europe - Start From The Dark (2004) WMA320","uid":6101269,"size":126994670,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8bca73acb6822eec94398b0380ea65d02548e8b8&amp;dn=Europe+-+Start+From+The+Dark+%282004%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1294978508,"description":"There is so much more to EUROPE than &quot;the final countdown&quot;. This band from Sweden is severely underrated. In the 1980's, anyone who took the time to look past the media frenzy, hype, and imagery would have discovered a very talented band whose sound had more in common with YNGWIE MALMSTEEN or even an early RAINBOW than with the makeup-caked and perfuminated hordes of the commercial Metal/L.A. Glam scene with whom they were somewhat erroneously lumped into. \n\nAfter a 13-year hiatus the boys are back, and what a difference this time has made. &quot;Start From The Dark&quot; marks the return of the classic lineup of Joey Tempest, John Norum, John Leven, Mic Michaeli and Ian Haughland with a sound that is similar to pre-final countdown EUROPE (a la Wings of Tomorrow), but modernized for the 21st Century and having some relevance to the modern rock scene of today. I hate to use the clichÃƒÂ© &quot;new and improved&quot;, but the EUROPE of today is a better band than the original. The big hair and silly clothes are gone. The guitars have been pushed up considerably! Keyboards still exist, but are used to complement the songs rather than dominate them. This album is total ROCK and is like a big middle finger in the face of critics who have snubbed this band for years. This is a serious band with a seriously impressive piece of work under its belt! \n\nI wasn't sure what to expect when I first listened to this. On one hand part of me yearns for the slick melodicism and triumphant bombast of yesteryear. On the other hand, I believe artists are at their best when they apply gradual evolution and growth to their sound and was hoping to see some sort of maturity and change as well. \n\nFortunately, what I got was a welcome and refreshing surprise. &quot;Start From The Dark&quot; is one of the best modern Hard Rock/Metal albums out there, combining the best elements of both the old and new school. This is some pretty full-throttle, meat 'n potatoes Hard Rock/Metal with lots of crunchy guitar riffs, intelligent arrangements, and tasteful melodic leadwork. John Norum seems to have mastered the concept of punctuating a song without just playing flamethrower, and thus his solos sound more efficient and thought through and demonstrate great maturity and flexibility. Joey Tempest continues to display an ear for crafting solid song constructs with subtle hooks and infectious melodies that pull you in track after great track. After listening to this album only a few times, I had every song memorized and could list all the songs and write all the lyrics. Rarely can I do this when listening to a new album, and this is clear evidence of how memorable this material really is. \n\nSimply put, this is excellent stuff! This is what Radio Rock should sound like! Standouts include &quot;Got To Have Faith&quot; with it's addictive vocal hook, the darkly catchy title track, heartfelt power-ballad &quot;Hero&quot;, fist-pumping anthem &quot;Wake Up Call&quot;, and the Thin Lizzy-esq, feel-good &quot;Sucker&quot;. This is a mature and developed album. While a certain dark vibe permeates much of the material, it never becomes maudlin or depressing, but rather reflects a band that's intent upon expressing personal growth and soul-searching with the goal of remaining in this for the long haul. The end result is a selection of charismatic and intelligent, yet accessible songs that are at once cathartic and uplifting, thoughtful and life-affirming. This is what good music is supposed to be all about. &quot;Start from the dark&quot; is one of the finest albums of 2004/2005 and the strongest material EUROPE has ever recorded. Welcome back guys!! \n\nby scottydog\n\nTRACKLIST:\n\n01 - Got To Have Faith.wma                                       \n02 - Start From The Dark.wma                                     \n03 - Flames.wma                                                  \n04 - Hero.wma                                                    \n05 - Wake Up Call.wma                                            \n06 - Reason.wma                                                  \n07 - Song No. 12.wma                                             \n08 - Roll With You.wma                                           \n09 - Sucker.wma                                                  \n10 - Spirit Of The Underdog.wma                                  \n11 - America.wma                                                 \n12 - Settle For Love.wma   \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:8bca73acb6822eec94398b0380ea65d02548e8b8","amp;dn":"Europe+-+Start+From+The+Dark+%282004%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bca73acb6822eec94398b0380ea65d02548e8b8","infoHashBuffer":{"type":"Buffer","data":[139,202,115,172,182,130,46,236,148,57,139,3,128,234,101,208,37,72,232,184]},"announce":[],"urlList":[]}}