{"title":"[DvdRip-Xvid-Ita-Mp3]Eragon[survivalofmisa]","uid":5152024,"size":729780224,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8bf9f14b763af027ab8e5bd27e01ebde59ca51f1&amp;dn=%5BDvdRip-Xvid-Ita-Mp3%5DEragon%5Bsurvivalofmisa%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mitimex","files":1,"time":1257617095,"description":"\n\nIl continente fantastico di Alagaesia viveva in pace e prosperitÃƒÂ  sotto la sapiente guida dei Cavalieri dei Draghi, possenti maghi e guerrieri che governavano con giustizia e saggezza. Un giorno uno di loro, Galbatorix, tradisce i suoi compagni sterminando tutti i cavalieri. Da allora Alagaesia ristagna sotto il giogo del tiranno Galbatorix, che si serve dei crudeli Urgali per mantenere il controllo. Le poche sacche di resistenza, rappresentate dai Varden, dagli elfi e dai nani, non hanno abbastanza forza per contrastarlo direttamente.\nIn quest'epoca oscura nasce Eragon, che ancora in fasce viene abbandonato dalla madre presso la casa dello zio. Qui cresce come contadino e cacciatore fino a quando, all'etÃƒÂ  di diciassette anni, trova una misteriosa pietra che si rivela essere un uovo di drago. Dall'uovo nasce una bellissima dragonessa, Saphira, che lega il suo destino a quello del ragazzo. Purtroppo a causa di una profezia che preannuncia la caduta di Galbatorix per mano di un giovane cavaliere, il tiranno ÃƒÂ¨ sempre all'erta e non appena apprende della nascita di Saphira manda lo spettro Durza e gli Urgali ad uccidere Eragon.\nFortunatamente il ragazzo trova in Brom, un cavaliere sopravvissuto alla guerra precedente, un amico ed un mentore, che gli insegna come utilizzare i suoi nuovi poteri... \n","torrent":{"xt":"urn:btih:8bf9f14b763af027ab8e5bd27e01ebde59ca51f1","amp;dn":"%5BDvdRip-Xvid-Ita-Mp3%5DEragon%5Bsurvivalofmisa%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bf9f14b763af027ab8e5bd27e01ebde59ca51f1","infoHashBuffer":{"type":"Buffer","data":[139,249,241,75,118,58,240,39,171,142,91,210,126,1,235,222,89,202,81,241]},"announce":[],"urlList":[]}}