{"title":"Fundamentals of Polymerization - Broja M. Mandal","uid":12426012,"size":7180463,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8cf5219ffb5f0b53a7df112af0be4b8fa473b8a1&amp;dn=Fundamentals+of+Polymerization+-+Broja+M.+Mandal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1442376749,"description":"Fundamentals of Polymerization - Broja M. Mandal (World Scientific, 2013).pdf\n\nISBN 978-981-4322-46-1\n\nOver the last twenty years, the field of the chemistry of polymerization witnessed enormous growth through the development of new concepts, catalysts, processes etc. Examples are: non classical living polymerizations (group transfer polymerization, living carbocationic polymerization, living radical polymerization and living ring-opening metathesis polymerization (ROMP)); new catalysts (metallocenes and late transition metal catalysts for stereospecific polymerization, Schrock and Grubbs catalyst for ROMP among others) and new processes such as miniemulsion, microemulsion polymerization and dispersion polymerization (in polar solvents). Apart from the developments in the chemistry of polymerization, methods have been developed for the evaluation of highly reliable rate constants of propagation in radical as well as cationic polymerization. All these have revolutionized the field of synthetic polymer chemistry.\nIn the book, fundamentals of both the new and old polymerization chemistry have been dealt with. The new chemistry has been given nearly equal space along with the old","torrent":{"xt":"urn:btih:8cf5219ffb5f0b53a7df112af0be4b8fa473b8a1","amp;dn":"Fundamentals+of+Polymerization+-+Broja+M.+Mandal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cf5219ffb5f0b53a7df112af0be4b8fa473b8a1","infoHashBuffer":{"type":"Buffer","data":[140,245,33,159,251,95,11,83,167,223,17,42,240,190,75,143,164,115,184,161]},"announce":[],"urlList":[]}}