{"title":"Buddy Guy - Living Proof (74 Years Young) [Vinyl]-bh80231","uid":6057491,"size":1061013869,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8d40c051d24deef99c0a2ef12c977272a5f7c30f&amp;dn=Buddy+Guy+-+Living+Proof+%2874+Years+Young%29+%5BVinyl%5D-bh80231&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"insinuendo","files":21,"time":1292967606,"description":"Posted By : bh80231 | Date : 20 Dec 2010 10:38:42 |\n\n\nBuddy Guy - Living Proof 74 Years Young\nVinyl rip in 24-bit/96kHz | FLAC | no cue or log (vinyl) | artwork\n1058 MB (24/96) | Blues | 2010\nSilvertone 88697-78107-1 2-LP (3 sides)\n\n\nThe Chicago legend has released what is surely the blues album of the year.\n\nThe legendary pioneer of the Chicago blues turned 74 in July this year, and he's determined to show that he's still in fine voice, and - more even importantly - that he's still one of the most exhilarating and inventive guitarists in the world.\n\n&quot;I'm 74 years young, there's nothing I haven't done / I've drunk wine with kings and The Rolling Stones,&quot; he notes cheerfully on the opening track, as he switches from a solid, slinky acoustic guitar riff to a sudden, furious and attacking solo that provides an instant reminder of why he is so special. Here, after all, is an artist who started out in Louisiana, moved to Chicago to be influenced by the likes of Muddy Waters and Howlin' Wolf, and played with such passion and fury that some blues purists criticised his furious guitar work as &quot;noise&quot; - though this style influenced and impressed blues-rockers from Hendrix to Eric Clapton, Jimmy Page and, of course, The Rolling Stones.\n\nA semi-autobiographical album like this can easily become an exercise in self-congratulation and nostalgia, but it succeeds because of the sheer quality and variety in the playing. After bragging about the fine condition that he's still in, he switches to Thank Me Someday, a reminiscence of his early life, back on a Louisiana plantation, where he drove his family mad as he taught himself to play on a self-made two-string guitar. It starts with a compelling riff that echoes Howlin' Wolf, and then switches to another blistering, screeching and exuberant guitar solo. Then he switches styles yet again with the upbeat On the Road, which provides another reminder that blues can be cheerful as well as sad, and there's a further mood change for the thoughtful and emotional Stay Around a Little Longer. Here he's joined by another blues legend, B.B. King, for a slower, soulful, gospel-tinged ballad on which the two great veterans congratulate themselves on how good they still sound. That may seem horribly mawkish, but they mean what they say and the result is a friendly, poignant little piece of blues history.\nThere is only one other special guest involved, and that's yet another guitar legend, Carlos Santana, who proves a predictably fine sparring partner for Guy on the rolling Where the Blues Begins. The crisp production work is by Tom Hambridge, who also plays drums in Guy's backing band, and he keeps the changes coming throughout the set. The closing tracks include the thoughtful Everybody's Got to Go, the upbeat Let The Doorknob Hit Ya, and the slow, keyboard-backed Guess What, on which Guy shows off powerful vocals. It ends with an instrumental, Skanky, and another demonstration of his exhilarating guitar work. Seventy-four years on, he has recorded what is surely the blues album of the year. -BBC (Robin Denselow)\n\n\nTrack listing\n\nA1. &quot;74 Years Young&quot; 4:34\nA2. &quot;Thank Me Someday&quot; 5:42\nA3. &quot;On the Road&quot; 4:11\nA4. &quot;Stay Around a Little Longer&quot; (feat. B.B. King) 5:00\nB1. &quot;Key Don't Fit&quot; 5:02\nB2. &quot;Living Proof&quot; 3:45\nB3. &quot;Where the Blues Begins&quot; (feat. Carlos Santana) 4:37\nB4. &quot;Too Soon&quot; 3:26\nC1. &quot;Everybody's Got to Go&quot; 3:57\nC2. &quot;Let the Door Knob Hit Ya&quot; 3:44\nC3. &quot;Guess What&quot; 5:44\nC4. &quot;Skanky&quot; 4:16\n\nPersonnel\nBuddy Guy - Guitars, Vocals\nDavid Grissom - Guitar\nTommy Macdonald - Bass\nMichael Rhodes - Bass\nTom Hambridge - Drums, Percussion, Tambourine, Vocals (Background)\nMarty Sammon - Piano\nB.B. King - Guitar, Vocals on Track 4 &quot;Stay Around a While&quot;\nCarlos Santana - Conga, Guitar on Track 7 &quot;Where the Blues Begins&quot;\nReese Wynans - Clavinet, Fender Rhodes, Hammond B3, Piano, Wurlitzer\nJack Hale - Trombone\nWayne Jackson - Trumpet\nTom McGinley - Tenor Saxophone\nThe Memphis Horns - Horns\nBekka Bramlett - Background Vocals\nWendy Moten - Background Vocals\n\nLP transmogrification\nSpin Clean Record Washer\nDIY record vacuum\nPro-Ject RM 1.3 w/ Sumiko Pearl cartridge\nRogue Metis Preamp\nE-MU 0404 USB 2.0 Audio/MIDI Interface - MacBook Pro\nPeak LE (ripping)\niZotope RX Advanced 1.21.610 (click removal and Redbook conversion\nZyliss Susi DeLuxe Garlic Press\nxACT 1.71 (Redbook SBE correction)\nTAG 0.4.1\nXLD Version 20100401 (117.0) (FLAC encoding)","torrent":{"xt":"urn:btih:8d40c051d24deef99c0a2ef12c977272a5f7c30f","amp;dn":"Buddy+Guy+-+Living+Proof+%2874+Years+Young%29+%5BVinyl%5D-bh80231","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d40c051d24deef99c0a2ef12c977272a5f7c30f","infoHashBuffer":{"type":"Buffer","data":[141,64,192,81,210,77,238,249,156,10,46,241,44,151,114,114,165,247,195,15]},"announce":[],"urlList":[]}}