{"title":"Nine Inch Nails - TOIOU NIN AVOTT VEGAS 720p","uid":5438489,"size":4234740742,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8d525b39d5325f4229eede549c86a3543800f3a3&amp;dn=Nine+Inch+Nails+-+TOIOU+NIN+AVOTT+VEGAS+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1268808563,"description":"THIS ONE IS ON US PRESENTS\nANOTHER VERSION OF THE TRUTH: VEGAS\n\nOn 5th May, 2008, Nine Inch Nails released &quot;The Slip&quot; for free via their website, as a gift to their fans. Or as Trent Reznor put it: &quot;This one's on me&quot;.\n\nOn December 13th, 2008, dozens of Nine Inch Nails fans recorded the last show ofthe Lights In The Sky tour at Planet Hollywood, Las Vegas.\n\nOn January 7th, 2009, over 400Gb of video from the Victoria, Portland and Sacramento shows from the same tour were unofficially released by the band.\n\nBy working together, the Nine Inch Nails fan community have created &quot;Another Version of the Truth&quot; - a 3 disc creative commons release bringing together numerous editors, designers, and web programmers to create a professional digital film, followed by a physical release created by fans for fans.\n\nTrailer: http://www.you-tube.com/watch?v=4jVPiROnJ-0\n\n\nThis is the final part of the AVOTT collection: Vegas\nFilmed entirely by fans and co-ordinated by Alex Gamble, this release saw the community fly in from around the world, donate technology, skill, and even airfare (fans raised money to send chaonatic, a valued taper, to the concert) to document the final performance of Nine Inch Nails' stunning 2008 tour.  Over 200GB of footage was collected, which was meticulously edited together by a team comprising of people from all over the world.  \n\nThis disc is available in a variety of formats including DVD, iPod, andand over the coming weeks people from across the community will create several more formats for their peers.  \n\n\nDo whatever you want with this release, as long as it is FREE.  The NIN community have a long history of free and open filesharing, but touts, scalpers, and profiteers are NEVER tolerated.  \n\nThis one is on us. Our time. Our effort. Our Gift to all NIN fans.\n\nOther ThisOneIsOnUs releases can be found here: http://thisoneisonus.org/node/2\n &lt;a href=&quot;\nhttp://thisoneisonus.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thisoneisonus.org&lt;/a&gt;\nwww.nin.com &lt;a href=&quot;\nhttp://echoingthesound.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://echoingthesound.org&lt;/a&gt;\nwww.theninhotline.net\nwww.reflectinginthechrome.com\nwww.ninwiki.com\n","torrent":{"xt":"urn:btih:8d525b39d5325f4229eede549c86a3543800f3a3","amp;dn":"Nine+Inch+Nails+-+TOIOU+NIN+AVOTT+VEGAS+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d525b39d5325f4229eede549c86a3543800f3a3","infoHashBuffer":{"type":"Buffer","data":[141,82,91,57,213,50,95,66,41,238,222,84,156,134,163,84,56,0,243,163]},"announce":[],"urlList":[]}}