{"title":"Ziggy Marley - Family Time","uid":4929818,"size":62199808,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8de82a14f2c0653d85561febc0eba121e6dcfb8e&amp;dn=Ziggy+Marley+-+Family+Time&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Blasty711","files":13,"time":1243994740,"description":"Family Time is Ziggy Marley s third solo album and first full-length offering especially for children and families. Marley produced the album with legendary producer Don Was, known for his GrammyÃ‚Â®-winning work with such artists as Bonnie Raitt as well as with his own hit-making group, Was (Not Was). With original songs newly-composed by Marley himself, the album features a variety of family and friends as guests including Rita Marley (Ziggy s mother), Cedella Marley (sister), Judah Marley (daughter), Paul Simon, Jack Johnson, Willie Nelson, Toots Hibberts (of Toots and the Maytals), Elizabeth Mitchell, Laurie Berkner, Paula Fuga and two stories narrated by Jamie Lee Curtis.\n\nGrowing up music was an important part of my childhood, Marley says. I see it being just as important in my children and all children growth and development. Music helps children to grow with open minds and open hearts and this is my message. This record represents my daily family life and is inspired by my three-year-old daughter Judah and baby Gideon. It was a joy to make and opened up new avenues in my creativity. Family Time is for all families and especially the world family.\n\nZiggy has contributed to a variety of children s programming including Nick Jr. s Dora the Explorer, the PBS children s show Arthur, and the animated film Shark Tale, in which he played the character of Bernie the Jamaican jellyfish and re-recorded his father s Three Little Birds with Sean Paul and his brother Stephen Marley for the soundtrack.\n\n\n    * 1 FAMILY TIME w/ JUDAH MARLEY\n    * 2 I LOVE YOU TOO w/ RITA MARLEY &amp; CEDELLA MARLEY\n    * 3 TAKE ME TO JAMAICA w/ TOOTS HIBBERT\n    * 4 ABC\n    * 5 HOLD EM JOE\n    * 6 CRY, CRY, CRY, SET THE CHILDREN FREE w/ JACK JOHNSON &amp; PAULA\n    * 7 THIS TRAIN w/ WILLIE NELSON\n    * 8 WINGS OF AN EAGLE w/ ELIZABETH MITCHELL\n    * 9 ZIGGY SAYS\n    * 10 WALK TALL w/ PAUL SIMON\n    * 11 FUTURE MAN, FUTURE LADY w/ LAURIE BERKNER\n    * 12 IS THERE REALLY A HUMAN RACE\n    * 13 MY HELPING HANDS\n","torrent":{"xt":"urn:btih:8de82a14f2c0653d85561febc0eba121e6dcfb8e","amp;dn":"Ziggy+Marley+-+Family+Time","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8de82a14f2c0653d85561febc0eba121e6dcfb8e","infoHashBuffer":{"type":"Buffer","data":[141,232,42,20,242,192,101,61,133,86,31,235,192,235,161,33,230,220,251,142]},"announce":[],"urlList":[]}}