{"title":"Emperors series by Allan Massie (Books 1-3)","uid":9631509,"size":2119663,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f692ffc244c95ddcd7a8dd8152b77acebedae67&amp;dn=Emperors+series+by+Allan+Massie+%28Books+1-3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":9,"time":1392791223,"description":"\nAllan Massie (born 1938) is a well-known Scottish journalist, sports writer and novelist. Massie is one of Scotland's most prolific and well-known journalists, writing regular columns for The Scotsman, The Sunday Times (Scotland) and the Scottish Daily Mail. \n\nHe is also the author of nearly 30 books, including 20 novels. He is notable for writing about the distant past.\n\nGenre: Non-Fiction | Biography | Historical\n\n\nBook 1: Caesar\nCaesar is the third in Allan Massie's quartet of Roman novels, a brilliant and eagerly awaited successor to Tiberius, which was widely acclaimed last year. In retelling the story of Caesar, from crossing the Rubicon to the Ides of March, Allan Massie writes with wit and intelligence and brings to individual life both Cleopatra and Cicero, Marcus Brutus and Anthony; while political philosophy has never before been clothed in such an atmosphere of highly charged sexuality.\n\nBook 2: Augustus\nReconstruction of the lost memoirs of Emperor Augustus; an account from the killing of Caesar to his own death.\nAfter Caesar and Antony, the third volume of this series of historical novels about the Roman Empire. The remarkable recovery of the drama and glory of a unique historic character.\n\nBook 3: Tiberius\nPresenting a rich study of the ancient Roman world, a fictional autobiography of Emperor Tiberius offers an enlightening view of a proud, dutiful, and brooding man and his family, including Augustus Caesar, Caligula, and Nero.","torrent":{"xt":"urn:btih:8f692ffc244c95ddcd7a8dd8152b77acebedae67","amp;dn":"Emperors+series+by+Allan+Massie+%28Books+1-3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f692ffc244c95ddcd7a8dd8152b77acebedae67","infoHashBuffer":{"type":"Buffer","data":[143,105,47,252,36,76,149,221,205,122,141,216,21,43,119,172,235,237,174,103]},"announce":[],"urlList":[]}}