{"title":"Claude Debussy - Music for Flute and Harp","uid":4848152,"size":300228884,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:90955972a2de34b3b4244b7af4023ec7a82ff32a&amp;dn=Claude+Debussy+-+Music+for+Flute+and+Harp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"burningrabbit","files":23,"time":1239767221,"description":"Claude Debussy Music for Flute and Harp / played by Chesis and Cutler/)\n\n- Sonate for Flute, Viola and Harp\n- Chansons de Bilitis\n- Beau Soir\n- Children's Corner\n- Three pieces\n\nYEAR: 1991\nTPL : 70:19\n\nAnnotation (recognized text, not proof-read)\n\nThe SonÃƒÂ³te for flute, viola, and harp is the 2nd of six sonatas planned by Debussy, three of which were written before the composer's death. Debussy first considered orchestrating the work for flute, oboe, and harp but later changed his mind. It was Debussy's hope that he could write a work using the forms of the &quot;classical&quot; sonata without being imprisoned by them. It is generally agreed that he succeeded. This three movement work is one of his most deeply introspective compositions, and the one about which he wrote, &quot;It's terribly sad and I don't know whether to laugh at it or cry.&quot;\nThe Chanson de Bililis performed on this recording is the lesser known of the two works which Debussy composed under this title. This series of musical fragments weaving among 12 poems about the fictional ancient Greek poetess. Bilitis, was composed in 1900-1901. Debussy's good friend. Pierre Louys. had recently published an extensive poem cycle (claiming to have unearthed rather than authored it) by an hitherto unknown member of Sappho's circle on 7th Century B.C. Lesbos. In a very short time, the Parisian intellectual community had exposed this literary hoax and revealed that Bilitis had not. in fact, existed. This disclosure did nothing to diminish the popularity of the work. In 1900. Louys planned to produce a theatrical event built around a selection of poems from the cycle, and persuaded Debussy to write some incidental music for the production. In the event, the combined music and text never had a public performance in it's creators' lifetimes, but there was one private performance of the piece in 1901 which included &quot;tableaux vivants&quot; of scantily clad young ladies of Parisian society. The audience was scandalized; the critics were thrilled. Unfortunately, after this single performance, the music was put away. The score was lost, as was the celeste part. The other instrumental parts were eventually found and reassembled, and are here performed together with Arthur HoÃƒÂ©rce's reconstructed celeste part.\nBeau Soir, a lovely and haunting setting of a poem by Paul Bourget. was composed while Debussy was still a student at the Paris Conservatory in 1876. It was transcribed from the original voice and piano by Chesis/Cutler for this recording.\nChildren's Comer was composed between 1906 and 1908 for Debussy's little daughter. The six movements are evocations in sound of a child's life and perceptions; from the first movement's parody of a young pianist at his exercises through the sheer fun and exuberance of the last movement's American jazz dance. The work, originally composed for solo piano, was transcribed for flute, cello and harp by the great early 20th century harpist, teacher and composer, Carlos Salzedo.\nThe title, Three Pieces, was given by noted composer, David Noon, to a set of familiar piano works which he transcribed for flute, harp and string quartet in 1989. They include L'lle Joyeuse (1904), La Filie aux Cheveux de Lin (1910) and Danse (Tarantelle Styrienne) (1890). David Noon chairs the music history and composition departments at the Manhattan School of Music and has received awards and commissions from, among others, ASCAP, BMI, Aspen Festival, Yale, and the National\nEndowment for the Arts.\nSince their highly praised New York debut, Chesisl'Cutler has appeared in recital on three continents and in forty U.S. states. They made their critically acclaimed London debut at the Southbank Centre during a month-long tour of the British Isles and their first Far Eastern tour included a sold-out appearance in Tokyo's Asahiseimei Hall. Their recent European tours have included concerts in France, Belgium, Germany and Scotland, while over the past few seasons, their American performances have been crowned by New York recitals sponsored by Carnegie and Merkin Halls. In addition to their recitals in traditional concert venues, the duo have often performed chamber music in the chateaux of France, the country houses of England, and at stately homes across the United States.\nThe artists met while students at the Tanglewood Music Festival, and between them, these two Yale graduates have amassed a total of over thirty awards, scholarships, and competition   victories.   Their   numerous concerto engagements have included appearances with Solisti New York, the Scottish Baroque Ensemble, the North Carolina Symphony, the Boise Philharmonic, the Handel Society of Washington, D.C. the Houston Symphony, and the Orchestre du Capitole de Toulouse.\nChesislCutler is strongly committed to the commissioning and performances of American contemporary music. Composers such as Ezra Laderman, Andrew Thomas and Bruce Saylor have composed pieces for them, and the 1989 season saw the premiere performance of the Concerto: Cold, Silent Snow which they, together with the Lehigh Valley Chamber Orchestra, commissioned from Minnesota composer Libby Larsen.\nAlong with their growing reputation as a duo, both artists have pursued distinguished solo careers. Linda Chesis has gained recognition as one of the most exciting and dynamic flutists of her generation. The only American prizewinner at the Paris International Flute Competition, she also won the first prize at the National Flute Association Competition in the United States. She made her New York recital debut to a sold-out Carnegie Hall, has been heard on the Metropolitan Museum of Art's Introduction Series, and as orchestral soloist with several major U.S. symphonies. A former student of legendary flutist, Jean-Pierre Rampal, Ms. Chesis was featured with him and Julius Baker in concert at Lincoln Center and has often collaborated with soprano Jessye Norman in recital. Ms. Chesis chairs the Woodwind Department at the Manhattan School of Music. Sara Cutler, praised by the Washington Post for her &quot;dazzling, beautifully styled&quot; playing and by the New York Times for her &quot;colourfully virtuosic&quot; performances, has appeared in recital throughout the United States, Mexico, Great Britain, and Israel. Ms. Cutler was orchestral soloist in the European premieres of two harp concerti, at the Edinburgh Festival and at the Festival of Two Worlds in Spoleto, Italy. In the United States, she has appeared as concerto soloist at the Kennedy Center and at New York's Town Hall. She is a member of the faculty of Teacher's College, Columbia University in New York and is a frequent guest lecturer at the Tanglewood Music Festival.\nClaire Bloom is well known for her work on the stage, in film, and on television. At 17, she played Ophelia opposite Paul Scofield at Stratford-upon-Avon. Thus began a long line of classical roles in theatres from the Old Vic to London's West End to Broadway, in plays by (among others) Shakespeare. Chekhov, and Ibsen. Her film career has been equally distinguished, including memorable performances in Limelight (1952), The Spy Who Came In from the Cold (1956) and Sammy and Rose (1989). Her numerous television appearances have included the BBC Shakespeare series and Brideshead Revisited, and her roles in Shadowlands and in The Belle of Amherst have won her the BAFTA- and International Emmy awards.\n\n\n\n\n\nFound this on demonoid. The seeding there is low, as is attendance these days...\n\nLet's help each other obtain this rare phonogram.\n\n","torrent":{"xt":"urn:btih:90955972a2de34b3b4244b7af4023ec7a82ff32a","amp;dn":"Claude+Debussy+-+Music+for+Flute+and+Harp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90955972a2de34b3b4244b7af4023ec7a82ff32a","infoHashBuffer":{"type":"Buffer","data":[144,149,89,114,162,222,52,179,180,36,75,122,244,2,62,199,168,47,243,42]},"announce":[],"urlList":[]}}