{"title":"Men At Work - It's A Mistake (2nafish)","uid":5948437,"size":166715396,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:909ec48c89e088f188105f65d2d2fcb4f882df5d&amp;dn=Men+At+Work+-+It%5C%27s+A+Mistake+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1289453803,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;It's a Mistake&quot; is a single released in by the Australian group Men at Work. The song was written by Men at Work singer/guitarist Colin Hay and the recording was produced by Hay with keyboardist Greg Ham. The song is taken from their 1983 album Cargo, and peaked at #6 on the Billboard Hot 100 in August 1983.\n\nThe song's lyrics deal with the mindset of military men across the world in the 1980s, wondering if and when the democratic countries of NATO and the Warsaw Pact communist states will end the Cold War standoff with conventional battle or a nuclear exchange. Hay sings in the persona of a mid-level officer wishing to learn from his superiors if his men are going to war or not.\n\nThe video, which had moderate rotation on MTV (as opposed to the band's singles from their Business As Usual album), was mostly set in an underground bunker or &quot;War Room&quot; similar to the NORAD facility of Cheyenne Mountain, and the band seemed to engage in a semi-retelling of the 1964 black comedy Dr. Strangelove, though without the final image of Major Kong riding to his destruction astride a nuclear bomb. Instead, at the end of this video, the officer is smoking as he removes the protective cover from the nuclear button, which is right next to his ashtray. Then, when he goes to stub out his cigarette in the ashtray, he accidentally hits the button instead.\n\nCargo is the second album by Australian band Men at Work, released in 1983. Rolling Stone magazine noted that while it lacked a blockbuster hit, &quot;song for song, it is a stronger overall effort than Business as Usual.&quot; \n\nMen at Work are an Australian rock band who achieved international success in the 1980s. They are the only Australian artists to have a simultaneous #1 album and #1 single in the United States (Business as Usual and &quot;Down Under&quot; respectively). They achieved the same distinction of a simultaneous #1 album and #1 single in the United Kingdom. The group won the 1983 Grammy Award for Best New Artist and sold over 30 million albums worldwide. The band's sound is distinguished by its use of woodwind and brass instruments.\n\nColin Hay emigrated to Australia in 1967 from Scotland with his family. In 1978, he formed a duo with Ron Strykert, which expanded with the addition of drummer Jerry Speiser and Australian progressive rock keyboard player Greg Sneddon. They formed an unnamed four-piece group that would later morph into Men at Work. The band's first experience in the recording studio was recording the music to Riff Raff, a low-budget stage musical Sneddon had worked on. Sneddon soon left, to be replaced in late 1979 by saxophonist/flautist/keyboardist Greg Ham. Bassist John Rees completed the band.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:909ec48c89e088f188105f65d2d2fcb4f882df5d","amp;dn":"Men+At+Work+-+It%5C%27s+A+Mistake+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"909ec48c89e088f188105f65d2d2fcb4f882df5d","infoHashBuffer":{"type":"Buffer","data":[144,158,196,140,137,224,136,241,136,16,95,101,210,210,252,180,248,130,223,93]},"announce":[],"urlList":[]}}