{"title":"Methods for the Study of Deep-Sea Sediments,1st Edition{BBS}","uid":6768410,"size":16970075,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91aa63230954161920997eb77622d8f933dfaeda&amp;dn=Methods+for+the+Study+of+Deep-Sea+Sediments%2C1st+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1319482911,"description":"For years scientists viewed the deep sea as calm, quiet, and undisturbed, with marine species existing in an ecologically stable and uniform environment. Recent discoveries have completely transformed that understanding and the deep sea is recognized as a complicated and dynamic environment with a rich diversity of marine species. Carefully designed to provide practical information in an easily accessible format, Methods for the Study of Deep-Sea Sediments, Their Functioning, and Biodiversity covers how to investigate the biological components through analysis of their biodiversity. It also provides the protocols and methodological details needed to investigate some aspects of the functional biodiversity of variables commonly utilized to describe and understand the drivers of deep-sea ecosystem functioning.\n\nThis volume contains detailed protocols for analyzing all benthic components from benthic viruses, prokaryotes, protozoa, foraminifera, to meio-, macro-, and megafauna. It includes step-by-step procedures, with additional notes on the crucial steps or possible difficulties arising from the analysis. Each chapter provides a brief introduction, a description of the sampling procedures and/or the sample treatment, and then the laboratory protocols, providing information on instrument setting and/or the solutions utilized. Each chapter also contains a visual scheme of the protocol for use during laboratory activities and for tracking each laboratory step. Linking information on biodiversity with the functioning of the marine ecosystems, the book covers all living components of the benthos. It provides practical information for anyone studying deep-sea habitats, their characteristics, functioning, and biodiversity.\n\nAbout the Author\n\nDirector Department of Marine Sciences, Polytechnic University of Marche, Ancona, Italy\nProduct Details\n\n    * Hardcover: 458 pages\n    * Publisher: CRC Press; 1 edition (December 21, 2009)\n    * Language: English\n    * ISBN-10: 1439811377","torrent":{"xt":"urn:btih:91aa63230954161920997eb77622d8f933dfaeda","amp;dn":"Methods+for+the+Study+of+Deep-Sea+Sediments%2C1st+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91aa63230954161920997eb77622d8f933dfaeda","infoHashBuffer":{"type":"Buffer","data":[145,170,99,35,9,84,22,25,32,153,126,183,118,34,216,249,51,223,174,218]},"announce":[],"urlList":[]}}