{"title":"Coast to Coast AM December 06 2012","uid":7897878,"size":56298551,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:91cbcf53cd4bd4c82fca0b1a8892e60cbaefe765&amp;dn=Coast+to+Coast+AM+December+06+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1354888438,"description":"Date: \t12-06-12\nHost: \tGeorge Noory\nGuests: \tDavid Darling, Sterling D. Allan\n\nIn the first half, author and astronomer David Darling discussed the plausibility of various scenarios which could fulfill doomsday predictions for the end of the Mayan calendar, including near-Earth asteroids, devastating pandemics, and solar kill shots. He observed that, since 12.21.2012 is a mere two weeks away, events like a supervolcanic eruption or an asteroid strike can be dismissed as possibilities for that fateful day, since warning signs would have been seen by now. In light of this limited time frame, Darling opined that fast-acting events like an alien invasion or spread of an airborne pandemic remain &quot;remote possibilities.&quot;\n\nOn the potential that the end of the Mayan calendar may portend the arrival of Planet X, Darling explained that such a scenario would result in it being clearly visible in the sky both night and day. Additionally, he rejected the idea that Planet X could be 'hiding' behind the Sun, because the Earth's motion would eventually reveal the object. &quot;The mechanics of the thing don't really add up,&quot; Darling said. That said, he conceded that it is possible that such a planet is lurking out in the distant solar system and may eventually arrive near Earth, albeit not on 12.21.2012. &quot;I cannot be persuaded that it will arrive in two weeks time,&quot; he said, &quot;I just cannot make it work in any scenario.&quot;\n\n----------------------------------------------------\n\nIn the latter half, CEO of Pure Energy Systems Inc., Sterling D. Allan, talked about how Iran may have used a saucer-like craft to intercept a U.S. drone and also shared updates on the cold fusion and free energy fronts. He detailed the story of a nuclear physicist named Mehran Keshe, who claims to have developed plasma-based anti-gravity technology which has been adopted by the Iranian military. According to Keshe, the Iranians captured the drone by flying their craft over it, enlarging the anti-gravity field, and then landing both objects safely to the ground. This technique, Allan said, would also cut off communication to the drone, thus blocking self-destruct orders sent by the U.S. military. While this may sound like a fantastic tale, Allan noted that Keshe's group is a &quot;serious organization&quot; and that he is &quot;not just one guy out there making silly claims.&quot;\n\nRegarding free energy and cold fusion research, Allan marveled that there are currently &quot;a dozen companies, at least&quot; working on free energy devices aimed at reaching the marketplace. Although such alternative technologies have been thwarted by nefarious forces for decades, Allan declared that &quot;there's enough momentum now with enough companies chasing this&quot; that suppressing such devices has become futile. However, he suggested that there are a number of safety and logistical issues which will have to be resolved before the average citizen can purchase one of these devices. Ultimately, Allan surmised that cold fusion devices for in-home use will not be available for at least a year, but other cutting edge energy technologies could be &quot;beta tested&quot; by select consumers in just a few months. Additional information on these topics can be found at Allan's website.\n\nNews segment guests: Chris Conrad &amp; Giorgio Tsoukalos\nWebsite(s):\n\n   \n    FreeEnergyNews.com\n\nBook(s):\n\n    Megacatastrophes!\n\n","torrent":{"xt":"urn:btih:91cbcf53cd4bd4c82fca0b1a8892e60cbaefe765","amp;dn":"Coast+to+Coast+AM+December+06+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91cbcf53cd4bd4c82fca0b1a8892e60cbaefe765","infoHashBuffer":{"type":"Buffer","data":[145,203,207,83,205,75,212,200,47,202,11,26,136,146,230,12,186,239,231,101]},"announce":[],"urlList":[]}}