{"title":"Already Compromised and Gone - Ken Ham","uid":10386460,"size":18627357,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91ffe6c4a9840aa2ef9450fcf5a133a48116c987&amp;dn=Already+Compromised+and+Gone+-+Ken+Ham&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":2,"time":1403137151,"description":"Already Compromised:\nWill a Christian college build a student's faith or tear it down?\n\nParents and students sacrifice large sums of money for a Christian college education. Why? They are purchasing a guarantee their child's faith in God and the Bible will be guarded and developed. But is the Bible being taught? Will they graduate believing in the inerrancy of Scripture, the Flood of Noah's Day, and a literal six day creation?\n\nApologetics powerhouse Ken Ham and Dr. Greg Hall reveal an eye opening assessment of 200 Christian colleges and universities. In an unprecedented 2010 study by America Research Group, college presidents, religion and science department heads were polled on critical areas of Scripture and core faith questions.\n\nTheir responses will shock you. Some have already compromised.\n\n\nAlready Gone:\nIf you look around in your church today, two-thirds of the young people who are sitting among us have already left in their hearts; soon they will be gone for good.\n\nThis is the alarming conclusion from a study Answers in Genesis commissioned from America's Research Group, led by respected researcher Britt Beemer. The results may unnerve you - they may shake long-held assumptions to the core - but these results need to be taken seriously by the church. Already Gone reveals:\n\n-Why America's churches have lost an entire generation of believers\n-The views of 1,000 twenty-somethings, solidly raised in the church but no longer attending - and their reasons why\n-Relevant statistical data effectively teamed with powerful apologetics\n\nThe study found that we are losing our kids in elementary, middle school, and high school rather than college, and the &quot;Sunday school syndrome&quot; is contributing to the epidemic, rather than helping alleviate it. This is an alarming wake-up call for the church, showing how our programs and our approaches to Christian education are failing...and our children are paying the price. Though the statistics reveal a huge disconnect taking place between our children and their church experience, Already Gone shows how to fight back for our families, our churches, and our world. We can make a difference today that will affect the statistics of tomorrow in a positive and Christ-focused way!\n\n\nAbout the author:\nKen Ham is the president/CEO and founder of Answers in Genesis - U.S. and the highly acclaimed Creation Museum. Ken Ham is one of the most in-demand Christian speakers in North America. Ken's emphasis is on the relevance and authority of the book of Genesis and how compromise on Genesis has opened a dangerous door regarding how the culture and church view biblical authority. His Australian accent, keen sense of humor, captivating stories, and exceptional PowerPoint illustrations have made him one of North America's most effective Christian communicators. ","torrent":{"xt":"urn:btih:91ffe6c4a9840aa2ef9450fcf5a133a48116c987","amp;dn":"Already+Compromised+and+Gone+-+Ken+Ham","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91ffe6c4a9840aa2ef9450fcf5a133a48116c987","infoHashBuffer":{"type":"Buffer","data":[145,255,230,196,169,132,10,162,239,148,80,252,245,161,51,164,129,22,201,135]},"announce":[],"urlList":[]}}