{"title":"Syberia 2.(PC GAME)","uid":4286236,"size":590311253,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:92527f21206dd6f63fbe74ae05649cd8d7962090&amp;dn=Syberia+2.%28PC+GAME%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kingswoodtown","files":1,"time":1215716438,"description":"Syberia 2 Unrar and play..\n\n\nWhen gamers last saw Kate Walker, she had found the elusive Hans Voralberg, an aging toymaker who built advanced machines and automatons. The old man seemed deliriously obsessed with finding Syberia, a sacred island where Mammoths still freely roam. Kate Walker meets and joins Oscar, a wimpy yet loyal automaton built by Hans, in a bid to realize the crazed dreams of the frail old man. The trio soon boards a whimsical wind-up train and shoot into the frozen unknown in search of Syberia. It&amp;#039;s ok if you don&amp;#039;t know what I&amp;#039;m talking about, Syberia II graciously provides a bite-sized prologue for the Syberia virgins of the world through an optional cinematic. \n\nThe opening movie in Syberia II reveals Kate Walker letting go of her roots. She disregards her boss&amp;#039;s plea to have her return home to New York after she left for France on a business trip weeks earlier. She&amp;#039;s now resolved to help Hans Voralberg reach the mythical island of Syberia. Kate Walker forsakes family and career to head off into the frozen north in search of the old man&amp;#039;s dream, even if she&amp;#039;s still not too sure about it herself.\n\nMost previews of Syberia II mention the first few hours spent in the dreary town of Romansbourg, so I&amp;#039;ll just skip past all that. You control Kate Walker through a very simple interface made up of an inventory screen, a document screen, and of course, a slot for Kate&amp;#039;s cell phone. Fans of the original will remember getting tons of phone calls from Kate Walker&amp;#039;s mother, boyfriend and boss. The cell phone has taken a backseat in Syberia II, as Kate Walker has pretty much severed all connections with her former self. She ends up hanging up on most of the calls she gets. I really didn&amp;#039;t mind the heavy cell use in the first game, as it sometimes provided bits of needed info on the story. Now though, you only make a few phone calls that actually matter story-wise, making the phone feel more like a novelty than anything else. \n\nAs in most games of this type, a bulk of the adventure will have you moving your cursor around the screen in search of hot spots. Usually, this means mousing over characters to initiate a conversation or scrolling over an item to pick it up. Which brings up problem number one: unless you have super-vision, you&amp;#039;ll either need cornea implants or your glasses cleaned and tweaked to find some of the more reclusive hot spots in this game. It is way too easy to completely miss an entire section of a restaurant, bar or what have you just because you don&amp;#039;t hold title as the world&amp;#039;s best hot spot hunter.","torrent":{"xt":"urn:btih:92527f21206dd6f63fbe74ae05649cd8d7962090","amp;dn":"Syberia+2.%28PC+GAME%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92527f21206dd6f63fbe74ae05649cd8d7962090","infoHashBuffer":{"type":"Buffer","data":[146,82,127,33,32,109,214,246,63,190,116,174,5,100,156,216,215,150,32,144]},"announce":[],"urlList":[]}}