{"title":"POtHS - The Bible - 32 - Biblical Collection - Volume 04 - Icons","uid":8324889,"size":7141240851,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:92b3c566cf145ad6b9d2e84c59fd386d728aac8a&amp;dn=POtHS+-+The+Bible+-+32+-+Biblical+Collection+-+Volume+04+-+Icons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":-1,"time":1364770185,"description":"PO t HS\n\nPouring Out the Holy Spirit\n\nBiblical Times\n\n\nPOtHS - Biblical Times - 31 - Biblical Collection - Volume 04 - Icons Paul Saul John and David\n\n\nPOtHS says: Please pray for my niece Christina and her new baby and husband. She has inoperable brain cancer.   ------    \n\nThis is good for all ages.  These films are of a much higher Quality than The History Channels portrayal of The Bible.\n\nDescription:\n\nGospel of John\n\nThe Gospel of John, the best-loved of the four Gospels.\n\nThe Gospel of John vividly comes to life in a faithful and powerful dramatization of the Biblical text. The Gospel of John meticulously recreates the era of Jesus during a tumultuous period that changed the course of history.\n\nStarring Henry Ian Cusick as Jesus, and narrated by Christopher Plummer, and with a cast of 2500, The Gospel of John has been adapted for the screen, word for word, based on the American Bible Society's Good News Bible by Emmy nominated John Goldsmith and is directed by acclaimed British director, Philip Saville. Rated PG-13 (for violence involving the crucifixion), Color, 2002.\n\nDisc 1: Includes the original 3 hour feature\nDisc 2: Includes the 2 hour Highlight version + Special Features\n\nSaul and David\n\nDescription:\n\nDavid of Bethlehem, slays the giant and become a rival to King Saul.\n\nFrom the Old Testament, the First Book of Samuel; this beautifully filmed story of David's life with King Saul has all the power and sensitivity of the Biblical account.\n\nKing Saul, requesting a conqueror to slay the Philistine giant Goliath, is amused when the child-servant of God, David of Bethlehem, answers his request. With the faith in God, David slays the giant and wins the love and admiration of Israel and the King. David becomes a great warrior for the King's army.\n\nEven though King Saul comes to admire David, the King starts to slowly lose faith in God. With the spirit of God departed from Saul, David is anointed King of Israel, thus begins a love-hate relationship between Saul and David. As the blessings of God fall upon David and he is exalted, Saul's fury rises against him in this epic tale.\n\nSpecial Features\n\n  Actor &amp; Bible Character Bios\n  Previews\n\n--------------------------------------------------------------\n--------------------------------------------------------------\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.                                    \n\n \n  :thankyou:    :thankyou:     Thank You JESUS  \n   \n","torrent":{"xt":"urn:btih:92b3c566cf145ad6b9d2e84c59fd386d728aac8a","amp;dn":"POtHS+-+The+Bible+-+32+-+Biblical+Collection+-+Volume+04+-+Icons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92b3c566cf145ad6b9d2e84c59fd386d728aac8a","infoHashBuffer":{"type":"Buffer","data":[146,179,197,102,207,20,90,214,185,210,232,76,89,253,56,109,114,138,172,138]},"announce":[],"urlList":[]}}