{"title":"Essex Boys Movie Collection (2000 - 2015) (AVI) Gooner","uid":12868376,"size":5475939024,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:93dff2ca96299a13d94cb547e8a9782d020b57ae&amp;dn=Essex+Boys+Movie+Collection+%282000+-+2015%29+%28AVI%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":6,"time":1448841143,"description":"Essex Boys (2000)\r\nThe film is based loosely around events in December 1995 that culminated in the murders of three drug dealers in Rettendon, Essex, UK. On 6th December Patrick Tate, Craig Rolfe and Tony Tucker, three drug dealers well known to the police, were lured to Workhouse Lane, Rettendon. There they were blasted to death with a shot gun while sitting in their Range Rover. They had been lured to their deaths on the pretext of a lucrative drugs deal. The three bodies were found the following morning, 7 December 1995.\r\n===================================================================================\r\nRise of the Foot Soldier (2007)\r\nRise of the Footsoldier follows the inexorable rise of Carlton Leach from one of the most feared generals of the football terraces to becoming a member of a notorious gang of criminals who rampaged their way through London and Essex in the late eighties and early nineties. It is three decades of his life following him from football hooliganism, through to his burgeoning career as a bouncer, his involvement in the criminal aspects of the early 'rave' scene and subsequently to his rise to power as one of the most feared and respected criminals in the country.\r\n===================================================================================\r\nBonded by Blood (2010)\r\nIn 1995, drug suppliers and career criminals Tony Tucker, Patrick Tate and Craig Rolfe were blasted to death by a shot gun whilst waiting in a Range Rover in Rettendon, Essex. The film charts their rise to become the most prolific dealers and feared criminals in the south of England, maintaining the hold on their empire with fear and violence until their untimely death.\r\n===================================================================================\r\nThe Fall of the Essex Boys (2013)\r\nThe rise and fall of the Essex Boys gang - the drugs, the violence and, of course, the murders. The real story is the most shocking of all.\r\n===================================================================================\r\nEssex Boys Retribution (2013)\r\nWhen three of the country's most notorious killers were shot dead in a desolate field, late one night, a criminal empire was toppled and the legend of the infamous Range Rover murders was born. Twenty years later, new faces are at the forefront of gangland Britain, but with the notorious killer never caught, there are those who haven't forgotten and won't rest until justice is served. The epic revenge spree that would shake the local crime families and police force to their core. Their names will never be known, but their actions shocked a nation.\r\n===================================================================================\r\nEssex Boys Law of Survival (2015)\r\nDanny an ex street thug takes on the Essex Underworld after they turn his life upside down","torrent":{"xt":"urn:btih:93dff2ca96299a13d94cb547e8a9782d020b57ae","amp;dn":"Essex+Boys+Movie+Collection+%282000+-+2015%29+%28AVI%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93dff2ca96299a13d94cb547e8a9782d020b57ae","infoHashBuffer":{"type":"Buffer","data":[147,223,242,202,150,41,154,19,217,76,181,71,232,169,120,45,2,11,87,174]},"announce":[],"urlList":[]}}