{"title":"Erik Koskinen-Hymies Vintage Records-4-16-11","uid":8311579,"size":150693908,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9417ed2631ac7fd342f046581f94f8eb39c2ced2&amp;dn=Erik+Koskinen-Hymies+Vintage+Records-4-16-11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Dan331851","files":14,"time":1364491621,"description":"Erik Koskinen\nHymies Vintage Records\nMinneapolis, MN\n4-16-11\n\n\n-Audience Recording using Zoom H2 rear internal mics &gt;SD Card&gt;PC&gt;Adobe Audition&gt;CD Wave Editor (split tracks)&gt;TLH&gt;FLAC Level 8\n-&quot;A &quot;MN Gneiss&quot; recording&quot; \n-Feel free to re-master, share on any other torrent site, convert to MP3, just never ever sell it. Also, if you like this show, why not support the artist by buying their music? \n\n\n&quot;Erik koskinen grew up in the heart of the middle of nowhere .. northern michigan. Playing solo and band shows since age 14. Both in the country and in the town erik has formed his own brand of american music based heavily on and for, quite simply &quot;people&quot;. Koskinen's musical pursuits have prompted him to load up his old pickup truck and relocate to various american musical meccas, including Nashville, New York, and California finally to find his way to Minneapolis, Minnesota. Making it his home as a producer, record engineer, sideman with the help of Saint Paul Native Molly Maher but most of all as a band leader and songwriter playing over one hundred shows a year. Erik's band has been a mainstay at Nye's Polonaise Room (best bar in america, Esquire Magazine) for the past three years and continues to build a scene out of the establishment alongside Molly Maher and Her Disbelievers as her band leader. Erik has producing and engineering credits with Molly Maher, Trampled by Turtles, Teague Alexy, The Hobo Nephews of Uncle Frank, Ray Barnard, and many more. When Erik isn't fronting his own shows he is out on the road with Molly Maher, Randy Weeks, and Ray Barnard, always trying to establish an honest music scene that seems to have lost it's footing in recent years.&quot;\n\n\n1. ?\n2. Pretty Girls\n3. ?\n4. Tell Me It's True\n5. You Didn't Even Remember My Mamma's Name\n6. Detroit Detroit\n7. ?\n\n &lt;a href=&quot;\nhttp://music4humans.us/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://music4humans.us/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:9417ed2631ac7fd342f046581f94f8eb39c2ced2","amp;dn":"Erik+Koskinen-Hymies+Vintage+Records-4-16-11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9417ed2631ac7fd342f046581f94f8eb39c2ced2","infoHashBuffer":{"type":"Buffer","data":[148,23,237,38,49,172,127,211,66,240,70,88,31,148,248,235,57,194,206,210]},"announce":[],"urlList":[]}}