{"title":"Jordan L Hawk - Whyborne and Griffin Book 3 Stormhaven","uid":11462168,"size":222958104,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:943048c14fa188a32e9ea516934324fd07ff1862&amp;dn=Jordan+L+Hawk+-+Whyborne+and+Griffin+Book+3+Stormhaven&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"katelynor","files":2,"time":1416000134,"description":"Book 3 in the Whyborne &amp; Griffin series\n\nPrevious book: Threshold\n\nMysterious happenings are nothing new to reclusive scholar Percival Endicott Whyborne, but finding one of his colleagues screaming for help in the street is rather unusual. Allan Tambling claims he can't remember any of the last hour - but someone murdered his uncle, and Allan is covered in blood.\n\nWhyborne's lover, dashing ex-Pinkerton detective Griffin Flaherty, agrees to prove Allan's innocence. But when Allan is deemed insane and locked away in the Stormhaven Lunatic Asylum, Griffin finds himself reliving the horrifying memories of his own ordeal inside a madhouse.\n\nAlong with their friend Christine, the two men become drawn deeper and deeper into a dark web of conspiracy, magic, and murder. Their only clue: a missing artifact depicting an unknown god. Who stole the artifact, and why can't Allan remember what happened? And what is the truth behind the terrible experiments conducted on Stormhaven's forbidden fourth floor?\n\nIt will take all of Whyborne's sorcery and Griffin's derring-do to stop the murderers and save Allan. But first, they must survive an even greater challenge: a visit from Griffin's family","torrent":{"xt":"urn:btih:943048c14fa188a32e9ea516934324fd07ff1862","amp;dn":"Jordan+L+Hawk+-+Whyborne+and+Griffin+Book+3+Stormhaven","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"943048c14fa188a32e9ea516934324fd07ff1862","infoHashBuffer":{"type":"Buffer","data":[148,48,72,193,79,161,136,163,46,158,165,22,147,67,36,253,7,255,24,98]},"announce":[],"urlList":[]}}