{"title":"The.One  1080p.mp4","uid":8132633,"size":1452507532,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:94ca827a91f8aebb5b2cfa9d079f2ffa3a609d3a&amp;dn=The.One++1080p.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mrta79","files":-1,"time":1360641345,"description":"A sheriff's deputy fights an alternate universe version of himself who grows stronger with each alternate self he kills.\n\nThere is not one universe, but there are many, which is a multiverse. Supposing you are just one person, there are many other versions of you in the other universes, there are ways to travel, but only a police agency,MVA, can travel only for police procedures. Gabriel Yulaw is a former MVA agent, who killed another version of himself in self-defense. It made the other versions of him stronger. When Yulaw found out about this, he became power-hungry killing the 122 other versions for two years. After killing Lawless and getting captured by his former partner Roedecker and a new MVA agent Funsch, Yulaw managed to escape the prison and is trying to kill his last target, Gabe Law who is a police officer. He is also at Yulaw's strength. Roedecker and Funsch now have to arrest Yulaw before he can kill Gabe. There is a possibility that the universe could die or make Yulaw invincible. After encountering Yulaw for the first time..","torrent":{"xt":"urn:btih:94ca827a91f8aebb5b2cfa9d079f2ffa3a609d3a","amp;dn":"The.One++1080p.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94ca827a91f8aebb5b2cfa9d079f2ffa3a609d3a","infoHashBuffer":{"type":"Buffer","data":[148,202,130,122,145,248,174,187,91,44,250,157,7,159,47,250,58,96,157,58]},"announce":[],"urlList":[]}}