{"title":"Porno Soundtracks Volume 1","uid":4144154,"size":48267653,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9538e0cddd5de9557984ce8b35c28bf816428e4a&amp;dn=Porno+Soundtracks+Volume+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PornoSoundtracks.com","files":16,"time":1208641227,"description":"About Porno Soundtracks\n\nWhat happens if you put three professional musicians in a recording studio and ... have them watch porn movies?\n\nWhile you probably begin imagining strange situations, these guys made it a creative venture. They created a new soundtrack to the 70ties adult movies they were watching - turning off the sound and just letting their instincts come up with vivid musical imaginations. And it worked.\n\nThis music sounds like a combination of Quentin Tarantino\\\\\\&amp;#039;s Death Proof and the Emanuelle sequels of adult movies. Feisty and furious with a sugarcoat of sensuality.\n\nThis is the first volume of their ventures, played on real instruments and treated to have the authentic sleazy sound of the 70\\\\\\&amp;#039;s.\n &lt;a href=&quot;\nhttp://www.pornosoundtracks.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.pornosoundtracks.com/&lt;/a&gt;\n\nA letter from the makers:\n\nAlbum too \\\\\\&quot;taboo\\\\\\&quot; for Record Labels?\n\nHi Guys,\n\nFirst of all, congratulations for standing ground on supporting alternative distribution methods for digital media - it\\\\\\&amp;#039;s needed in this grim landscape of greedy corporations and famewhores!\n\nThe reason I write you is that we have a problem. Being a music production team of three we recently hit brick wall. Most of our productions get picked up pretty easily by partners (record labels, publishing companies), but our latest production is apparently \\\\\\&quot;too hot to handle\\\\\\&quot;. That just sounded very cheesy, but bear with me. Well, taste differs, but we put a hell of an amount of work in this one so we thought it would go pretty smoothly. Not!\n\nLet me tell you a bit about the project. We have been obsessed by the sleazy picture quality and sounds of these old porn flicks, like Emanuelle and stuff. Being guys and all (and lots of belgian beer) we were having a ball and were joking about us getting a career in the porn business. Not as actors (well, the drummer would love thÃƒ?Ã‚Â¯Ãƒ?Ã‚Â¿Ãƒ?Ã‚Â½t!), but as musicians creating the background tracks to those flicks. Well, long story short - the idea grew on us, and so one day we blocked out our schedule, rented (ok, downloaded) a couple of old Emanuelle movies, muted the sound on the tv screen and started following our male instincts. Before your start to picture strange things - we just laid down some cool instrumental vintage-ero-lounge tracks. Played on real instruments with a lot of post-production afterwards, as we wanted it to sound as old and abused as possible.\n\nMost of the people outside the music industry just loved the idea. Ok, some where offended by us calling it \\\\\\&quot;Porno Soundtracks Volume 1\\\\\\&quot; - but in general people would absolutely love to buy the cd. So we began our usual round of giving our so-called \\\\\\&quot;friends\\\\\\&quot; at the record labels a call. Boy, were we surprised by the amount of rejection and insults we received! Absolutely no-one at the big record labels wanted to pick this up. Reason? Well, you would think porn is not a taboo anymore in this modern world, but apparently lots of these labels only want to sell cheap r&amp;b tracks with half-naked chicks in video-clips - as if that is different? No wonder those greedy bastards are still with their heads in the sand!\n\nSo we\\\\\\&amp;#039;re just gonna toss it out in the wild. No middle-men, no typical promotion campaign - just letting people decide for themselves. And what better way than to use the world\\\\\\&amp;#039;s most advanced distribution network? So here we are - weeks of hard work let free on \\\\\\&quot;the pipes\\\\\\&quot; of the internet :) It feels liberating! If you would like to help us reaching more people, would it be possible to spread the word a bit? It\\\\\\&amp;#039;d be cool to prove \\\\\\&quot;our friends\\\\\\&quot; that we don\\\\\\&amp;#039;t need them after all and that internet distribution is a viable distribution method ;)\n\nGreets,\nForbidden Ensemble","torrent":{"xt":"urn:btih:9538e0cddd5de9557984ce8b35c28bf816428e4a","amp;dn":"Porno+Soundtracks+Volume+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9538e0cddd5de9557984ce8b35c28bf816428e4a","infoHashBuffer":{"type":"Buffer","data":[149,56,224,205,221,93,233,85,121,132,206,139,53,194,139,248,22,66,142,74]},"announce":[],"urlList":[]}}