{"title":"Watch My Domains ISP v5","uid":15135507,"size":4324042,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:962c8d48d8eefc46abbfdeaaf8370e3e703d8e2d&amp;dn=Watch+My+Domains+ISP+v5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZarkBit","files":1,"time":1467174354,"description":"Watch My Domains ISP v5\r\n\r\nCorporate / Business Domain Name Management With Database &amp; SQL Support\r\n\r\nManage huge domain name portfolios belonging to multiple clients. Supports MS SQL and MS Jet Databases.\r\n\r\nAdvanced domain name and site management software for businesses. Track almost everything related to domains.\r\n\r\nSupports old and new gTLDS (guru, company, bike, etc), country code TLDs and IDNs (International domains)\r\n\r\nMonitor expiry dates, name servers, domain contact addresses, associated A records, MX records, SSL data and more.\r\n\r\n\r\nMonitor Expiry Dates, MX Records, SSL Expiry Dates and More\r\nWatch My Domains ISP can monitor a large number of data related to domain names. These include domain expiry dates, creation dates, domain contacts, name servers, IP addresses, MX records, SSL certificate data and more.\r\nAll domain names that are expiring soon are highlighted and displayed with an alert icon next to it.\r\n\r\n\r\nRule based display and lookups using SQL\r\nUser Configurable, Rule Based Domain record Display and Lookups\r\nWatch My Domains ISP uses a real database for storage. This means that you can use powerful SQL queries to control both display and lookup of domains. You can quickly create rules for lookup. For example, re-lookup all domains that have an expiry date in April or check the root IP addresses of all domains that use a specific name server.\r\n\r\n\r\nMonitor all Domain Related Data\r\nCreate any number of custom data columns, attach notes and more.\r\nAttach different notes to each domain and see them as part of the domain data table.\r\nYou can also add any number of custom data columns. These columns can then be displayed as part of the domain table. You can add data to these columns by importing from a CSV file or by manual editing","torrent":{"xt":"urn:btih:962c8d48d8eefc46abbfdeaaf8370e3e703d8e2d","amp;dn":"Watch+My+Domains+ISP+v5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"962c8d48d8eefc46abbfdeaaf8370e3e703d8e2d","infoHashBuffer":{"type":"Buffer","data":[150,44,141,72,216,238,252,70,171,191,222,170,248,55,14,62,112,61,142,45]},"announce":[],"urlList":[]}}