{"title":"The Selected Prose of Fernando - Fernando Pessoa","uid":10188567,"size":531342,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:967ede8de84af997512b253517fa139bbc21905f&amp;dn=The+Selected+Prose+of+Fernando+-+Fernando+Pessoa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1400611941,"description":"The Washington Post Book World has written that Fernando Pessoa was &quot;Portugal's greatest writer of the twentieth century [though] some critics would even leave off that last qualifying phrase&quot; and &quot;one of the most appealing European modernists, equal in command and range to his contemporaries Rilke and Mandelstam.&quot; The Selected Prose of Fernando Pessoa, a Los Angeles Times Best Book of 2001, spans playful philosophical inquiry, Platonic dialogue, and bitter intellectual scrapping between Pessoa and his many literary alter egos (&quot;heteronyms&quot;). The heteronyms launch movements and write manifestos, and one of them attempts to break up Pessoa's only known romantic relationship. Also included is a generous selection from Pessoa's masterpiece, The Book of Disquiet, freshly translated by Richard Zenith from newly discovered materials. The Selected Prose of Fernando Pessoa is an important record of a crucial part of the literary canon. &quot;Zenith's selection is beautifully translated, compact while appropriately diverse.&quot; -- Benjamin Kunkel, Los Angeles Times &quot;[Pessoa] is one of those writers as addictive, and endearing, as Borges and Calvino.&quot; -- Michael Dirda, The Washington Post Book World","torrent":{"xt":"urn:btih:967ede8de84af997512b253517fa139bbc21905f","amp;dn":"The+Selected+Prose+of+Fernando+-+Fernando+Pessoa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"967ede8de84af997512b253517fa139bbc21905f","infoHashBuffer":{"type":"Buffer","data":[150,126,222,141,232,74,249,151,81,43,37,53,23,250,19,155,188,33,144,95]},"announce":[],"urlList":[]}}