{"title":"Rhythm Machine - Rhythm Machine (320kbps)","uid":4353556,"size":103592779,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:969fd0eb55fa47c28021dd5c631bfd97ab3c3ab7&amp;dn=Rhythm+Machine+-+Rhythm+Machine+%28320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dankencity","files":9,"time":1219295354,"description":"Rhythm Machine - Rhythm Machine (320kbps)\n\n1\t You Got Action, You Got Me\t 5:18\n2\t Lil&amp;#039;s Place\t 3:20\n3\t Put a Smile on Time 3:54\n4\t Thought My Love Was Fine 9:09\n5\t Brenda and Me 8:34\n6\t Everybody&amp;#039;s Chippin 4:16\n7\t You Make Me Feel Right, Think Right, Do Right 4:15\n8\t Can&amp;#039;t Do Without You\t3:45\n\n\nIndianapolis&amp;#039;s legendary Rhythm Machine is one of the rare funk bands who transitioned between eras of funk&amp;#039;s history seamlessly, creating awesome funk sides for a host of independent labels between the years of 1968 and 1976. Born out of cult Indy funk band The Highlighters&amp;#039; (of &quot;The Funky 16 Corners&quot; fame) ashes, the Rhythm Machine was founded in the early 70s by bass player James Boone and guitarist James Brantley. Determined to make a go of it as a show band, the two assembled another high-energy group of musicians and cut their first 7&quot; single for the small Rodan imprint in 1972. The funk cut on this single, &quot;Freakish Love,&quot; came to prominence as a Keb Darge spin in the fledgling days of Deep Funk s (re)discovery in London&amp;#039;s early 90s club scene. It wasn&amp;#039;t long until Darge dug a little deeper to discover the Machine&amp;#039;s first 7&quot; cut for Indianapolis s Lulu label. &quot;The Kick,&quot; since reissued on Stones Throw&amp;#039;s Funky 16 Corners compilation, hinted at great things to come by the band, as it showcased their polished Kool and The Gang influenced brass attack on the funk form. In the late 90s, a time when most ardent Deep Funk fans barely crept beyond the early 70s golden age, Darge began championing an little heard cut from the Rhythm Machine s 1976 independently released, self titled LP, which he (lucky bastard) had found on 7 single. &quot;Put A Smile On Time,&quot; a sublime example of exquisite soul vocals mixed with the insistent rhythm of a top notch funk ensemble, stands as one of the stand outs on the Rhythm Machine s super rare LP, but is by no means it s only shining moment. &quot;Put A Smile On Time&quot;, alongside the Machine s lovely ballad &quot;Brenda and Me&quot; were recently reissued on a Soul Cal Records 12&quot; single, perfectly setting the stage for the reissue of the band s debut. Lost for thirty years, The Rhythm Machine is now legitimately reissued on CD and offers up excellent soul, haunting ballads and high-energy mid 70s funk in a tasty medley served best in its entirety.\n\n","torrent":{"xt":"urn:btih:969fd0eb55fa47c28021dd5c631bfd97ab3c3ab7","amp;dn":"Rhythm+Machine+-+Rhythm+Machine+%28320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"969fd0eb55fa47c28021dd5c631bfd97ab3c3ab7","infoHashBuffer":{"type":"Buffer","data":[150,159,208,235,85,250,71,194,128,33,221,92,99,27,253,151,171,60,58,183]},"announce":[],"urlList":[]}}