{"title":"3 Para - Afganistan 2006. This Is War - Patrick Bishop","uid":13503516,"size":5628897,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9727680b6f96c825b0aa04ee5fd6a63e3381770c&amp;dn=3+Para+-+Afganistan+2006.+This+Is+War+-+Patrick+Bishop&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1455229030,"description":"Afghanistan, Summer 2006. This is war.\r\n\r\nAfghanistan in the summer of 2006. In blazing heat in remote outposts the 3 Para battlegroup is pitted against a stubborn enemy who keep on coming. Until now, the full story of what happened there has not been told. This is it.\r\n\r\nIn April 2006, the elite 3 Para battlegroup was despatched to Helmand Province in southern Afghanistan. They were tasked with providing security to reconstruction efforts, a deployment it was hoped would pass off without a shot being fired. In fact, over the six months they were there, the 3 Para battle group saw near continuous combat – one gruelling battle after another – in what would become one of the most extraordinary campaigns ever fought by British troops.\r\n\r\nAround parched, dusty outposts reliant on a limited number of helicopters for food and ammunition resupply, troops were subjected to relentless Taliban attacks, as well as energy-sapping 50 degree heat and spartan conditions. At the end of the tour, the Taliban offensive aimed at driving the British and Afghan Government troops out of Helmand had been tactically defeated. But 3 Para paid a high price: fourteen soldiers and one interpreter were killed, and 46 wounded.\r\n\r\n‘3 Para’ will tell the stories of the men and women who took part in this extraordinary and largely unreported saga. Best-selling author Patrick Bishop has been given exclusive access to the soldiers whose tales of courage and endurance provide an unforgettable portrait of one of the world's finest and most fascinating fighting regiments, and a remarkable band of warriors. Their bravery was reflected in the array of gallantry medals that were bestowed on their return, including the Victoria Cross awarded to Corporal Bryan Budd and the George Cross won by Corporal Mark Wright, both of whom were killed winning their awards.\r\n\r\n3 Para’s saga of comradeship, courage and fortitude is set to become a classic","torrent":{"xt":"urn:btih:9727680b6f96c825b0aa04ee5fd6a63e3381770c","amp;dn":"3+Para+-+Afganistan+2006.+This+Is+War+-+Patrick+Bishop","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9727680b6f96c825b0aa04ee5fd6a63e3381770c","infoHashBuffer":{"type":"Buffer","data":[151,39,104,11,111,150,200,37,176,170,4,238,95,214,166,62,51,129,119,12]},"announce":[],"urlList":[]}}