{"title":"Ideal DVD Copy v4.1.2 + patch","uid":7424533,"size":5246695,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:97c3a4fc486e6b3b15c7f24233786e72aa742846&amp;dn=Ideal+DVD+Copy+v4.1.2+%2B+patch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mrriser007","files":-1,"time":1341765901,"description":"Ideal DVD Copy - this is a simple program that will help to make a copy of the DVD-ROM drive. With it you can make an exact copy of a disk, copy the selected chapters or movie in full, excluding trailers, subtitles, audio tracks and unnecessary. If the movie recorded on DVD-9 media, and you have only a normal DVD-5 The bar can make a copy without any quality loss, recording a movie on two discs, or encode it with the worst quality, putting on the DVD-5. If the drive can not copy because of the protection, Ideal DVD Copy can even make an attempt to circumvent it. The program supports modern types of protection CSS, Sony ARccOS, PuppetLock. Supported disc formats DVD-R, DVD-RW, DVD + R, DVD + RW, DVD + R DL, DVD-R DL.\n\nKey features:\nRemove all copy restrictions of DVD - Automatically make region free, remove UOPs and all DVD copy protections (CSS, Sony ARccOS, PuppetLock, etc.). Constantly updating program to overcome any new copy protections. Enable internet service, which can automatically download decryption file from our server to user's local computer for copying the new protected dvds.\nTrue 1:1 DVD Copy without losing any quality - Copy entire DVD to 4.7GB disc or 8.5 GB dual layer disc with 1:1 mode. The copied DVD is completely the same as the original DVD you bought.\nCopy DVD-9 movie to a 4.7GB disc - Shrink DVD-9 movie to fit on a 4.7GB disc in near perfect quality. Save your money to purchase expensive dual layer discs.\nCopy main movie only - Remove menus, trailers, unwanted audios and subtitles.\nCopy episodic DVD and TV Show - You may choose any or multiple episodes you wanted from a TV Show DVD or episodic DVD to copy with &quot;Selected episodes&quot; dvd copy mode.\nCopy DVD-9 movie to two 4.7GB discs - Split a DVD-9 movie to two 4.7GB discs without losing any quality. Save your expensive dual layer discs and keep the original DVD quality.\nCopy DVD movie to hard drive - Store your favorite DVDs to computer hard drive, so that you can enjoy DVD from your computer hard drive without original DVD. If there's a need, you also can burn the copied dvd to blank DVD disc later.\nCopy DVD to ISO file - Copy DVD to your hard disk with only one. Iso file, needn't puzzled about the. Ifo,. Bup and. Vob files. But you need virtual drive tool to playback the iso file.\nBurn DVD from hard drive to blank DVD - Save space of your computer.\nFast dvd copying speed - Copy a DVD within 20-40 minutes, depending on your system performance.\nVery easy to use - Simple user interface, backup your DVD just by one click.\nHigh Compatibility - Support almost all DVD Writers and blank discs (DVD-R, DVD-RW, DVD + R, DVD + RW, DVD + R DL, DVD-R DL). The copied DVD can be played back on stand-alone dvd player or computer DVD players.\n","torrent":{"xt":"urn:btih:97c3a4fc486e6b3b15c7f24233786e72aa742846","amp;dn":"Ideal+DVD+Copy+v4.1.2+%2B+patch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97c3a4fc486e6b3b15c7f24233786e72aa742846","infoHashBuffer":{"type":"Buffer","data":[151,195,164,252,72,110,107,59,21,199,242,66,51,120,110,114,170,116,40,70]},"announce":[],"urlList":[]}}