{"title":"Bruce Springsteen - I'm On Fire","uid":4728088,"size":119949316,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:97dd6dce56578e33471627f623d86abf57a400a4&amp;dn=Bruce+Springsteen+-+I%5C%27m+On+Fire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1234853987,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;I'm on Fire&quot; is a song written and performed by American rock singer Bruce Springsteen. In 1985 it became the fourth single released from his massively successful album Born in the U.S.A..\n\nThe music video for the song was shot in March 1985 in Los Angeles, and was directed by filmmaker John Sayles. Unlike the previous videos from the album, this video was not a performance clip but rather portrayed a dramatic storyline that alluded to some of the song's emotions. In it, Springsteen plays a working class automobile mechanic with an attractive, married, very well-to-do, mostly unseen female customer who brings her vintage Ford Thunderbird in for frequent servicing, always requesting that he does the work. She gives him all her keys, not just the ones for the car. Later that night, he drives the T-Bird up to her mansion high in the hills above the city. He is about to ring the bell, when he thinks better of it, smiles wistfully, drops her keys in the mailbox next to the door and walks away down towards the lights below.\n\nThe video began airing in mid-April, received extensive MTV airplay, and later in the year won the MTV Video Music Award for Best Male Video.\n\nThe song peaked at #6 on the Billboard Hot 100 pop singles charts in early 1985. It was the fourth of a record-tying seven Top 10 hit singles to be released from Born in the U.S.A. It's also very remarkable that the single reached #1 in Netherlands for 3 weeks in August 1985, at the same time other 2 Springsteen singles (&quot;Dancing in the Dark&quot; and &quot;Born in the U.S.A.&quot;) were occuping the Top 12.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:97dd6dce56578e33471627f623d86abf57a400a4","amp;dn":"Bruce+Springsteen+-+I%5C%27m+On+Fire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97dd6dce56578e33471627f623d86abf57a400a4","infoHashBuffer":{"type":"Buffer","data":[151,221,109,206,86,87,142,51,71,22,39,246,35,216,106,191,87,164,0,164]},"announce":[],"urlList":[]}}