{"title":"HandsonHardcore - Christen Courtney and Alexis Brill (From Gym T","uid":12799772,"size":235422147,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:987fa8e020aaf816e8517f145aed1d4c033de54a&amp;dn=HandsonHardcore+-+Christen+Courtney+and+Alexis+Brill+%28From+Gym+T&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1448033187,"description":"Working out, being at the gym, lifting weights. If you look at our two hot babes from DDF Networkâ™s brand new episode of Hands on Hardcore, you know exactly, what their favorite hobbies are. We are right there with our DSLR cameras to deliver Full HD XXX porn scenes of Alexis Brill and her blonde friend Christen Courtney aka Christen from Hungary. The two athletic bombshells look amazing in their skintight gym outfits. When Leny Ewill walks in and starts working out too, the two horny chicks distract him by showing off their naked titties and give each other some nipple licking. He joins the party and makes it a threesome because lifting weights and fucking pussies is also his favorite thing to do!The two stunning hot babes give him a blowjob one after the other, enjoy licking his balls and rub their eager tongues along his shaft all the way up to his helmet. Alexis inserts his rod deep into her wet shaved pussy and while he bangs Christen, she keeps licking her ass while he plays with her tits. Later they invite him over from the gym to their bed and the threesome fucking scene heats up when the bro fucks Christen in her tight pink asshole. After further pussy licking and ass fucking, he blows his cum in her mouth and the two voluptuous European teenagers end the hardcore scene with a nice cum swap!\r\nTags: Threesome, Anal, Cum in mouth, Deep throat, FFM, Gym, Hardcore, Ball licking\r\n \nhttp://imgdone.com/viewer.php?file=45225640356398547522.jpg\r\n \nhttp://imgdone.com/viewer.php?file=88240687015477913155.jpg","torrent":{"xt":"urn:btih:987fa8e020aaf816e8517f145aed1d4c033de54a","amp;dn":"HandsonHardcore+-+Christen+Courtney+and+Alexis+Brill+%28From+Gym+T","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"987fa8e020aaf816e8517f145aed1d4c033de54a","infoHashBuffer":{"type":"Buffer","data":[152,127,168,224,32,170,248,22,232,81,127,20,90,237,29,76,3,61,229,74]},"announce":[],"urlList":[]}}