{"title":"Grant Green - His Majesty King Funk + The Latin Bit@320","uid":4111384,"size":231765475,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9aee1419dafe35c8ed1f6b442bd08a2ade50b5b6&amp;dn=Grant+Green+-+His+Majesty+King+Funk+%2B+The+Latin+Bit%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alekow1","files":21,"time":1207077305,"description":"1. Grant Green - His Majesty King Funk (1965)\n\n\nDon&amp;#039;t be scared off by the His Majesty King Funk title; this is not Green&amp;#039;s later commercial stuff. This is excellent Grant Green with Larry Young on organ, Harold Vick on sax, Ben Dixon on drums, and Candido Camero on conga -- essentially a classic four-piece. And this is soul-jazz with a deep groove. His Majesty King Funk is the last of five albums Green recorded with Young. Produced by Creed Taylor, it is the only album Green did for Verve and perhaps his last real jazz album before several years of inactivity, after which he became somewhat more commercial in his approach. The album includes the standard &quot;That Lucky Old Sun (Just Rolls Around Heaven All Day).&quot;\n\n\n01. The Selma March                                                                                                     \n02. Willow Weep For Me                                                                                                  \n03. The Cantaloupe Woman                                                                                                \n04. That Lucky Old Sun (Just Rolls Around Heaven All Day)                                                               \n05. Daddy Grapes\n\n\nPersonnel: Grant Green (guitar); Harold Vick (tenor saxophone, flute); Larry Young (organ); Ben Dixon (drums); Candido Camero (bongos, congas).\n\nRecorded in New York, New York on May 26, 1965. \nOriginally released on Verve (8627).\nLabel Verve\nOrig Year 1965\n\n\n\n\n\n2. Grant Green - The Latin Bit (1962)\n\n\nGrant Green, being known mainly as a soul-jazz guitarist, eventually gravitated into the popular boogaloo sound, a derivation of Latin music. The Latin Bit is the natural bridge to that next phase, though a bit premature for most in 1961-1963, even relative to the subsequent bossa nova craze. Pianist Johnny Acea, long an underrated jazzman, is the nucleus of this session, grounding it with witty chops, chordal comping, and rhythmic meat. The Latino rhythm section of drummer Willie Bobo and conga player Carlos &quot;Patato&quot; Valdes personify authentic, seasoned spice, while at times the chekere sound of Garvin Masseaux makes the soup too thick. At its collective best, the group presents a steady, serene, and steamy &quot;Besame Mucho&quot; and the patient, slow, slinky, sultry &quot;Tico Tico.&quot; Just a small step below is a classy take on Charlie Parker&amp;#039;s &quot;My Little Suede Shoes,&quot; a premier jazz bebop (emphasis) tune with a Latin undertow and Green&amp;#039;s tiniest staccato phrases, slightly marred by the overbearing constant chekere, but still classic. &quot;Mambo Inn&quot; is played inaccurately, but forgivable. &quot;Mama Inez&quot; ranks high for its calypso-infused happy feeling and wry stop-start lines. The straight-ahead hard bopper &quot;Brazil&quot; and lone soul-jazz tune, &quot;Blues for Juanita,&quot; display the single-note acumen that made Green&amp;#039;s style instantly recognizable. Tacked on the end are two selections with pianist Sonny Clark and tenor saxophonist Ike Quebec. While Clark is not known for Latin or soul-jazz, he&amp;#039;s quite good, while Quebec, who emphasized Brazilian rhythms in the last years of his life, plays hip secondary harmonies on the bossa nova-flavored &quot;Granada,&quot; but is in the complete background and a non-factor on the pop tune &quot;Hey There.&quot; This CD always yielded mixed results for staunch fans of Green, but a revisit shows it to be a credible effort, even if slightly flawed in part.\n\n\n01. Mambo Inn \n02. Besame Mucho \n03. Mama Inez \n04. Brazil \n05. Tico Tico \n06. My Little Suede Shoes \n07. Blues For Juanita - (bonus track) \n08. Grenada - (bonus track) \n09. Hey There - (bonus track)\n\n\n\nPersonnel: Grant Green (guitar); Ike Quebec (tenor saxophone); Johnny Acea (piano); Wendall Marshall (bass); Willie Bobo (drums); Carlos &quot;Potato&quot; Valdez (congas); Carvin Masseaux (chekere).\n\nProducer: Alfred Lion.\nReissue producer: Michael Cuscuna.\nRecorded at the Van Gelder Studio, Englewood Cliffs, New Jersey on April 26 and September 8, 1962. \nDigitally remastered by Ron McMaster.\nLabel Blue Note Records (USA) \nOrig Year 1962\n\n\n\nBITRATE: 320\n\nMy cd-rips (EAC and Lame)\nCovers Included\n\n\n\nEnjoy,Seed and Share\t\n","torrent":{"xt":"urn:btih:9aee1419dafe35c8ed1f6b442bd08a2ade50b5b6","amp;dn":"Grant+Green+-+His+Majesty+King+Funk+%2B+The+Latin+Bit%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9aee1419dafe35c8ed1f6b442bd08a2ade50b5b6","infoHashBuffer":{"type":"Buffer","data":[154,238,20,25,218,254,53,200,237,31,107,68,43,208,138,42,222,80,181,182]},"announce":[],"urlList":[]}}