{"title":"The Moon Sisters by Therese Walsh","uid":9754907,"size":1828422,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ca0b0685202e0e5542e7a634e3514e2704ce634&amp;dn=The+Moon+Sisters+by+Therese+Walsh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"PirateBook","files":2,"time":1394670130,"description":"\nA beautiful coming-of-age novel about two sisters on a journey to forgive their troubled mother, with a sheen of almost-magical realism that overlays a story about the love of a family, and especially between sisters.\n\nTherese Walsh's poignant and mesmerizing novel is a moving tale of family, love, and the power of stories. After their mother's probable suicide, sisters Olivia and Jazz are figuring out how to move on with their lives. Jazz, logical and forward-thinking, decides to get a new job, but spirited, strong-willed Olivia, who can see sounds, taste words, and smell sights, is determined to travel to the remote setting of their mother's unfinished novel to say her final goodbyes and lay their mother's spirit to rest.\n\nThough they see things very differently, Jazz is forced by her sense of duty to help Olivia reach her goal. Bitter and frustrated by the attention heaped on her sunny sister whose world is so unique, Jazz is even more upset when they run into trouble along the way and Olivia latches to a worldly train-hopper. \n\nThough Hobbs warns Olivia that he's a thief who shouldn't be trusted, he agrees to help with their journey. As they near their destination, the tension builds between the two sisters, each hiding something from the other, and they will finally be forced to face everything between them and decide what is really important.\n\nGenre: General Fiction/Classics","torrent":{"xt":"urn:btih:9ca0b0685202e0e5542e7a634e3514e2704ce634","amp;dn":"The+Moon+Sisters+by+Therese+Walsh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ca0b0685202e0e5542e7a634e3514e2704ce634","infoHashBuffer":{"type":"Buffer","data":[156,160,176,104,82,2,224,229,84,46,122,99,78,53,20,226,112,76,230,52]},"announce":[],"urlList":[]}}