{"title":"Wookiefoot Discography","uid":4522777,"size":355755546,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9d3bcd2470fb8ee91d1f5db54ec239ab4efcd159&amp;dn=Wookiefoot+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"enigs","files":87,"time":1227228318,"description":"The Entire Wookiefoot Discography\n\nMP3 192 kps, proper ID3 tags\n &lt;a href=&quot;\nhttp://www.wookiefoot.com/products.cfm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.wookiefoot.com/products.cfm&lt;/a&gt;\n\nMAKE BELIEF\n\nThe Bri Bri tribe has an analogy: &quot;If a frog is thrown into a pot of boiling water he will jump out! But if he is first placed in water of comfort then bought to a boil he will be cooked slowly!&quot; Feel&amp;#039;n the heat we opted for escape, we &amp;#039;unplugged&amp;#039; and moved onto a sailboat for independence. It wasn&amp;#039;t until leaving the country that we realized exactly how lethal the water had become. We returned on a mission: Get the biggest, loudest microphone we could find and tell other &amp;#039;Frogs&amp;#039; what&amp;#039;s up!\n\nDOMESTICATED\n\nWe immersed ourselves deep in American culture, accumulating a combined 157 years learning the language and studying the moves. The results are a collection of scribblings on napkins, 5,000 incriminating polaroids, and an honest yearning for the answer to it all. Out of this swirling vortex sprung our first album, a case study in Domestication entitled &amp;#039;Nothing and the Monkey.&amp;#039;\n\nOUT OF THE JAR\n\nCosta Rica, Rumi, surfing, travel, struggle, community, political insanity...its all in there. We&amp;#039;re very proud of this record and we hope that everyone enjoys it. Thanks. \n\nACTIVATE!\n\n... this concept CD has been in over three years of of development, discussion, elaboration, and collaboration. It continues the Monkey&amp;#039;s story from DOMESTICATED (our first release), taking him through adventures in the after life and includes a 20 page story book as the insert of the CD. We really hope you enjoy it. Please... when you first listen to this... take some time, get relaxed, run a warm bath, lie down on your favorite couch, or whatever you need to do to get into your happy place, get a GOOD set of headphones or a good stereo, and soak in the whole of it. Think of it as watching a movie instead of just having on background music. We spend a lot of time producing all of the subtleties and sonic layers and would love to know that you experience them too!\n\n------\n\nWookiefoot.  One of the best bands ever.\n\nIf you enjoy their music, PLEASE support them and buy a CD.  They&amp;#039;re one of the few bands I&amp;#039;ll actually spend money on these days.","torrent":{"xt":"urn:btih:9d3bcd2470fb8ee91d1f5db54ec239ab4efcd159","amp;dn":"Wookiefoot+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d3bcd2470fb8ee91d1f5db54ec239ab4efcd159","infoHashBuffer":{"type":"Buffer","data":[157,59,205,36,112,251,142,233,29,31,93,181,78,194,57,171,78,252,209,89]},"announce":[],"urlList":[]}}