{"title":"Gary Lewis &amp; The Playboys - This Diamond Ring [1965].mpg","uid":5231892,"size":39798788,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9de11dec35cd8c8f1ce53fb72c801b1405826902&amp;dn=Gary+Lewis+%26+The+Playboys+-+This+Diamond+Ring+%5B1965%5D.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"claudeq","files":1,"time":1261360992,"description":"&quot;This Diamond Ring&quot; is a 1965 pop song written by Al Kooper, Bob Brass and Irwin Levine. The song's first appearance on the Billboard Hot 100 chart was a bubbling-under single by Sammy Ambrose that reached #117 on January 9, 1965. The hit record, which went to number one on the Billboard chart, is attributed to Gary Lewis &amp; the Playboys though none of the Playboys played their instruments on the recording and Lewis' vocals were heavily supported by Ron Hicklin's overdubs. The session drummer was Hal Blaine,[3] Carol Kaye played bass and Leon Russell both played keyboards and assisted with production. The song was carried through Snuff Garrett Records.\n\nStylistically, the song's recording features the then common &quot;basic 'combo' instrumentation...(electric guitar, organ, bass, drums), modal (dorian) inflections in the harmony and melody of the verse and a basic rock beat pattern.&quot; Unusually the chorus features timpani and the transition between verse and chorus creates a daring modulation from C minor (dorian) to G-flat major.\n\n&quot;The musical style&quot;, writes Brackett, &quot;skims aspects from contemporary rock songs, and is then produced and arranged from the vantage point of 'easy-listening' music.&quot; The song's harmonic progression resembles those of Beatles songs such as the G-flat/F/E-flat/D-flat descending bass line (&quot;Bad to Me&quot;) and the vi-iii movement (&quot;Please Please me&quot;, &quot;I Want to Hold Your Hand&quot;, &quot;She Loves You&quot;, &quot;And I Love Her&quot; and others). The melodic turn on &quot;true&quot; of &quot;if you find someone whose heart is true&quot; resembles those in &quot;Please Please Me&quot; (&quot;Last night I said these words to my girl&quot;) and &quot;Do You Want to Know a Secret&quot; (&quot;nobody knows, just we two&quot;).\n\nAl Kooper has reportedly stated many times that he was unhappy with the record and had originally hoped the song would be recorded by a group like The Drifters based upon the original demo of the song as recorded by Jimmy Radcliffe, although it has been his biggest commercial success as a songwriter. Kooper would later re-visit the song, recording a funky version for his 1976 album &quot;Act Like Nothing's Wrong&quot;.\n \n\n\nTaken from Jukebox Saturday Night show with Gary Lewis being the son of Jerry Lewis","torrent":{"xt":"urn:btih:9de11dec35cd8c8f1ce53fb72c801b1405826902","amp;dn":"Gary+Lewis+%26+The+Playboys+-+This+Diamond+Ring+%5B1965%5D.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9de11dec35cd8c8f1ce53fb72c801b1405826902","infoHashBuffer":{"type":"Buffer","data":[157,225,29,236,53,205,140,143,28,229,63,183,44,128,27,20,5,130,105,2]},"announce":[],"urlList":[]}}