{"title":"Disraeli - A+E Network 1978 DVDRip_JediMaster Disk 2.mp4","uid":8646422,"size":785085417,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9e072492556d12afa990300bcf07262f272cc4ad&amp;dn=Disraeli+-+A%2BE+Network+1978+DVDRip_JediMaster+Disk+2.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nhughes5","files":1,"time":1372995175,"description":"Golden-Globe winner Ian McShane (Deadwood, Sexy Beast) gives an acclaimed performance as the color and flamboyant politician Benjamin Disraeli. Heading a powerful British ensemble cast, McShane captures the charm, determination, and political brilliance that won Disraeli the favor of Queen Victoria and eventually the nation. Beautifully shot on location, and spanning five decades this multiple-Emmyr nominated, original miniseries and is an engrossing portrait of one of Britain's most controversial leaders.\n\nAnglophiles will find much to admire in the 1978 production Disraeli, a comprehensive look at the political and personal lives of one of that nation's most important historical figures. Benjamin Disraeli (1804-1881), played by Ian McShane (Deadwood, The Golden Compass) in a bravura performance, was &quot;an enigma even to myself,&quot; as he puts it. Born to Jewish parents but baptized into the Anglican Church as a boy, he had already established a reputation as an author of &quot;scandalous&quot; novels, not to mention a silver-tongued flatterer and ladies man, when he began pursuing his political ambitions in his early thirties.","torrent":{"xt":"urn:btih:9e072492556d12afa990300bcf07262f272cc4ad","amp;dn":"Disraeli+-+A%2BE+Network+1978+DVDRip_JediMaster+Disk+2.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e072492556d12afa990300bcf07262f272cc4ad","infoHashBuffer":{"type":"Buffer","data":[158,7,36,146,85,109,18,175,169,144,48,11,207,7,38,47,39,44,196,173]},"announce":[],"urlList":[]}}