{"title":"Fallen Enchantress [Skidrow]","uid":7754776,"size":3754891336,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9e30c62cebecd3b36dbd33df678af976a1ba4049&amp;dn=Fallen+Enchantress+%5BSkidrow%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"SSJASON","files":2,"time":1351064717,"description":"S K I D R O W\n.the leading force.\n\nproudly presents\nFallen Enchantress (c) Stardock Entertainment\n\n23-10-2012......Release Date &lt;-&gt; Protection..........Stardock DRM\nStrategy...........Game Type &lt;-&gt; Disk(s)....................1 DVD\n\nRELEASE NOTES\n\nA World to Build or Destroy\n\n&quot;A war is coming&quot; a war between East and West - between Kingdoms and\nEmpires, between man and Fallen. A future of blood and death, of chaos\nand destruction. the Oracle Ceresa\n\nDesign your sovereign with unique talents and weapons for the trials\nahead. Learn powerful spells to enchant units, summon elementals, or\ndestroy those who oppose you. Found cities and research technologies to\nexpand your influence. Send your champions on quests to recover ancient\nartifacts, gain allies, or obtain the great wealth lost during the\nCataclysm.\n\nThe land is not simply waiting to be claimed; it must be conquered.\nDarkling camps, ogre lairs and caves waiting to be explored dot the\nlandscape. In remote corners of the world, tireless butchermen, fell\ndemons and legendary locations are waiting to be found. Explore Varda,\na pre-Cataclysm city defended by golems that have turned on the\ncitizens and made the city into a prison. Defeat Sarog to claim the\nTemple of the Dragon and recruit Ashwake Dragons to your cause. Claim\nthe Flooded Graveyard or the Pit of Sarpah to harness the powerful\nmagical energy of those locations.\n\nFeatures:\n\nRecruit Champions - Equip them with rare magical items that you create\nor discover. Customize your champion's special abilities and traits as\nthey gain levels.\n\nFight in tactical battles - Battle enemy armies or the wild creatures\nof the world. Command your armies directly and choose between the\nspecial attacks and spells your units have learned.\n\nDesign your units - Customize their armor and weapons. Equip units\nwith mounts to quickly close on enemy units. Train them with\nspecialized traits like Discipline and Ignore Pain.\n\nLiberate or Enslave - Transform Elemental into a noble kingdom, or an\nempire where citizens are fuel for your spells. Build studies and\nworkshops to make your citizens more productive, or gallows and\nsacrificial altars to keep your citizens motivated.\n\nExplore Wildland Areas - Be cautious when entering these areas; they\noffer their own rewards and treasures, but you will need high-level\nchampions, advanced armies and powerful spells to survive.\n\nBuild your own world - Use the included modding tools to create new\nimprovements, locations, quests or factions. Design new spells in the\nParticle Cauldron and entire worlds with the Cartographe's Table.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy!\n\nGREETINGS\n\nTo all friends of the family and honorable rival groups!","torrent":{"xt":"urn:btih:9e30c62cebecd3b36dbd33df678af976a1ba4049","amp;dn":"Fallen+Enchantress+%5BSkidrow%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e30c62cebecd3b36dbd33df678af976a1ba4049","infoHashBuffer":{"type":"Buffer","data":[158,48,198,44,235,236,211,179,109,189,51,223,103,138,249,118,161,186,64,73]},"announce":[],"urlList":[]}}