{"title":"Mrs. Brown's Boys + BONUS EXTRAS","uid":13496596,"size":7723116341,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9e44927d32c7fa76a2647b8f5ceed9805bd8c54e&amp;dn=Mrs.+Brown%27s+Boys+%2B+BONUS+EXTRAS&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7436746","files":28,"time":1455158792,"description":"Series 1, 2 and 3\r\n*All Christmas and New Year's Specials are labelled as series/season episodes according to IMDB.\r\n\r\nIncludes BONUS EXTRAS:\r\nMrs. Brown Rides Again (2013)\r\nMrs. Brown's Boys Live - How Now Brown Cow\r\nWho Do You Think You Are? - Brendan O'Carroll\r\n\r\n \nhttp://www.imdb.com/title/tt1819022/\r\n\r\nA comedy centered on a loud-mouthed Irish matriarch whose favorite pastime is meddling in the lives of her six children.\r\n \nhttp://www.wikiwand.com/en/Mrs._Brown%27s_Boys\r\n\r\nMrs. Brown's Boys is a television sitcom created by and starring Irish writer and performer Brendan O'Carroll and produced in the United Kingdom by BBC Scotland in partnership with BocPix and RTÉ. O'Carroll himself plays his drag persona, Agnes Brown, with several close friends and family members making up the rest of the cast. The show adopts an informal production style where production mistakes and tomfoolery, mostly instigated by O'Carroll, are edited into each episode. Despite being lambasted by critics, the show has become a ratings success in both Ireland, where it is set, and the United Kingdom, where it is recorded. It is also gaining increasingly higher ratings in Australia and Canada. The show has won numerous awards.\r\n\r\nMrs. Brown's Boys was developed from O'Carroll's works going back to the early 1990s. The character, Agnes Browne, appeared in stage plays, radio plays, books and straight-to-DVD films. For the sitcom, Agnes' surname was shortened from Browne to Brown. The stage shows have continued, and during February and March 2014, it toured around Australia. A feature film, Mrs. Brown's Boys D'Movie, was released on 27 June 2014","torrent":{"xt":"urn:btih:9e44927d32c7fa76a2647b8f5ceed9805bd8c54e","amp;dn":"Mrs.+Brown%27s+Boys+%2B+BONUS+EXTRAS","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e44927d32c7fa76a2647b8f5ceed9805bd8c54e","infoHashBuffer":{"type":"Buffer","data":[158,68,146,125,50,199,250,118,162,100,123,143,92,238,217,128,91,216,197,78]},"announce":[],"urlList":[]}}