{"title":"Takedowns and Falls.mp4","uid":9416218,"size":845733589,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9f34fffd8de694c52813feb671e81191858fc519&amp;dn=Takedowns+and+Falls.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bulgewa","files":-1,"time":1388449602,"description":"Takedowns and Falls (2010)\n\nTrailer:   \nKind:       MPEG-4\nSize:       845MB\nVideo Size: 711X400\n\n\n\n\nPlot Summary\n\n     Every autumn thousands of wrestlers throughout Pennsylvania begin their seasons with the dream of making it to the PIAA State Championships. Few ever make it and even less win. But, for all who try, the journey to obtain the most elusive titles in high school wrestling is one of dedication, pain, sacrifice, failure and triumph.\n\n     Takedowns and Falls is a documentary film that tells the story of a group of Pennsylvania teens and their relationships within a high school wrestling team on a journey to attain a state championship.Â  It chroniclesÂ  a season of the Central Dauphin Rams in Harrisburg, PA and highlights the sacrifice of its athletes, the commitment of their families and the dedication of its coaches.Â  Inspired by their love of the sport and their coaches, this group of teens grows up before our eyes, in an attempt to over achieve and do the impossible.Â  Takedowns and Falls explores themes of humility, family, friendship and teamwork via individual and team efforts to win a state title.Â  The film transcends the sport and becomes a story about people over coming odds, and appeals to a wide audience. Takedowns and Falls is Spellbound meetsFriday Night Lights for high school wrestling, taking place in the U.S. Mecca for the sport.\n\n     It is a story, and film, that captures life-lessons that all people can share and learn from.Â  Audiences will witness the characters go about their days, their lives captured and portrayed honestly, on and off the mat, and finding the parallels between the two.\n\n     The film shows the the dedication to practice, conditioning and diet that wrestling demands and how this commitment to the sport plays itself out in both winning and losing.Â  The athletes, coaches, and parents, learn and mature from both failure and triumph.\n","torrent":{"xt":"urn:btih:9f34fffd8de694c52813feb671e81191858fc519","amp;dn":"Takedowns+and+Falls.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f34fffd8de694c52813feb671e81191858fc519","infoHashBuffer":{"type":"Buffer","data":[159,52,255,253,141,230,148,197,40,19,254,182,113,232,17,145,133,143,197,25]},"announce":[],"urlList":[]}}