{"title":"The Hidden Genocide  2012 12 09   AlJazerra","uid":7919634,"size":158715060,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9f4074c70949824826118ad9538dad90e63422ac&amp;dn=The+Hidden+Genocide++2012+12+09+++AlJazerra+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shunster","files":1,"time":1355445856,"description":"The Hidden Genocide  2012 12 09   AlJazerra \n\n151mb/50mn/mp4\n\n\nThis is the story of a people fleeing the land where they were born - the Muslim Rohingya of Myanmar.\n\nEarlier this year a Buddhist woman was raped and murdered in western Myanmar. The authorities charged three Muslim men.\n\nA week later, 10 Muslims were murdered in a revenge attack. What happened next was hidden from the outside world.\n \nBloodshed pitted Buddhists against minority Rohingya Muslims. Many Rohingya fled their homes, which were burned down in what they said was a deliberate attempt by the predominantly Buddhist government to drive them out of the country.\n\n&quot;They were shooting and we were also fighting. The fields were filled with bodies and soaked with blood,&quot; says Mohammed Islam, who fled with his family to Bangladesh.\n\nThere are 400,000 Rohingya languishing in Bangladesh. For more than three decades, waves of refugees have fled Myanmar. But the government of Bangladesh considers the Rohingya to be illegal immigrants, as does the government of Myanmar. They have no legal rights and nowhere to go.\n \nThis is a story of a people fleeing the land where they were born, of a people deprived of citizenship in their homeland. It is the story of the Rohingya of western Myanmar, whose very existence as a people is denied.\n\nProfessor William Schabas, the former president of the International Association of Genocide Scholars, says: &quot;When you see measures preventing births, trying to deny the identity of the people,... that they no longer exist; denying their history, denying the legitimacy of their right to live where they live, these are all warning signs that mean it's not frivolous to envisage the use of the term genocide.&quot;\n\n\nFLV:http://www.aljazeera.com/programmes/aljazeerainvestigates/2012/12/2012125122215836351.html\n\nshunster","torrent":{"xt":"urn:btih:9f4074c70949824826118ad9538dad90e63422ac","amp;dn":"The+Hidden+Genocide++2012+12+09+++AlJazerra+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f4074c70949824826118ad9538dad90e63422ac","infoHashBuffer":{"type":"Buffer","data":[159,64,116,199,9,73,130,72,38,17,138,217,83,141,173,144,230,52,34,172]},"announce":[],"urlList":[]}}