{"title":"Dead Can Dance - The Serpent's Egg (1988) 2008 MFSL-SACD-DFF","uid":11121687,"size":1532438724,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9fe76c3227dbd26e1cc4aa6d5af380cdc4e12d3b&amp;dn=Dead+Can+Dance+-+The+Serpent%27s+Egg+%281988%29+2008+MFSL-SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hal4000","files":-1,"time":1411921906,"description":"Dead Can Dance is an English-Australian musical project that formed in 1981 in Melbourne by Lisa Gerrard and Brendan Perry. The band relocated to London, England, in May 1982. Australian music historian Ian McFarlane described Dead Can Dance's style as &quot;constructed soundscapes of mesmerising grandeur and solemn beauty; African polyrhythms, Gaelic folk, Gregorian chant, Middle Eastern mantras and art rock.&quot;\n\nPerry and Gerrard continued to experiment and improve with The Serpent's Egg, as much a leap forward as Spleen and Ideal was some years previously. As with that album, The Serpent's Egg was heralded by an astounding first track, &quot;The Host of Seraphim.&quot; Its use in films some years later was no surprise in the slightest -- one can imagine the potential range of epic images the song could call up -- but on its own it's so jaw-droppingly good that almost the only reaction is sheer awe. Beginning with a soft organ drone and buried, echoed percussion, Gerrard then takes flight with a seemingly wordless invocation of power and worship -- her vocal control and multi-octave range, especially towards the end, has to be heard to be believed. Nothing else achieves such heights, but everything gets pretty darn close, a deserved testament to the band's conceptual reach and abilities. Slow plainsong chants such as &quot;Orbis De Ignis&quot; mix with the harpischord and overlaid vocals of &quot;The Writing on My Father's Hand&quot; and the slow build and sweep of &quot;In the Kingdom of the Blind the One-Eyed Are Kings.&quot; Two of Perry's finest vocal moments occur here. The first, &quot;Severance,&quot; is a slow, organ/keyboard led number that showcases his rich, warm vocals exquisitely -- it's no wonder that Bauhaus chose to cover it some years later on its reunion tour. &quot;Ullyses,&quot; the album's closing track, makes for a fine ending as much as &quot;The Host of Seraphim&quot; did an opening, Perry's delivery almost like a reading from a holy book, the arrangement of strings and percussion rhythmic, addictive and lovely.\n\nDFF files extracted with Scarletbook\n   &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&lt;/a&gt;\n\nfrom the 2008 Mobile Fidelity Sound Lab SACD.\n\nSACD-ISO-DFF-1Bit-2.8Mhz.\n\n","torrent":{"xt":"urn:btih:9fe76c3227dbd26e1cc4aa6d5af380cdc4e12d3b","amp;dn":"Dead+Can+Dance+-+The+Serpent%27s+Egg+%281988%29+2008+MFSL-SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fe76c3227dbd26e1cc4aa6d5af380cdc4e12d3b","infoHashBuffer":{"type":"Buffer","data":[159,231,108,50,39,219,210,110,28,196,170,109,90,243,128,205,196,225,45,59]},"announce":[],"urlList":[]}}