{"title":"Marilyn Manson &amp; The Spooky Kids Phone Messages","uid":7164693,"size":75668049,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a0a170cb6ddb2575f2925bd029d435a9f1eee10f&amp;dn=Marilyn+Manson+%26amp%3B+The+Spooky+Kids+Phone+Messages&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":6,"time":1333734234,"description":"Spooky Kids Phone Messages\n\n1. Murder Your Marilyn\nThis track is 64 minutes long, and is a conversation between Manson and a phone psychic. The message is long and rambling\n\n2. Janet 974-7153\n\n3. Volcanic Eruptions\nThis is a conversation between Manson and a club promoter. This was also found on the 100 Minute Demo before Justify My Love\n\n4. Dennis 721-3383\n\n5. Helter Skelter \nthis is Marilyn Manson reading lines from Charles Manson. This is probably one of the messages you would have got if you called the hotline\n\n\n\nMini Cassette Recordings (7:26)\n\nThis is an interesting find. It appeared on a bootleg called the Lidsville Trailer Park Picnic along with several widely bootlegged Spooky Kids demos. It's a bunch of short segments recorded on a portable tape recorder as Manson wandered around town with some friends, reciting lyrics and poetry, and making observations. Manson's voice is easily distinguishable, but I'm not sure about the others. The one sounds a bit like Pogo and another might be Daisy, but it's hard to tell since they would have been much younger at the time this was recorded than compared to the later interviews I've heard them speak in. The tape also includes a complete reading of the &quot;club&quot; segement from Number Nine, and ends with a couple of short clips from unknown versions of Son Of Man and White Knuckles (probably from a rehearsal). The date is unknown, but I'd venture to guess that it's 1990 due to the bits of Son of Man and Number Nine. ","torrent":{"xt":"urn:btih:a0a170cb6ddb2575f2925bd029d435a9f1eee10f","amp;dn":"Marilyn+Manson+%26amp%3B+The+Spooky+Kids+Phone+Messages","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0a170cb6ddb2575f2925bd029d435a9f1eee10f","infoHashBuffer":{"type":"Buffer","data":[160,161,112,203,109,219,37,117,242,146,91,208,41,212,53,169,241,238,225,15]},"announce":[],"urlList":[]}}