{"title":"Philosophy &amp; Simulation: The Emergence Of Synthetic Reason ","uid":6540566,"size":2170827,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1320f7ea3db9bd90a611d59d4c8c3f628be2b69&amp;dn=Philosophy+%26+Simulation%3A+The+Emergence+Of+Synthetic+Reason+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"theLEAK","files":-1,"time":1310671848,"description":"In this groundbreaking new book, Manuel Delanda analyzes all the different genres of simulation (from cellular automata and genetic algorithms to neural nets and multi-agent systems) as a means to conceptualize the possibility spaces associated with causal (and other) capacities.\n\nSimulations allow us to stage actual interactions among a population of agents and to observe the emergent wholes that result from those interactions.\n\nSimulations have become as important as mathematical models in theoretical science. As computer power and memory have become cheaper they have migrated to the desktop, where they now play the role that small-scale experiments used to play.\n\nA philosophical examination of the epistemology of simulations is needed to cement this new role, underlining the consequences that simulations may have for materialist philosophy itself. This remarkably clear philosophical discussion of a rapidly growing field, from a thinker at the forefront of research at the interface of science and the humanities, is a must-read for anyone interested in the philosophy of technology and the philosophy of science at all levels.","torrent":{"xt":"urn:btih:a1320f7ea3db9bd90a611d59d4c8c3f628be2b69","amp;dn":"Philosophy+%26+Simulation%3A+The+Emergence+Of+Synthetic+Reason+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1320f7ea3db9bd90a611d59d4c8c3f628be2b69","infoHashBuffer":{"type":"Buffer","data":[161,50,15,126,163,219,155,217,10,97,29,89,212,200,195,246,40,190,43,105]},"announce":[],"urlList":[]}}