{"title":"Sabotage? - Jack T. Chick","uid":11773465,"size":4155196,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1f36336d50c4e3c8df688ea1ae4c585d08067ff&amp;dn=Sabotage%3F+-+Jack+T.+Chick&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427168866,"description":"\n\nFor thousands of years, Satan has tried to discredit God's Word. Bible schools are now teaching the Bible does not contain God's word. When the Crusaders help a former Bible student whose life had been shattered by this lie, they take him to meet a man who will introduce him to Bible History 101. See the struggle through the ages to keep God's Word pure, and learn through this magazine which Bible can be trusted...and why!\n\n\nAbout the author:\nJack Thomas Chick (born April 13, 1924) is an American publisher, writer, and comic book artist of evangelical fundamentalist Christian tracts and comic books. His comics have been described by Los Angeles magazine as &quot;equal parts hate literature and fire-and-brimstone sermonizing&quot;.\n\nChick's company, Chick Publications, claims to have sold over 750 million tracts, comics tracts and comic books, videos, books, and posters designed to promote Protestant evangelism from a Christian fundamentalist perspective or point of view. Many of these are controversial, as they accuse Roman Catholics, Freemasons, Muslims, and many other groups of murder and conspiracies, while Chick maintains his views are simply politically incorrect.\n\nChick's views have been spread worldwide, mostly through the tracts and now online. They have been translated into more than 100 languages. As evidenced from his writings and publications, Chick is an Independent Baptist who follows a premillennial dispensationalist view of the end times. He is a believer in the &quot;King James Only&quot; movement","torrent":{"xt":"urn:btih:a1f36336d50c4e3c8df688ea1ae4c585d08067ff","amp;dn":"Sabotage%3F+-+Jack+T.+Chick","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1f36336d50c4e3c8df688ea1ae4c585d08067ff","infoHashBuffer":{"type":"Buffer","data":[161,243,99,54,213,12,78,60,141,246,136,234,26,228,197,133,208,128,103,255]},"announce":[],"urlList":[]}}