{"title":"Uriah Heep...Wonderworld(1974)remastered(2004)[FLAC]","uid":5568789,"size":445297598,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a4ae38ecb9ba7831e14b470bb0de6209853a9928&amp;dn=Uriah+Heep...Wonderworld%281974%29remastered%282004%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":18,"time":1274079830,"description":"Wonderworld [Extra tracks][Original recording remastered][2004]\n\nGenre:\nRock\nStyle:\nHard Rock, Prog Rock\nYear:\n1974\nNotes:\nReleased in UK April 1974 on Bronze Records ILPS 9280. \nReleased in the USA May 1974 on Warner Brothers Records WBS 2800\n\n 1. Wonderworld 4:29  \n   2. Suicidal Man 3:37    \n   3. The Shadows And The Wind 4:28   \n   4. So Tired 3:38    \n   5. The Easy Road 2:42    \n   6. Something Or Nothing 2:54   \n   7. I Won't Mind 5:59    \n   8. We Got We 3:35   \n   9. Dreams 6:10    \n 10. What Can I Do 3:09    \n 11. Love, Hate And Fear 4:29    \n 12. Stone's Throw 5:36    \n 13. Dreams (Extended Version) 7:13    \n 14. I Won't Mind (Alternate Live Version) 5:35    \n 15. So Tired (Alternate Live Version) 3:29\n\nBass Guitar - Gary Thain \nDrums, Percussion, Vocals - Lee Kerslake \nEngineer - Hans Menzel , Macki\nGuitar [Guitars] - Mick Box \nKeyboards, Guitar [Guitars], Vocals - Ken Hensley \nProducer - Gerry Bron \nRecorded By - Peter Gallen \nVocals - David Byron \nWritten-By, Arranged By - Uriah Heep  \n\n  \n Uriah Heep - Wonderworld\n \n General Review\n Wonderworld was the seventh studio album and was recorded in Munich due to tax reasons. Being on the road a lot, it probably was not a very good choice. This was also the last album to feature Gary Thain whoi was replaced by John Wetton for the next album.\n\nThe album begins with the typical Hensley song we are used to be now. Keybords take the lead and the vocals provide the power and emotion. &quot;Wonderworld&quot; is a good typical organdriven medium-tempo Heep song.\n\n&quot;Suicidal Man&quot; saw the band for the first time in a long time collaberate as song-writers. The result is a very good hard-rocking song with a very good riff. To be honest this is one of Heep's best riffs ever recorded. This song lend itself to be a very good metal song.   I dont thjink that Byron at the time knew that this was more autobiographical than any other song. At this stage he was drinking a lot and on the selfdestructive path.\n\n&quot;The Shadows and the Wind&quot; starts of as a very mediocre song with a lot of musical cliches and then it goes over in a chorus with no words - just &quot;la la la&quot;. Buttttttt..... the way the vocals take a queenslike chorus make it very special. Still of you think about Motth The Hoople and Gentle Giant who has done these kind of vocals better at that stahge it is not very impressive.\n\n&quot;So Tired&quot; is one of the more well known Heep songs with a very upbeat tempo. The melody is better than &quot;Shadows&quot; but it is not one of ma favorites.\n\n&quot;The Easy Road&quot; - This is defnitely one of Uriah Heep's best melodic songs. Starting of with the strings and the piano and with the very good vocals, and the very good melody - it can't get better.\n\n&quot;Something or nothing&quot; - is actually a very better song than the way it aged. This is a typical mid-tempo rocker with a very catchy tune. I really love the riff on this one. Not very better prominent but very good.\n\n&quot;I Won't mind&quot; - has a very blues feel to it and the only good thing to this song is the guitars. Already on &quot;Very eavy and very umble&quot; they have shown the ability to do good blues goods songs. Very good guitars.\n\n&quot;We got we&quot; is again a very good guitar song. On this song they go back to &quot;Very eavy&quot; and &quot;Salisbury&quot; with the dual guitars. It is so good, it is a pity it is only 3.34 long or shall I say short.\n\n&quot;Dreams&quot; - I must admit by this time after listening to the last 3 albums, I was a bit tired (&quot;So Tired&quot;) of listening to Ken Hensley's lyrics about dreams. Almost all the love songs have the theme of dreams in them. But saying this, it is not a bad song. Again what I like most about this song - even though it is mostly keybord-driven - is the guitars.\n\n \n \n\nripped by dBpoweramp\n\nplease seed \n \n","torrent":{"xt":"urn:btih:a4ae38ecb9ba7831e14b470bb0de6209853a9928","amp;dn":"Uriah+Heep...Wonderworld%281974%29remastered%282004%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4ae38ecb9ba7831e14b470bb0de6209853a9928","infoHashBuffer":{"type":"Buffer","data":[164,174,56,236,185,186,120,49,225,75,71,11,176,222,98,9,133,58,153,40]},"announce":[],"urlList":[]}}