{"title":"Los misterios del suenyo.(Cap. 6).(Docu.Spanish).","uid":5730068,"size":768624640,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a52ac31060f72cdc597ca68b2a91fd5de40fd030&amp;dn=Los+misterios+del+suenyo.%28Cap.+6%29.%28Docu.Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cholo24","files":1,"time":1280603722,"description":"6. Con los ojos bien abiertos\n\nPosiblemente no somos conscientes de la importancia del sueÃƒÂ±o en nuestra vida cotidiana hasta que padecemos algÃƒÂºn trastorno que dificulta nuestro descanso nocturno o cuando nuestro ajetreado ritmo de vida interfiere en nuestras horas de sueÃƒÂ±o. Diversos y revolucionarios estudios estiman que la privaciÃƒÂ³n del sueÃƒÂ±o a la que estÃƒÂ¡ sometida gran parte de la poblaciÃƒÂ³n tiene efectos negativos en la economÃƒÂ­a, ademÃƒÂ¡s del alarmante coste humano y social que supone. La somnolencia es uno de los factores que estÃƒÂ¡ detrÃƒÂ¡s de multitud de accidentes laborales, de trÃƒÂ¡fico? Se le ha vinculado a enfermedades del corazÃƒÂ³n, depresiÃƒÂ³n, obesidad? Ã‚Â¿QuÃƒÂ© peligros se esconden tras los trastornos del sueÃƒÂ±o? Ã‚Â¿Podemos hacer algo para remediarlo? Ã‚Â¿Existe algÃƒÂºn tratamiento eficaz contra el insomnio? Este interesante documental que Odisea les presenta, nos muestra el retrato de una sociedad carente de sueÃƒÂ±o. Trabajar siete dÃƒÂ­as a la semana, estar localizados las 24 horas del dÃƒÂ­a entra en clara disputa con un correcto estilo de vida y un rendimiento adecuado. SegÃƒÂºn ÃƒÂºltimas investigaciones, no dormir las horas necesarias crea un deterioro en nuestro cuerpo similar al de estar ebrio. Si practicar ejercicio y llevar una nutriciÃƒÂ³n equilibrada son vitales para nuestra salud, el sueÃƒÂ±o debe considerarse el tercer pilar de una ÃƒÂ³ptima calidad de vida.","torrent":{"xt":"urn:btih:a52ac31060f72cdc597ca68b2a91fd5de40fd030","amp;dn":"Los+misterios+del+suenyo.%28Cap.+6%29.%28Docu.Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a52ac31060f72cdc597ca68b2a91fd5de40fd030","infoHashBuffer":{"type":"Buffer","data":[165,42,195,16,96,247,44,220,89,124,166,139,42,145,253,93,228,15,208,48]},"announce":[],"urlList":[]}}