{"title":"Aquatic Chemical Kinetics","uid":12073747,"size":19913630,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a5edac80cf70fe6eacb7770560556c66d1ef46d8&amp;dn=Aquatic+Chemical+Kinetics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1435587435,"description":"Aquatic Chemical Kinetics - Reaction Rates of Processes in Natural Waters - Werner Stumm (Wiley, 1990).pdf\n\nISBN 0-471-51029-7\n\nAquatic Chemistry An Introduction Emphasizing Chemical Equilibria in Natural Waters Second Edition Edited by Werner Stumm and James J. Morgan This second edition of the renowned classic unites concepts, applications, and techniques with the growing amounts of data in the field. Expanded treatment is offered on steady-state and dynamic models employing mass-balance approaches and kinetic information. New chapters address such topics as: environmental aspects of aquatic chemistry; new material on organic compounds in natural water systems; the use of stable and radioactive isotopes in chemical and physical processes; the latest advances in marine chemistry; solid-solution interface; kinetic considerations of equilibria; metal-ligand interactions; and an expanded compilation of thermodynamic data for important reactions in natural water systems. 1981 (0 471-04831-3) Cloth 780 pp. (0 471-09173-1) Paper Chemical Processes in Lakes Edited by Werner Stumm This is a multidisciplinary analysis of recent research on the physical, chemical, and biological processes in aquatic systems. Coverage includes: distribution of elements and compounds in water and sediments; sedimentation and sediment accumulation of nutrients and pollutants; eurtophication and acidification; atmospheric deposition; redox-related geochemistry and sediment-water exchange of nutrients and metals; sediment dating and paleolimnology; and steady-state and dynamic models. Most chapters focus on the role of biological processes and the coupling of elemental cycles by organisms. 1985 (0 471-88261-5) 435 pp. Principles of Aquatic Chemistry Francois M. M. Morel Here is a quantitative treatment of the chemical principles that govern the composition of natural waters. Features include an in-depth examination of the use of conservation principles in chemical systems, a review of thermodynamic and kinetic principles applicable to aquatic systems, and a novel presentation of a systematic methodology for equilibrium calculations. Detailed coverage is provided on the topic of aquatic chemistry, following the traditional divisions of acid-base, precipitation-dissolution, coordination, redox and surface reactions. 1983 (0 471-08683-5) 446 pp","torrent":{"xt":"urn:btih:a5edac80cf70fe6eacb7770560556c66d1ef46d8","amp;dn":"Aquatic+Chemical+Kinetics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5edac80cf70fe6eacb7770560556c66d1ef46d8","infoHashBuffer":{"type":"Buffer","data":[165,237,172,128,207,112,254,110,172,183,119,5,96,85,108,102,209,239,70,216]},"announce":[],"urlList":[]}}