{"title":"Neon Synthesis - Discography (2006 - 2009) Industrial Metal","uid":6764309,"size":194094139,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a843e29b314c36fba6c52dec2b66a422c4fd2969&amp;dn=Neon+Synthesis+-+Discography+%282006+-+2009%29+Industrial+Metal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":22,"time":1319313955,"description":"\n\nOur Empty Rooms (2006) 320 kbps\nAlchemy of Rebirth (2009) VBR\n\n\n\n \n\n\nNeon Synthesis is an Italian industrial rock band from Brescia.\nAccording to their website, their influences are huge, coming from industrial metal, gothic metal, Electronic body music, synthpop, and darkwave. Their style is characterized by a mix of melody and aggressive rhythms, of dance floor beats and epic anthems, of violent screaming and intense, dreamy vocals.\nThis project was officially born in April 2004, when the members, coming from different underground bands, joined forces to create a unique musical experience. The name of the band doesn't have a specific meaning, it only wants to suggest the idea of something cold, synthetic and artificial.\nIn 2005 a Depeche Mode song (Everything Counts) covered by the band was selected to appear on the first Italian tribute cd to the English band.\nOn April 27, 2006 they released a self-produced album entitled Our Empty Rooms, which contains 10 songs. It mixes industrial metal with synthpop, darkwave with ebm beats and atmospheric keyboards. The lyrics are influenced by the poetry of Thomas Stearns Eliot.\nOn February 29, 2009 a new album entitled &quot;Alchemy of Rebirth&quot; was released. It is described as a concept album depicting a journey that starts from chaos, strife, betrayal, representations of the human nature, and ends with a final catharsis, that leads to a metaphorical rebirth\n","torrent":{"xt":"urn:btih:a843e29b314c36fba6c52dec2b66a422c4fd2969","amp;dn":"Neon+Synthesis+-+Discography+%282006+-+2009%29+Industrial+Metal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a843e29b314c36fba6c52dec2b66a422c4fd2969","infoHashBuffer":{"type":"Buffer","data":[168,67,226,155,49,76,54,251,166,197,45,236,43,102,164,34,196,253,41,105]},"announce":[],"urlList":[]}}