{"title":"Creations of the Mind - Margolis [Non-Fiction] Mobi/Epub/PDF_(K-","uid":8871961,"size":6269588,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8f1ce36b060aabeb6a879d7ee025ca87f8d3ff0&amp;dn=Creations+of+the+Mind+-+Margolis+%5BNon-Fiction%5D+Mobi%2FEpub%2FPDF_%28K-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":5,"time":1378090437,"description":"Creations of the Mind presents sixteen original essays by theorists from a wide variety of disciplines who have a shared interest in the nature of artifacts and their implications for the human mind. All the papers are written specially for this volume, and they cover a broad range of topics concerned with the metaphysics of artifacts, our concepts of artifacts and the categories that they represent, the emergence of an understanding of artifacts in infants' cognitive development, as well as the evolution of artifacts and the use of tools by non-human animals. This volume will be a fascinating resource for philosophers, cognitive scientists, and psychologists, and the starting point for future research in the study of artifacts and their role in human understanding, development, and behavior.\n\nContributors: John R. Searle, Richard E. Grandy, Crawford L. Elder, Amie L. Thomasson, Jerrold Levinson, Barbara C. Malt, Steven A. Sloman, Dan Sperber, Hilary Kornblith, Paul Bloom, Bradford Z. Mahon, Alfonso Caramazza, Jean M. Mandler, Deborah Kelemen, Susan Carey, Frank C. Keil, Marissa L. Greif, Rebekkah S. Kerner, James L. Gould, Marc D. Hauser, Laurie R. Santos, and Steven Mithen. ","torrent":{"xt":"urn:btih:a8f1ce36b060aabeb6a879d7ee025ca87f8d3ff0","amp;dn":"Creations+of+the+Mind+-+Margolis+%5BNon-Fiction%5D+Mobi%2FEpub%2FPDF_%28K-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8f1ce36b060aabeb6a879d7ee025ca87f8d3ff0","infoHashBuffer":{"type":"Buffer","data":[168,241,206,54,176,96,170,190,182,168,121,215,238,2,92,168,127,141,63,240]},"announce":[],"urlList":[]}}