{"title":"The Hobbit: The Desolation of Smaug - Bluray 720p Avi - Skypeak","uid":9813532,"size":2617417123,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:a8fe1b70cfea11be76e287650c400fb0392f094f&amp;dn=The+Hobbit%3A+The+Desolation+of+Smaug+-+Bluray+720p+Avi+-+Skypeak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Skypeak","files":-1,"time":1395581968,"description":"The Hobbit: The Desolation of Smaug is a 2013 epic fantasy adventure film directed by Peter Jackson. It is the second installment of a three-part film adaptation based on the 1937 novel The Hobbit by J. R. R. Tolkien. It was preceded by An Unexpected Journey (2012) and will conclude with There and Back Again (2014), and together they will act as a prequel to Jackson's The Lord of the Rings film trilogy.\nThe film is set in Middle-earth sixty years before the events of The Lord of the Rings, and portions of the film are adapted from the appendices to Tolkien's The Return of the King. The wizard Gandalf the Grey (Ian McKellen) investigates a growing evil at Dol Guldur, while Bilbo Baggins (Martin Freeman) continues his quest with thirteen Dwarves, led by Thorin Oakenshield (Richard Armitage), to reclaim the Lonely Mountain from the dragon Smaug (Benedict Cumberbatch).\n\nThe film's screenplay was written by Peter Jackson, his longtime collaborators Fran Walsh and Philippa Boyens, and Guillermo del Toro, who was originally chosen to direct before leaving the project in 2010. The ensemble cast also includes Evangeline Lilly, Lee Pace, Luke Evans, Orlando Bloom, James Nesbitt, and Ken Stott, and features Stephen Fry, Sylvester McCoy, and Manu Bennett.\n\nThe Hobbit: The Desolation of Smaug premiered on 2 December 2013 in Los Angeles, and was released internationally on 11 December 2013.[4] Like its predecessor, the film used a shooting and projection frame rate of 48 frames per second, which was advertised as &quot;High Frame Rate&quot; to the public. The film was nominated for three Academy Awards: Best Visual Effects, Best Sound Editing, and Best Sound Mixing.\n\nSource: wikipedia\n\nmetascore: 66/100\n\n\n\n","torrent":{"xt":"urn:btih:a8fe1b70cfea11be76e287650c400fb0392f094f","amp;dn":"The+Hobbit%3A+The+Desolation+of+Smaug+-+Bluray+720p+Avi+-+Skypeak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8fe1b70cfea11be76e287650c400fb0392f094f","infoHashBuffer":{"type":"Buffer","data":[168,254,27,112,207,234,17,190,118,226,135,101,12,64,15,176,57,47,9,79]},"announce":[],"urlList":[]}}