{"title":"Zombie Playground","uid":12243732,"size":1054445878,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a91255f4566345466d2c97dea476bbb432a0a8a9&amp;dn=Zombie+Playground&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1439842259,"description":"Zombie Playgroundâ„¢ is Goonies meets Attack the Block meets The Walking Dead. The mood we want to capture in Zombie Playground is the feeling that you had as a child when you were completely immersed in your imagination fighting monsters and doing things you thought were cool from your favorite movies, comics, and video games.\n\nStealth Studios Inc., in collaboration with Abyssal Arts LLC and Titutitech SCP, has worked long and hard to create a game that delivers on the promise of our original vision. But have no illusion, this is on Steam Early Access for a reason: it is a true Beta. We have a lot of work left to do, so expect many rough edges. That said, please know that this Beta is the culmination of every ounce of effort by every single team member, bar none. Zombie Playgroundâ„¢ is made with the brains, disease, and puke of all involved - that means heart! We've put everything we have into this development, and we intend to put a lot more.\n\nGameplay in Zombie Playground is a hybrid of third person shooter and action RPG mechanics set in a cooperative zombie survival horror arena","torrent":{"xt":"urn:btih:a91255f4566345466d2c97dea476bbb432a0a8a9","amp;dn":"Zombie+Playground","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a91255f4566345466d2c97dea476bbb432a0a8a9","infoHashBuffer":{"type":"Buffer","data":[169,18,85,244,86,99,69,70,109,44,151,222,164,118,187,180,50,160,168,169]},"announce":[],"urlList":[]}}