{"title":"TAB BENOIT - Night Train To Nashville [LIVE-2008]","uid":4310293,"size":136065296,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:aac87485d42007be339e72ca94a5c25f49fc1ea1&amp;dn=TAB+BENOIT+-+Night+Train+To+Nashville+%5BLIVE-2008%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xkm","files":12,"time":1216776925,"description":"From the Artist\n&quot;All the guests on this record - Kim Wilson and Jimmy Hall and all the rest - make this a lot different from what I normally do on stage every night,&quot; says Tab Benoit. &quot;These aren&amp;#039;t guys who come to every show I play. They&amp;#039;re all legends, and it&amp;#039;s a real honor to have them come and play at my show. And to hear them sing my songs is a really great experience.&quot;\n\nProduct Description\nFollowing the release of &quot;Brother to the Blues&quot; in the spring of 2006, the Blues Foundation convened in Memphis on May 10, 2007, for their annual Blues Music Awards ceremony and honored guitarist Tab Benoit with the dual awards of B.B. King Entertainer of the Year and Best Contemporary Male Performer of 2006.\n\nFor anyone who saw Benoit play a two-night stand in Nashville at The Place On Second Street just prior to the 2007 Blues Music Awards ceremony, the reasons for the accolades were crystal clear. Backed by Louisiana&amp;#039;s LeRoux and a handful of high-profile guest performers representing a range of roots music styles, Benoit reaffirmed his reputation as a force to be reckoned with on the blues landscape in ways that no trophy ever could.\n\nFor the millions of fans unable to witness this electrifying performance first-hand, &quot;Night Train To Nashville,&quot; Benoit&amp;#039;s sixth solo release on Telarc, is the next best thing. The 11-track live recording, set for April 22, 2008, captures the magic and intensity of Benoit in a live setting, joined by his faithful backup unit and New Orleans mainstay, Louisiana&amp;#039;s LeRoux, and a series of guests representing some of the most talented voices on the current blues, Cajun and country scenes: harpist/vocalist Jimmy Hall (Wet Willie), guitarist/vocalist Jim Lauderdale, harpist/accordionist Johnny Sansone, fiddler/washboard player Waylon Thibodeaux and harpist/vocalist and Fabulous Thunderbirds frontman Kim Wilson. \n\n","torrent":{"xt":"urn:btih:aac87485d42007be339e72ca94a5c25f49fc1ea1","amp;dn":"TAB+BENOIT+-+Night+Train+To+Nashville+%5BLIVE-2008%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aac87485d42007be339e72ca94a5c25f49fc1ea1","infoHashBuffer":{"type":"Buffer","data":[170,200,116,133,212,32,7,190,51,158,114,202,148,165,194,95,73,252,30,161]},"announce":[],"urlList":[]}}