{"title":"Hip Flask","uid":4757785,"size":77450213,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:abaf0136976626be1bd8d059b4661aaffe97d04d&amp;dn=Hip+Flask&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gilgamesh07","files":7,"time":1236546930,"description":"Ladies and Gentlemen, this torrent contains the Hip Flask series from Comicraft that preceded the Elephantmen series from Image. \n\nI have also included a fixed copy of War Toys #3 as the one in my Elephantmen torrent is broken.\n\n \n\nHieronymous &quot;Hip&quot; Flask is a fictional anthropomorphic hippopotamus who appears in comic books published by Active Images and Image Comics. He was created by Richard Starkings.\n\nThe character of Hip Flask first appeared in a number of advertisements for Comicraft comic book fonts in the late 1990s in which he was originally depicted as a private detective (this has since changed in the pages of his own comics). The character was created by Starkings when he failed to receive authorization from Marvel or DC Comics to use their characters in his Comicraft ads. He later graduated to his own series of one-shots by writers Richard Starkings, Joe Casey and artist LadrÃƒÂ¶nn.\n\nHis strip adventures have placed him firmly in the science fiction genre, in a dystopian future (2262). Much of the imagery of Hip Flask's world is reminiscent of the movie Blade Runner, especially as both are set in Los Angeles. The comics have been published once every one or two years, with three issues available as of July 2006.\n\n[u][b]Biographical data[/b][/u]:\n\nSome two hundred years from now, the MAPPO Corporation, headed by the misanthropic and megalomaniacal Japanese scientist, Dr Kazushi Nikken, breed human/animal hybrids in a secure, top secret facility somewhere in North Africa. The Hybrids are composed of numerous African animal species including Warthogs, Elephants, Camels, Zebras, Rhinos, Hippos, Giraffes and Crocodiles. The process involves implanting embryos into the wombs of kidnapped local women who are disposed of after giving birth. Each child is branded after birth marking them as the property of MAPPO. Hip Flask's scar is distorted so that &quot;Hippopotomas Hybrid Flask #7A&quot; instead reads just &quot;Hip Flask #7A&quot;, hence his name.\n\nThese Elephantmen are trained from birth to be soldiers and killers, they are indoctrinated in an Orwellian mindset to think of themselves as property of the MAPPO Corporation and to deny any concept of freethought. Hip Flask was possibly the only Elephantman who dared to ask questions during his childhood education, an act for which he was placed in solitary confinement.\n\nThe U.N upon discovering these experiments sends in an army to storm MAPPO's Secret base. While their mission has not been elaborated at this stage it seems to be a combination of liberating the Elephantmen, investigating the attacks on the local populace and ending the development of MAPPO's illegal army.\n\nMAPPO turns the Elephantmen on the U.N troops, and horrendous casualties are inflicted on both sides. Ultimately the U.N. succeed in subduing the Elephantmen and the MAPPO Personnel are arrested. \n\nThe Elephantmen are rehabilitated and released to establish their own lives in the outside world where they are generally welcomed with distrust and horror from humans. Many of the Elephantmen were assigned jobs by the government.\n\nThe intervening years of Hip Flask's life have not yet been revealed but many years later he appears as an advisor for the Information Agency, a government body tasked with monitoring data and information as an aid to law enforcement. He is partnered by a beautiful young woman named Vanity Case who seems to have romantic feelings towards him (much to Hip's embarrassment). Despite his traumatic childhood Hip Flask is shown to be a calm, kind and friendly individual, unlike many of the other Elephantmen who display a great deal of bitterness.\n\nThanks to the scanners and to the original sources who wish to remain nameless. \n\nThanks to the individual who provided me with the head's up that War Toys #3 in the Elephantment torrent was broken.\n\nPlease seed. Please enjoy.\n","torrent":{"xt":"urn:btih:abaf0136976626be1bd8d059b4661aaffe97d04d","amp;dn":"Hip+Flask","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abaf0136976626be1bd8d059b4661aaffe97d04d","infoHashBuffer":{"type":"Buffer","data":[171,175,1,54,151,102,38,190,27,216,208,89,180,102,26,175,254,151,208,77]},"announce":[],"urlList":[]}}