{"title":"A Companion to Greek Art - Smith &amp; Plantzos [Non-Fiction] PD","uid":8871964,"size":10585702,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:abf1bac26180817d69fdc3035cfb0e105d1f97d7&amp;dn=A+Companion+to+Greek+Art+-+Smith+%26amp%3B+Plantzos+%5BNon-Fiction%5D+PD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":3,"time":1378090711,"description":"This well-illustrated two-volume set offers a comprehensive, authoritative account of the development of Greek art through the 1st millennium BC. While there is no shortage of introductory handbooks on Greek art, the current publication takes a fresh look at the many facets of the subject, from the basic forms, materials, and types, to colonization, iconography, and finally the reception of Greek art in post-classical periods.\nA Companion to Greek Art is a collaborative effort joining scholars of various nationalities and specializations. The chapter authors are foremost experts in their field, and, being drawn from the ranks of university lecturers and professors, museum curators and field archaeologists, they offer unique perspectives to the collection. As a result, this is an unbiased and inclusive representation of the state of the discipline and the current ways it is being examined by scholars all over the world.\n\nA Companion to Greek Art presents a nuanced portrait of the development of Greek art, through a narrative that is factually oriented and technically detailed, as well as thematic, contextual, and historiographical. ","torrent":{"xt":"urn:btih:abf1bac26180817d69fdc3035cfb0e105d1f97d7","amp;dn":"A+Companion+to+Greek+Art+-+Smith+%26amp%3B+Plantzos+%5BNon-Fiction%5D+PD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abf1bac26180817d69fdc3035cfb0e105d1f97d7","infoHashBuffer":{"type":"Buffer","data":[171,241,186,194,97,128,129,125,105,253,195,3,92,251,14,16,93,31,151,215]},"announce":[],"urlList":[]}}