{"title":"Alongside Night  - J. Neil Schulman.epub","uid":8942364,"size":432640,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:abf51ee4d6f96cccb94d7ce24ebc6eee02d23dd9&amp;dn=Alongside+Night++-+J.+Neil+Schulman.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1379695140,"description":"The federal government is shut down from lack of money in the budget. Foreigners are buying up everything in America while Europeans, now united, gloat over the fall of a once great nation. Homeless people and youth gangs roam the streets of New York. Money is worthless, markets collapse, and businesses fail. Smugglers use the latest computer encryption technology to operate bold enterprises that the government is powerless to stop, even with totalitarian control of news and private communication. A private mercenary army protecting a vast black-market empire, headed by a former Green Beret and his ex-CIA sidekick, battles an FBI run by a ruthless Director who's blackmailing the president with an old scandal and putting radicals in a secret prison, in a desperate bid maintain power. \nAnd caught in the middle of it all are the brilliant 17-year-old son of a missing Nobel-prizewinning economist, his best friend from prep school whose uncle was once a guerrilla fighter, and the beautiful but mysterious 17-year-old girl he meets in a secret underground ... a girl who carries a pistol with a silencer. \n\nThe setting could be the day after tomorrow, based on headlines drawn from our daily news. But the novel was written over three decades ago by a 23-year-old college drop-out who crafted his particular brand of prophecy from combining the techniques of science fiction with projections based on an obscure economic theory. \n\nBuilding on the prophetic novels of Orwell, Rand, and Heinlein, J. Neil Schulman created in Alongside Night the first of a new generation of libertarian novels, telling the story of the final two weeks of the world's last superpower through the perceptive eyes of a young man caught up in the maelstrom of the final American revolution. \n\nPrometheus Award Hall of Fame Winner!\n\nGenre: Science Fiction","torrent":{"xt":"urn:btih:abf51ee4d6f96cccb94d7ce24ebc6eee02d23dd9","amp;dn":"Alongside+Night++-+J.+Neil+Schulman.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abf51ee4d6f96cccb94d7ce24ebc6eee02d23dd9","infoHashBuffer":{"type":"Buffer","data":[171,245,30,228,214,249,108,204,185,77,124,226,78,188,110,238,2,210,61,217]},"announce":[],"urlList":[]}}