{"title":"EXPLOITED COLLEGE GIRLS - Ashlynn - Hot Blonde Teen  **NEW**","uid":10591513,"size":434201923,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ac24efc4c97eb565bff1d3284989d0d862f5ef5a&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Ashlynn+-+Hot+Blonde+Teen++%2A%2ANEW%2A%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"beta2008x","files":1,"time":1405803762,"description":"  &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=ohwxt_als.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=ohwxt_als.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=hryzr_ecg_ashlynn_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=hryzr_ecg_ashlynn_s.jpg&lt;/a&gt;\n\n\n\nWhat do you get if you combine a folk singer, an underwear model and a nymphomaniac? Hint, her name is Ashlynn and she's the ECG girl of the week. From her frizzy blonde hair, to her perky little titties to her long tan legs, this girl is amazing looking and her looks are perfectly complimented by a fun, bubbly attitude that reels you in.\n\nThe sexual tension in this week's interview starts off at level ten. Even during the paperwork portion of the interview Ashlynn is talking about how excited she is to get banged today so when the shoot itself starts, it's no surprise to see her squirming and wiggling out of her clothes. When she does, you are greeted by a long, lean beauty with a perfect Coppertone tan from nose to toes (feet fans pay attention, Ashlynn has great little toesies and shows them off a few times.) As soon as Jay applied his fingers to Ash's pussy things really heat up. Her pent up sexual energy is apparent at the way she dances and wiggles at the attention from Jay's fingers and the Rabbit.\n\nAfter Ashlynn gets hers it's time for Jay to get some and he has her drop to her knees for some oral action which turns out to be pretty amazing. Ash licks her way from tip to base in some of the most passionate hippie cock worship we've seen in ages. As enthusiastic and sensual as this beej is, Ashlynn has a body built for sex and Jay gets right to it. He poses her on her knees with her fine ass in the air and then dives in. She loves it, LOVES it. This girl has got one of the tightest pussies we've shot in who knows how long. Her pussy is so tight it squeaks, and you can tell she loves every second that she's getting fucked on camera.\n\nRarely is one of Jay's monster facials greeted with such smiling glee, but that's just how positive Ashlynn is, she takes every drop of jizz on the chin, licks Jay's cock clean and then thanks him! It's so rare we find girls with this kind of natural, fun sexuality but we're always looking for more.\n\t\t","torrent":{"xt":"urn:btih:ac24efc4c97eb565bff1d3284989d0d862f5ef5a","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Ashlynn+-+Hot+Blonde+Teen++%2A%2ANEW%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac24efc4c97eb565bff1d3284989d0d862f5ef5a","infoHashBuffer":{"type":"Buffer","data":[172,36,239,196,201,126,181,101,191,241,211,40,73,137,208,216,98,245,239,90]},"announce":[],"urlList":[]}}