{"title":"Dean Koontz - Phantoms","uid":4640278,"size":855418980,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ac28fee17338590ea6748226d24ab6f9b1a5ea31&amp;dn=Dean+Koontz+-+Phantoms&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hasdrubal","files":1188,"time":1231693690,"description":"Jenny and Lisa Paige, two sisters, return to Jenny's hometown of Snowfield, Colorado, a small ski resort village nestled in the Sierra Nevada where Jenny works as a doctor, and finds no one alive. The few bodies they find are either mutilated, or reveal some strange form of death. Finally, after growing more alarmed by the town's mysterious and alarming situation Jenny manages to call police in a neighboring town to come help.\n\nTogether, the girls and the police are able to request help from the military Biological Investigations Unit. The police managed to find only one clue as to what was causing the town's disappearances and deaths. A victim of whatever was trying to kill him managed to write the name Timothy Flyte, on a mirror moments before he was killed. Flyte is a British academic and author of a book, The Ancient Enemy. His book catalogs and describes various mass vanishings of people in different parts of the world over the centuries.\n\nIt is discovered that the town was built over the hibernating place of this creature, an amoeboid shapeshifter. The Ancient Enemy rarely feeds, but when it does, the effects are devastating. It was theorized that the Enemy either caused or aided in the extinction of the dinosaurs, as well as many of the great mysterious mass vanishings: Mayan civilization, Jamestown, Roanoke, ghost ships, etc.\n\nThe creature consumes other life forms to increase its mass and is able to perfectly mimic other creatures. It can create small &quot;probes&quot; or &quot;phantoms&quot; imitating consumed life forms to go forth and hunt more prey, obeying the orders of its &quot;hive mind;&quot; in addition the creature absorbs the mental capacity of those it consumes.\n\nIts only vital organ is a nucleus located in the center of its main body. The creature's cells are similar in molecular structure to fossil fuels; upon discovering this the scientists use oil-eating bacteria to destroy the Enemy's core or brain.\n","torrent":{"xt":"urn:btih:ac28fee17338590ea6748226d24ab6f9b1a5ea31","amp;dn":"Dean+Koontz+-+Phantoms","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac28fee17338590ea6748226d24ab6f9b1a5ea31","infoHashBuffer":{"type":"Buffer","data":[172,40,254,225,115,56,89,14,166,116,130,38,210,74,182,249,177,165,234,49]},"announce":[],"urlList":[]}}