{"title":"Kyn (Patch 2.0.1.3) (GOG)","uid":12227867,"size":295905964,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ac5f01b184aadbf95c3ca7fb010567fe996f7224&amp;dn=Kyn+%28Patch+2.0.1.3%29+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mercs215","files":2,"time":1439503752,"description":"Install instructions:\n1. Run &quot;patch_kyn_2.0.1.3&quot;\n2. Play\nPLEASE REMEMBER TO SEED, MANY OTHERS WANT THIS GAME! :)\nIf you like this game, support the developers and BUY IT!\n\nChangelog:\nNew Features:\nCamera rotation. Enable it via the options menu, it's disabled by default. In some levels the edges of the map is visible when the camera is rotated, this will be fixed in the next update.\nNew highlight system, when selecting a Monster, NPC, Chests etc an outline is shown making it visually easier to see what your selecting.\nNew selection system, selecting monster and NPC is now better with our new selection system.\nOptions added to the pause menu.\nFixes:\nFixed Kiera icon in Town where it would flicker between yellow and white.\nFixed falling through the bridge in Mission 7 after a load.\nFixed issues with some steps in Mission 4 where the characters couldn't get back up.\nFixed &quot;The Choice&quot; Achievement it wasn't given when completing the game.\nFixed Cursor in multi- monitor configuration.\nFixed Gigas Key in Mission 15\nFixed loot respawn in Mission 1\nDue to problems with the mouse cursor we had to temporary revert the changes made to it. Some players where unable to progress because of it.\nFixed an issue with bloom settings.\nAdded v-sync option in the graphics options menu.\nAdded locking mouse to single screen in multiple monitor setup.\nAdded Toggle to show or hide loot labels.\nClarify that the blacksmith isn't in town until mission 2 is completed.\nMoving the crafting components vendor closer to the blacksmith.\nMake regroup area clearer/larger in mission 7.\nClarifying what equipment a warrior can and can't equip.\nFixed Kiera's health regeneration when out of combat.\nFixed an issue with equipment comparer.\nFixed an exploit in mission 9 where infinite enemies would spawn.\nFixed path finding in mission 7.\nFixed Catapult animation glitch.\nFixed Giant animation glitch.\nFixed bug with turning in mission 3 when you had 35 villagers rescued.\nFixed an issue where the gate in mission 15 wouldn't open after destroying the trebuchets.\nFixed an issue where the data from Thorfinn was overridden in Mission 11.\nOther various minor fixes and tweaks","torrent":{"xt":"urn:btih:ac5f01b184aadbf95c3ca7fb010567fe996f7224","amp;dn":"Kyn+%28Patch+2.0.1.3%29+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac5f01b184aadbf95c3ca7fb010567fe996f7224","infoHashBuffer":{"type":"Buffer","data":[172,95,1,177,132,170,219,249,92,60,167,251,1,5,103,254,153,111,114,36]},"announce":[],"urlList":[]}}