{"title":"Jiddu Krishnamurti with Huston Smith - California (1968)","uid":6487573,"size":735605458,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ae68de890cde43bae08f814cdb1151581bcde7eb&amp;dn=Jiddu+Krishnamurti+with+Huston+Smith+-+California+%281968%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"naba888","files":3,"time":1308757133,"description":"Jiddu Krishnamurti with Huston Smith - California (1968)\nIs it Possible to Live with Total Lucidity - J. Krishnamurti; Dr. Huston Smith - Claremont College, California (1968)\n\nConversation between Krishnamurti and Prof. Huston Smith, at the time, a professor of religion at M.I.T. Prof. Smith begins the conversation with the question \\'Is it Possible to Live with Total Lucidity?\\' Huston Smith: \\'I am Huston Smith, professor of philosophy at the Massachusetts Institute of Technology, and I invite you to a conversation arranged by the Blaisdale Institute of Claremont, California, with Krishnamurti, who was raised by Annie Besant and the Theosophists to be a teacher, and who, though he discarded the mantle of Theosophy, did indeed become a sage of our century, one whose voice is heard as much by the youth of today as throughout the world for the last sixty years. \\'Krishnamurti, maybe this morning I will have only one question which in one way or another I will be coming back to in various ways. In your writings, in your speaking, time and again you come back to this wonderful little word, lucid and lucidity, but is it possible living as we are in this confused and confusing world, torn by conflicting voices without and conflicting tensions within, with hearts that seem star crossed and tensions that never go, is it possible in such a life, in such a world, to live with total lucidity? And if so, how?\\'\n\nFiles: .m4v, JVT/AVC Coding, 720 x 480 (632 x 480), Millions, AAC, Stereo (L R), 48.000 kHz, 1416.22 kbits/s, 01:02:04.99","torrent":{"xt":"urn:btih:ae68de890cde43bae08f814cdb1151581bcde7eb","amp;dn":"Jiddu+Krishnamurti+with+Huston+Smith+-+California+%281968%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae68de890cde43bae08f814cdb1151581bcde7eb","infoHashBuffer":{"type":"Buffer","data":[174,104,222,137,12,222,67,186,224,143,129,76,219,17,81,88,27,205,231,235]},"announce":[],"urlList":[]}}