{"title":"[DVDRip-XviD-AC3] Grande Grosso e Verdone[volpebianca]","uid":4608283,"size":1474791424,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ae6f12a839cec4a6086d625cbc7af49c1168892f&amp;dn=%5BDVDRip-XviD-AC3%5D+Grande+Grosso+e+Verdone%5Bvolpebianca%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"vash-88","files":2,"time":1230549213,"description":"Titolo originale: Grande, grosso e Verdone \nNazione:Italia\nAnno: 2008\nGenere: Commedia \nDurata: 131' \nRegia:Carlo Verdone\n\n\nCarlo Verdone torna sul grande schermo riproponendo alcuni dei personaggi divenuti celebri nei suoi primi film. Si tratta di tre storie parallele. Nella prima, Leo e la sua famiglia si svegliano di buon'ora per partecipare ad un raduno di boy scout, ma i loro progetti vengono interrotti dall'improvvisa morte dell'anziana madre di lui che vive con loro. Leo e la moglie dovranno occuparsi del funerale ma, per via dell'impresario delle pompe funebri, una triste formalitÃƒÂ  si trasformerÃƒÂ  in un incubo infernale. Nella seconda storia Callisto Cagnato, temuto professore universitario, dal carattere burbero e severo, ÃƒÂ© preoccupato dal fatto che il figlio ventenne, Severiano, non riesce ad intrattenere molti rapporti con l'esterno, soprattutto con le ragazze. Decide cosÃƒÂ¬ di fargli conoscere una sua studentessa, ed in effetti, fra i due ragazzi scocca la scintilla. L'epilogo della storia perÃƒÂ² ÃƒÂ© tutt'altro che prevedibile. La terza ed ultima storia, vede una coppia benestante e cafona, Moreno Vecchiarutti e sua moglie Enza, recarsi con il figlio in vacanza a Taormina, sotto consiglio del loro terapista, per affrontare quel classico momento di stanchezza e di mancanza di desiderio che prima o poi si presenta in ogni rapporto... ma la vacanza anzichÃƒÂ© riavvicinare marito e moglie, sembra in un primo momento allontanarli ulteriormente...","torrent":{"xt":"urn:btih:ae6f12a839cec4a6086d625cbc7af49c1168892f","amp;dn":"%5BDVDRip-XviD-AC3%5D+Grande+Grosso+e+Verdone%5Bvolpebianca%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae6f12a839cec4a6086d625cbc7af49c1168892f","infoHashBuffer":{"type":"Buffer","data":[174,111,18,168,57,206,196,166,8,109,98,92,188,122,244,156,17,104,137,47]},"announce":[],"urlList":[]}}