{"title":"HSAS Through the Fire (Bonus) Hagar Schon Aaronson Shrieve @320k","uid":4676885,"size":164724066,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:aec44f6a8c201fa10b4921dcd86411b83396bcf7&amp;dn=HSAS+Through+the+Fire+%28Bonus%29+Hagar+Schon+Aaronson+Shrieve+%40320k&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"degsey","files":-1,"time":1232929016,"description":"HSAS - THROUGH THE FIRE\n\nTrack List:\n01. Top Of The Rock\n02. Missing You\n03. Animation\n04. Valley Of The Kings\n05. Giza\n06. Whiter Shade Of Pale\n07. Hot And Dirty\n08. He Will Understand\n09. My Hometown\n\nBonus Tracks\n\n10. Going In For The Kill\n11. Hope And Fear\n12. Tough Enough\n13. Ever Since You Came\n14. What Will Never Be\n15. Eyes Of Love\n\n320kbps CBR + album cover jpg\n\nBand:\nSammy Hagar - Vocals\nNeal Schon - Guitar\nKenny Aaronson - Bass\nMichael Shrieve - Drums\n\n+ Nick Sciorsci - Rhythm Guitar, Backing Vocals\n\nProduction: Produced by Sammy Hagar and Neal Schon\nReleased: 1984 (Geffen)\n\n\nThrough The Fire was the only effort from this short-lived group of superb players. Included here are Sammy Hagar (prior to joining Van Halen) and Neal Schon (during his short hiatus from Journey). Songs such as &quot;Top Of The Rock&quot;, &quot;Hot And Dirty&quot; and &quot;My Home Town&quot; really rock, and there is also an excellent cover of Procol Harum's &quot;Whiter Shade Of Pale&quot;.\n\nThis album gave Schon a chance to flex his metallic muscle as Journey leaned towards soft rock. Surprisingly this album was recorded live during two dates in San Francisco, but the crowd noise was later removed from the recording to make it feel like a studio effort. The musicianship here is excellent and the songs are cool too, this album really impressed me. Hagar Schon Aaronson Shrieve receives two thumbs up for Through The Fire! \n\nHagar Schon Aaronson Shrieve (also known as HSAS) were a band featuring lead vocalist Sammy Hagar, lead guitarist Neal Schon, bassist Kenny Aaronson, drummer Michael Shrieve, and later, rhythm guitarist Nick Sciorsci. The group reportedly rehearsed for less than a month before playing in concert. They released a semi-live album, recorded during two live performances at the the Warfield in San Francisco, entitled Through the Fire, which includes a cover of Procol Harum's &quot;A Whiter Shade of Pale&quot;. Some tracks played live in concert were not included on the album, including the song &quot;Bookends&quot;. The album was edited in-studio to remove crowd noise, but otherwise was left as recorded. The band toured briefly in California in 1984, adding rhythm guitarist Nick Sciorsci for live performances.\n\nTo record the album, the band played live dates from November 9, 1983 to November 21, 1983 at the Westwood One Mobile Facility. Two of the dates, November 14 and November 15 in San Jose, California were videotaped by MTV. This footage was aired at least once but was never released on official videotapes or DVDs. A full concert was also aired on the radio as a Westwood One Broadcast. Original tracks that didn't make the HSAS Through the Fire album include &quot;Tough Enough&quot;, &quot;Through the Eyes of Love&quot;, &quot;Hope and Fear&quot;, &quot;Since You Came&quot;, and &quot;What Will Never Be&quot;.\n\nSammy Hagar and Neal Schon were later band mates in Planet Us. Schon has also played with Hagar as a solo artist. Schon and Michael Shrieve have also both played in Santana.\n\nNow, as you've been good little boys and girls, I've included six bonus tracks which were never released initially and not made available to the majority of you earthlings - I'm making this a thing of the past.\n\nEnjoy...plz leave a comment and SEED!\n\nPeace! &lt;a href=&quot;\nhttp://thepiratebay.se/user/degsey&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/degsey&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:aec44f6a8c201fa10b4921dcd86411b83396bcf7","amp;dn":"HSAS+Through+the+Fire+%28Bonus%29+Hagar+Schon+Aaronson+Shrieve+%40320k","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aec44f6a8c201fa10b4921dcd86411b83396bcf7","infoHashBuffer":{"type":"Buffer","data":[174,196,79,106,140,32,31,161,11,73,33,220,216,100,17,184,51,150,188,247]},"announce":[],"urlList":[]}}