{"title":"Falling Down (1993)","uid":3270933,"size":743036620,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:af670a83f5d7a9437a45bfcf8c6e198dc236f213&amp;dn=Falling+Down+%281993%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Tisip","files":53,"time":1104453896,"description":"Falling Down (1993) is one of the best films made by director Joel Schumacher (8mm, The Jury, The Client, St. Elmos Fire, Flatliners, Batman Forever, Batman &amp;amp; Robin). This dark comedy has inspired Quentin Tarantino to create a scene in Pulp Fiction. Falling Down is about a man who goes insane on a hot day summer day in Los Angeles. It is also a caricature of America in the 1990s, with its racial, social and economic problems. It is a portrait of middle class society, its angst and neurotic behavior. We can see homeless people and other dark sides of the &amp;quot;American success story&amp;quot;. But social and other criticism is not in the center of the film, and the action becomes more and more dominant as the story unfolds.\n \nBill (Michael Douglas) is the ordinary white collar middle class guy. He drives a car with the license plate &amp;quot;D-FENS&amp;quot; which tells you all about him. Stuck in a traffic jam, he first tries to stay cool, but slowly becomes nervous. Noisy children in a bus, a man yelling into his cell-phone, a defunct air conditioner, a disturbing fly buzzing around his head. He starts fighting the fly with his newspaper. After a panic attack, he opens the door of his car and steps out. D-FENS needs a break and some fresh air. His decision is clear: &amp;quot;I'm going home&amp;quot;.\n","torrent":{"xt":"urn:btih:af670a83f5d7a9437a45bfcf8c6e198dc236f213","amp;dn":"Falling+Down+%281993%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af670a83f5d7a9437a45bfcf8c6e198dc236f213","infoHashBuffer":{"type":"Buffer","data":[175,103,10,131,245,215,169,67,122,69,191,207,140,110,25,141,194,54,242,19]},"announce":[],"urlList":[]}}