{"title":"Shadwen (v2.1.0.3) [GOG]","uid":15532316,"size":4826676879,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:afa4371853555e54309ed41265339b4afb16d34e&amp;dn=Shadwen+%28v2.1.0.3%29+%5BGOG%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ojusko","files":3,"time":1470843877,"description":"Install insturctions:\r\n- Run &quot;setup_shadwen_2.1.0.3.exe&quot;\r\n- Play\r\n\r\nChangelog for Patch 1356 / GOG-3 (Windows) - Escape from the Castle Update (09 August 2016):\r\n- Adds 14 re-worked levels completely for free on all PC, OS X and Linux platforms. The levels are reverse and remade versions of the ones in the orignal campaign - the objective now is to escape from the King's Castle!\r\n- The difficulty curve in the new content has been increased and players are encouraged to search for hidden treasure maps scattered around the levels!\r\n- The update also includes numerous bug fixes and some tweaks to the game's AI.\r\n\r\nGenre: Action - Adventure - Stealth\r\nWorks on: Windows (Vista, 7, 8, 10), Mac OS X (10.9+) and Linux (Ubuntu 14.04, Ubuntu 16.04)\r\nLanguages: Audio and text: English. Text only: Deutsch, español, français, italiano\r\nFeatures: single-player - achievements - controller support\r\nReleased: May 17, 2016\r\nSize: 4.5 GB\r\nCompany: Frozenbyte / Frozenbyte\r\nStore page: https://www.gog.com/game/shadwen\r\n\r\nAbout:\r\nShadwen is a stealth-action game where the only rule is to remain unseen. Stay hidden - or the ruthless guards will kill you on sight!\r\n\r\nShadwen, an assassin on a quest to kill the king, has a chance encounter with an orphaned girl, Lily. She follows Shadwen on her dangerous journey, but when the ruthless guards get too close, Shadwen must take action right in front of Lily's eyes.\r\n\r\nWill Shadwen risk the girl's budding trust by resorting to violence, or try and find another way while keeping her real purpose concealed?\r\n\r\nTo kill or not to kill - that is the question.\r\n\r\nMOVE FREELY - Sneak and explore around the dark and gritty medieval province and use the environment to your advantage - use your rope to grapple onto rooftops, silently drop from ceilings, or veil yourself in the shadows.\r\nSTAY HIDDEN - Pick your assassinations carefully. Avoid being seen, heard or getting caught indirectly. Suspicious sights and noises will alert the guards - use it to your benefit.\r\nTIME IS AN ACCOMPLICE - Time stands still when you are not moving Shadwen, allowing you to stop at any point mid-motion. Rewind time to manipulate your past and present actions!\r\nUSE PHYSICS - Use physics and a freely attachable rope to drag and topple objects. Make deaths look accidental; let gravity do the grave work.\r\nCREATE TRAPS AND HAZARDS - set up traps and hazards to lure guards towards their untimely demise; discover new ways to eliminate or distract your foes by crafting items into deadly surprises, including poison traps, spike devices, decoy toys and more.\r\nTWO CHARACTERS - Embrace the darkness with Shadwen and her abilities to protect Lily and create a safe passage for her.\r\n\r\nMinimum system requirements - Windows: 64 bit Vista / 7 / 8 / 10\r\nProcessor: Intel Core i3/i5/i7 1.8 GHz CPU dual-core. AMD 2.0 GHz dual-core\r\nMemory: 4 GB RAM\r\nGraphics: NVIDIA GeForce 260 / Radeon HD 4000 Series / Intel HD Graphics 4000\r\nDirectX: Version 10\r\nStorage: 6 GB available space\r\nMouse, Keyboard\r\n\r\nRecommended system requirements - Windows: 64 bit Vista / 7 / 8 / 10\r\nProcessor: Intel quad-core 2.0 GHz or dual-core 2.6 GHz\r\nMemory: 8 GB RAM\r\nGraphics: NVIDIA GeForce GTX 560 2GB / Radeon HD 6850 2GB\r\nDirectX: Version 10\r\nStorage: 6 GB available space","torrent":{"xt":"urn:btih:afa4371853555e54309ed41265339b4afb16d34e","amp;dn":"Shadwen+%28v2.1.0.3%29+%5BGOG%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afa4371853555e54309ed41265339b4afb16d34e","infoHashBuffer":{"type":"Buffer","data":[175,164,55,24,83,85,94,84,48,158,212,18,101,51,155,74,251,22,211,78]},"announce":[],"urlList":[]}}