{"title":"Smokescreens - Jack T. Chick","uid":11773462,"size":1048007,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:afe7621079e90eda43092bf0eb88acff9eb1591a&amp;dn=Smokescreens+-+Jack+T.+Chick&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427168838,"description":"\nMany Christians believe the current call for Christian unity is biblical and reflects the heart of God. But in this important book, Jack Chick shows why nothing could be further from the truth. Before you agree to this &quot;unity,&quot; you need to know who you are uniting with . . . and what they believe. Here, you will learn that today'unity' is a clever smokescreen, devised by the Vatican to bring all Christians under Rome's control. And to be in unity with Rome, you must be willing to compromise your beliefs . . . and accept hers.\n\n-Discover why this &quot;unity&quot; is so dangerous, and how far down the road of compromise the church has already traveled.\n-See how major Christian leaders have been leading their followers into compromise with Rome for years.\n-Learn how to spot this dangerous false unity so you can take a stand.\n-Learn the high price you will eventually pay for this &quot;unity.&quot;\n\n\nAbout the author:\nJack Thomas Chick (born April 13, 1924) is an American publisher, writer, and comic book artist of evangelical fundamentalist Christian tracts and comic books. His comics have been described by Los Angeles magazine as &quot;equal parts hate literature and fire-and-brimstone sermonizing&quot;.\n\nChick's company, Chick Publications, claims to have sold over 750 million tracts, comics tracts and comic books, videos, books, and posters designed to promote Protestant evangelism from a Christian fundamentalist perspective or point of view. Many of these are controversial, as they accuse Roman Catholics, Freemasons, Muslims, and many other groups of murder and conspiracies, while Chick maintains his views are simply politically incorrect.\n\nChick's views have been spread worldwide, mostly through the tracts and now online. They have been translated into more than 100 languages. As evidenced from his writings and publications, Chick is an Independent Baptist who follows a premillennial dispensationalist view of the end times. He is a believer in the &quot;King James Only&quot; movement","torrent":{"xt":"urn:btih:afe7621079e90eda43092bf0eb88acff9eb1591a","amp;dn":"Smokescreens+-+Jack+T.+Chick","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afe7621079e90eda43092bf0eb88acff9eb1591a","infoHashBuffer":{"type":"Buffer","data":[175,231,98,16,121,233,14,218,67,9,43,240,235,136,172,255,158,177,89,26]},"announce":[],"urlList":[]}}