{"title":"Institutional Racism and the Police: Fact or Fiction [blackatk]","uid":8782612,"size":246390,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1b4a418faabd91f401499c66e6f4ece039827f6&amp;dn=Institutional+Racism+and+the+Police%3A+Fact+or+Fiction+%5Bblackatk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1375751624,"description":"Publication Date: August 25, 2000 | Series: Civil Society | With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload | filetype: pdf |\n\n\n\nSir William Macpherson's inquiry into the murder of Stephen Lawrence claimed to find evidence of 'institutional' or 'unwitting' racism in the Metropolitan Police Service. However, the inquiry's findings were controversial. No evidence was produced - at least in the sense in which evidence is understood in a court of law. The definition of racism which Macpherson devised was contentious because it was unprovable, and Macpherson failed to give weight to alternative explanations for the way in which Stephen Lawrence's killers escaped prosecution. In this collection of essays John Grieve of the Metropolitan Police's Racial and Violent Crime Task Force accepts the charge of institutional racism and gives an account of the ways in which the MPS is seeking to combat this. Home Office Minister Mike O'Brien expands this with an account of measures which the Home Office is adopting to eliminate racism in all of its departments. Robert Skidelsky and Michael Ignatieff, on the other hand, argue that the real issue is police ineffectiveness, which impacts on all Londoners, black and white. The contributors to this book raise profound questions about the nature of policing in a free society and ask if the police must now be colour-conscious instead of colour blind. &quot;Race crusaders have exploited the 1993 murder of black teenage Stephen Lawrence to boost their own power, it was claimed yesterday.&quot; The Sun. &quot;The recommendations of the Macpherson Report 'are likely to diminish rather than improve racial harmony', it is claimed today.&quot; The Daily Telegraph. &quot;The Home Office minister responsible for the police, Mike O'Brien, has argued that the term institutional racism is no longer appropriate to a police service that is attempting to change its ways...the liberal historian and journalist Michael Ignatieff makes the even better suggestion that what the police ought to concentrate on in the issue of competence, not racism.&quot; The Tablet.\n\n\nPaperback: 59 pages\nPublisher: Civitas:Institute for the Study of Civil Society (August 25, 2000)\nLanguage: English\nISBN-10: 1903386063\nISBN-13: 978-1903386064\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Institutional-Racism-Police-Fiction-Society/dp/1903386063/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Institutional-Racism-Police-Fiction-Society/dp/1903386063/&lt;/a&gt;\n\n\n\nTags: driving while black, abuse, torture, police, rodney, king, cpd, lapd, nypd, britain, MET, MEP, uk, britain, united kingdom, england,black, blacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery, ","torrent":{"xt":"urn:btih:b1b4a418faabd91f401499c66e6f4ece039827f6","amp;dn":"Institutional+Racism+and+the+Police%3A+Fact+or+Fiction+%5Bblackatk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1b4a418faabd91f401499c66e6f4ece039827f6","infoHashBuffer":{"type":"Buffer","data":[177,180,164,24,250,171,217,31,64,20,153,198,110,111,78,206,3,152,39,246]},"announce":[],"urlList":[]}}