{"title":"Eye Exercises – Eye Care Plus","uid":14367765,"size":17670765,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:b27c735fc22a0b6029c3b40f54f50bae7a7cb4d4&amp;dn=Eye+Exercises+%26ndash%3B+Eye+Care+Plus&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aman.nik","files":1,"time":1461130963,"description":"Personalized eye exercises presented as everyday vision therapy training plans designed to improve eyesight and prevent eye problems. The free eye tests will help to detect vision problems and track eyesight improvement. Provided information about eye health and eye conditions allows Eye Care Plus to come up with the best combination of eye exercises.\r\n• use 12 eye tests to check your vision\r\n• improve eye conditions and eliminate vision problems with 40+ eye exercises\r\n• learn about eye health and Ask a Doctor when in doubt\r\n\r\nVISION THERAPY\r\nEye Care Plus vision therapy is based on daily eye training plans and eye exercises that will help to preserve and improve your vision.\r\nDo you need vision therapy? It’s most likely that you do, as we all overload our eyes with computers, smartphones and books. We need eye exercises to train our eye muscles and improve our eyesight.\r\n\r\nTrain your eyes with Eye Care Plus if:\r\n• You spend long hours in front of a screen working, reading, studying, browsing or gaming. Eye exercises will help you relax your eyes and remove existing eye tension and fatigue.\r\n• You have eye problems such as nearsightedness, farsightedness, astigmatism, etc.\r\n• Your eyes get tired during the day. Personalized eye exercises in your daily training plan will help keep your eyes healthy and soothe redness, dry eye and pain.\r\n• Your profession requires ideal vision, e.g. you are a photographer, a pilot, a designer, a doctor, a jeweler, etc. Regular eye exercises will support good vision and help to avoid future eye problems.\r\n• You care about you and your family’s eye health and would like to prevent eye problems in future.\r\nHow does the vision therapy work?\r\nBasic daily vision training makes up a significant part of the vision therapy. It typically consist of three sets of eye exercises from the following categories:\r\n• Warm-up Eye Exercises\r\n• Relaxation Eye Exercises\r\n• Mind-Brain Exercises\r\n• Eye Muscles and Focus Exercises\r\n\r\nCollect 2000HP (Health Points) to unlock Special Vision Training Plans:\r\n• Dry eyes plan: consists of eye exercises for dry eye treatment\r\n• Bedtime plan: includes a set of eye exercises that help relax your eyes before sleep and have strong and fresh eyes in the morning","torrent":{"xt":"urn:btih:b27c735fc22a0b6029c3b40f54f50bae7a7cb4d4","amp;dn":"Eye+Exercises+%26ndash%3B+Eye+Care+Plus","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b27c735fc22a0b6029c3b40f54f50bae7a7cb4d4","infoHashBuffer":{"type":"Buffer","data":[178,124,115,95,194,42,11,96,41,195,180,15,84,245,11,174,122,124,180,212]},"announce":[],"urlList":[]}}