{"title":"Eddie Joyce-Small Mercies","uid":15392023,"size":324342455,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b2d96a9f974d6a9ef346db66b91a7fad9389e745&amp;dn=Eddie+Joyce-Small+Mercies&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twocows","files":11,"time":1469355764,"description":"\n\r\n&quot;Eddie Joyce's terrific first novel is so American that the story might as well have taken place at the base of the Statue of Liberty. His Amendola family and their beloved Staten Island may be flawed, but they represent what's best and most necessary in the American character, what our tired and poor still yearn for.&quot; —Richard Russo, Pulitzer Prize-winning author of Empire Falls\r\n\r\nA startling and tender portrait of one family's struggle to make peace with their son's death\r\nAn ingeniously layered narrative, told over the course of one week, Eddie Joyce's debut novel masterfully depicts an Italian-Irish American family on Staten Island and their complicated emotional history. Ten years after the loss of Bobby—the Amendola family's youngest son—everyone is still struggling to recover from the firefighter's unexpected death. Bobby's mother Gail; his widow Tina; his older brothers Peter, the corporate lawyer, and Franky, the misfit; and his father Michael have all dealt with their grief in different ways. But as the family gathers together for Bobby Jr.'s birthday party, they must each find a way to accept a new man in Tina's life while reconciling their feelings for their lost loved one.\r\n\r\nPresented through multiple points of view, Small Mercies explores the conflicts and deep attachments that exist within families. Heart-wrenching and profoundly relatable, Joyce's debut is a love letter to Staten Island and a deeply affecting portrait of an American family","torrent":{"xt":"urn:btih:b2d96a9f974d6a9ef346db66b91a7fad9389e745","amp;dn":"Eddie+Joyce-Small+Mercies","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2d96a9f974d6a9ef346db66b91a7fad9389e745","infoHashBuffer":{"type":"Buffer","data":[178,217,106,159,151,77,106,158,243,70,219,102,185,26,127,173,147,137,231,69]},"announce":[],"urlList":[]}}