{"title":"EliteFTS.com - Exercise Index - Bench Press","uid":6552344,"size":650817898,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b31831753cc235196a03bb1fb927291a88db130c&amp;dn=EliteFTS.com+-+Exercise+Index+-+Bench+Press&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ardacor","files":1,"time":1311156251,"description":"We all know the squat and deadlift are great indicators of strength but no one ever asks what you do in those lifts. It's all about the bench press. \n\n\n EFS breaks down the bench press, the technique of the bench press, the set up and how to get the most pounds while lying on your back. Also, every max effort, supplemental and accessory movement is explained and shown how to do. If you have any questions on HOW to do any upper body lift, then get this DVD. Don't be left behind. \n\n\n\n What was that? \n\n\n I'd like to comment on the Bench Press and Squat/DL exercise index DVDs. A few months ago I got the bench dvd and the technique portion of the vid was unbelievably helpful. Before I had no real bench press form, I only knew to keep my back flat and arms tucked. Since watching it numerous times and through practice, I've managed to develop a decent arch, use leg drive, set up/grip properly, and press in a good grove while decreasing my &quot;stroke&quot;(lol) from a good foot-and-a-half to under 12&quot; (estimated). \n\n I just got done watching the Squat/DL for the first time today and it was even better. I look forward to using some of the tips on technique during the upcoming ME and DE workouts in the future. Hopefully I'll find it to be as beneficial to my squat and dead as the bench press index was for my upper body. \n\n These DVDs are by far the best powerlifting instructionals I've seen, even better than the WSB secrets and workouts (I have them all). Does EliteFTS have any plans on coming out with other DVDs that are training related? I know a ton of stuff has been covered in the two you currently sell, but I'm sure you could think of something useful. \n\n Great job, guys.\n Clint Thompson\n\n\n\nProduct Features \n90 minutes long\nDVD format only\nBench Press Technique\nBoard Press\nFloor press (w/ chains/bands)\nJM Press\nDumbbell work\nAll Lat and upper back training\nAnd much, much more...","torrent":{"xt":"urn:btih:b31831753cc235196a03bb1fb927291a88db130c","amp;dn":"EliteFTS.com+-+Exercise+Index+-+Bench+Press","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b31831753cc235196a03bb1fb927291a88db130c","infoHashBuffer":{"type":"Buffer","data":[179,24,49,117,60,194,53,25,106,3,187,31,185,39,41,26,136,219,19,12]},"announce":[],"urlList":[]}}