{"title":"Natacha Atlas","uid":3351571,"size":196460585,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b34ac6fdc79d3964cd9d41d254f2423cdf424a56&amp;dn=Natacha+Atlas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ulyana Gordon","files":50,"time":1120369586,"description":"North African and Arabian music is given a modern, dance-inspiring, twist by Brussels-born and Washington, D.C.-based vocalist Natacha Atlas. A former singer for technopop band, Transglobal Underground, and an occassional collaborator of Jah Wobble, Atlas has continued to explore the fusion of her musical roots with western electronic, dance music. While &quot;Option&quot; magazine explained, &quot;(Atlas) has a beautiful voice, which sounds curiously like a blend between traditional Middle Eastern singers and Elizabeth Fraser of the Cocteau Twins&quot;, &quot;The Wire&quot; wrote, &quot;buoyed by her devotional calling and the chatter of programmed beats, she swoops, glides and goes reaching for the heavens in a way that needs no translation&quot;. &quot;CMJ New Music&quot; praised her for having &quot;explored the far reaches of the ethnotechno spectrum&quot;. \n\nThe daughter of an English mother and a Sephardic Jew father, Atlas grew up in a Moroccan suburb of Brussels and was heavily influenced by the Arabic culture. In addition to learning to speak French, Spanish and Arabic, Atlas was trained in the traditional techniques of raq sharki or belly dancing. Moving to England as a teen, Atlas quickly attracted attention as the first Arabic rock singer in Northampton. \n\nDividing her time between England and Brussels, Atlas sang in Arabic and Turkish clubs and appeared briefly with a Belgian salsa band, Mandanga. In the early 1990s, Atlas became involved with England's alternative rock scene, appearing on Loca!'s single, &quot;Timbal,&quot; Apache Indian's single, &quot;Arranged Marriage,&quot; and Jah Wobble's album, Rising Above Bedlam, which included five songs she had co-written. Accepting an invitation to join Transglobal Underground, as lead singer and belly dancer, Atlas was featured on the band's albums, Dream Of 100 Nations and International Times. Atlas continued to work with Wobble, as well, co-writing and singing on three tunes from Wobble's album, Take Me To God, in 1994. Atlas' debut solo album, Diaspora, released in 1995, featured accompaniment by Tunisian singer-songwriter Walid Rouissi and Egyptian composer and oud player Essam Rashad. Halim followed in 1997 and Gedada in 1999. Atlas worked with soundtrack composer David Arnold on the score of the Kurt Russell film, Stargate. In 2000 she released a collection of remixes of her life's work thus far. Ayeshteni appeared the following spring. Something Dangerous appeared in 2003 with a slicker and more pop-oriented sound. The career-spanning Best of Natacha Atlas was released in 2005. \n","torrent":{"xt":"urn:btih:b34ac6fdc79d3964cd9d41d254f2423cdf424a56","amp;dn":"Natacha+Atlas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b34ac6fdc79d3964cd9d41d254f2423cdf424a56","infoHashBuffer":{"type":"Buffer","data":[179,74,198,253,199,157,57,100,205,157,65,210,84,242,66,60,223,66,74,86]},"announce":[],"urlList":[]}}