{"title":"Indian.Hill.Railways--BBC-2010-w.subs-468p","uid":13937945,"size":1687091762,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b3bc1be16745d65d6bae78836c4c88aefe9a365e&amp;dn=Indian.Hill.Railways--BBC-2010-w.subs-468p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"uggauga","files":6,"time":1458442997,"description":"\nIndian Hill Railways\r\n\r\nThree-part series looking at the little trains have climbed through the Indian clouds for a hundred years, from the Himalayas in the north to the Nilgiris in the south\r\n\r\nBBC (2010) - 3 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/b00qzk9r\r\n_______________________________________\r\n\r\n832x468 resolution\r\n\r\nVideo Codec h.264\r\nAudio Codec AAC\r\n\r\nWith subtitles - enjoy !!\r\n_______________________________________\r\n\r\nThe Darjeeling Himalayan Railway - Episode 1 of 3\r\nFrom the Himalayas in the north to the Nilgiris in the south - for a hundred years these little trains have climbed through the clouds and into the wonderful world of Indian hill railways.\r\nThe Darjeeling Himalayan Railway is a line so close to the people that it flows like a river through their lives. The relationship between the train and the people is changing, however, as a new generation of Gurkhas populates these hills, demanding an independent state and fighting for a new identity as they journey into the modern Indian world.\r\n\r\nThe Nilgiri Mountain Railway - Episode 2 of 3\r\nFrom the Himalayas in the north to the Nilgiris in the south - for a hundred years these little trains have climbed through the clouds and into the wonderful world of Indian Hill Railways.\r\nThe Nilgiri Mountain Railway is a romantic line, popular with honeymooners and driven by love and devotion as well as steam. It chugs through the south Indian jungle up to a hill station, once known as Snooty Ooty.\r\nThe current guard is Ivan. Married for twenty years, he is concerned about his friend Jenni, the ticket inspector, because he's still a bachelor - but Jenni has a secret.\r\nIn the engine shed, Shivani, the railway's first female diesel engineer, is working on a steam loco. She has to make it look its best, as in the year of filming, 1999, the railway celebrated its centenary. The high point is the Black Beauty competition to pick the best engine on the line, but rains and landslides threaten the proceedings and the tourist business. Will love win out in the end?\r\n\r\nThe Kalka-Shimla Railway - Episode 3 of 3\r\nFrom the Himalayas in the north to the Nilgiris in the south - for a hundred years these little trains have climbed through the clouds and into the wonderful world of Indian hill railways.\r\nShimla was once the summer capital of the Raj. They built churches, schools, a town hall and the railway and left behind their symbols of empire and an ethos of duty, loyalty and ambition - but they also left a divided subcontinent.\r\nCharacters featured include Maqsood, a refugee and a porter from Kashmir, and John Whitmarsh-Knight, a teacher looking for a home. Sanjay the station master is hoping for promotion and his boss Bataljit is waiting for a transfer, but everybody is waiting for the snow","torrent":{"xt":"urn:btih:b3bc1be16745d65d6bae78836c4c88aefe9a365e","amp;dn":"Indian.Hill.Railways--BBC-2010-w.subs-468p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3bc1be16745d65d6bae78836c4c88aefe9a365e","infoHashBuffer":{"type":"Buffer","data":[179,188,27,225,103,69,214,93,107,174,120,131,108,76,136,174,254,154,54,94]},"announce":[],"urlList":[]}}