{"title":"Lark. 3 albums: Mouth of me, Razbliuto, Gong Is Struck","uid":8395288,"size":170331978,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b49a93e165f32c0c0b07ef4c0508c85bce4cdaa9&amp;dn=Lark.+3+albums%3A+Mouth+of+me%2C+Razbliuto%2C+Gong+Is+Struck&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wilsoonx","files":31,"time":1366554236,"description":"Lark\n\nLark was originally started as Inge Beckmann's solo project which was produced by Paul Ressel (also known as The Humanizer). While recording they met Simon &quot;Fuzzy&quot; Ratcliffe, who was the sound engineer and session musician at Sound &amp; Motion Studios working on their recordings. While recording they asked Fuzzy to join the band. Lark then consisted out of Beckmann on vocals, Ressel on electronics (sequencers, analog systems and laptop) and Ratcliffe on bass (upright and electric) and woodwinds. These sessions soon turned into the band's debut, Mouth of Me. They started gigging in April 2003. The band won several awards including best South African alternative album.[citation needed] Despite its international success and loyal fanbase, the band was surprisingly not scheduled for Coke Fest 2008 in Johannesburg, which was considered the essential step to achieve international publicity.\n\nMouth of Me\n\nAfter their first few gigs, they recruited popular session musician Sean Ou Tim on drums and entered Sound &amp; Motion Studios in Cape Town, where they held the sessions for their first full-length album, &quot;Mouth of Me&quot;.\n\nThe album contained massively popular tracks including Tricksy and Moonlight which were accompanied by a stunningly produced music video for Moonlight. Introduction to the mainstream population was given a boost when the Moonlight video was added to the play list of MK89 (&quot;Musiek Kanaal&quot; on Satellite TV provider DSTV channel 89), where it was accepted with open arms due to the more demure tone of the track and it's visually stunning video.\n\nRazbliuto\n\nAfter the success of Mouth Of Me, the group produced their second album named Razbliuto. Razbliuto was released in August 2006 to rave reviews from newspapers The Sunday Times and the The Star.\n\nIn April 2007, the album won a SAMA for &quot;Best Alternative Album&quot;. During the last quarter of 2007, Lark performed tracks from this album to a very excited crowd at the biggest event of the biannual Oppikoppi festival. Their performance was one of the biggest attractions and most celebrated of the 2007 event, leaving the overwhelmed crowds wanting more.\n\nEtc.","torrent":{"xt":"urn:btih:b49a93e165f32c0c0b07ef4c0508c85bce4cdaa9","amp;dn":"Lark.+3+albums%3A+Mouth+of+me%2C+Razbliuto%2C+Gong+Is+Struck","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b49a93e165f32c0c0b07ef4c0508c85bce4cdaa9","infoHashBuffer":{"type":"Buffer","data":[180,154,147,225,101,243,44,12,11,7,239,76,5,8,200,91,206,76,218,169]},"announce":[],"urlList":[]}}