{"title":"POtHS 3 - Bible Movies - 24 - In The Beginning &amp; Creating an","uid":6746902,"size":2980238976,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b4beca9cd69eb910352e64aec9004eb8366800ba&amp;dn=POtHS+3+-+Bible+Movies+-+24+-+In+The+Beginning+%26amp%3B+Creating+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":5,"time":1318727952,"description":"\n\n\n\nPOtHS\nPouring Out the Holy Spiritruth\n\n\n           Download the New - &quot;Conspiracy Facts&quot; Series                        \nSIN-ister Secrets      \nThis is one of 3 NEW Series by GGHG\n\n\n\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n\n\nPOtHS 3 - Bible Movies - 24 - In The Beginning &amp; Creating an Event in Heaven\n\n\n\n\n\n\nPOtHS 3 - Bible Movies - 24 - In The Beginning &amp; Creating an Event in Heaven\n\n\n\n\nPOtHS Comments on This one: Not Bad\n\n\nDiscription\n\n\nOriginally a 4-hour miniseries for NBC, with a large international cast of well-known actors, this telling of parts of the first five books of the Bible is interesting, and on the whole flows well, though it crams a lot of story into one film, therefore skipping many major events.\nIt starts with Abraham, as he travels to the land of Canaan, in about 2000 B.C., and along the way he recites the narrative of the Creation (which has some nice visuals), the Garden of Eden, Adam and Eve, their temptation (the fruit here looks more like a small fig in a very thorny tree) and their expulsion from Eden.\n\nThere are some fine performances, among them Martin Landau as Abraham, Jacqueline Bisset as Sarah, Bill Campbell as Moses, Amanda Donohoe as Potiphar's wife, and Fred Weller as Jacob. Eddie Cibrian as Joseph seems at first out of place, looking more like a modern day hunk, but he grows with the part, and has the most touching scene in the film, when he is reunited with his father Jacob. In the small part of Jethro, the great Alan Bates is marvelous. Other name actors include Diana Rigg (mature Rebeccah), Geraldine Chaplin (Yocheved), David Warner (Eliezer), and Christopher Lee is a theatrical, entertaining Ramses I.\n\nAt times there's quite a bit of license taken with scripture (for instance, there is some incredulous dialogue between Moses and Jethro after the parting of the sea, where Moses doesn't seem to have much faith in God), and similar to other TV Bible films, the parts that take place in Egypt are full of gaudy sets and costumes, as well as some characters who have an almost Alice Cooper look in the makeup department, especially Pharaoh's magician (Victor Spinetti).\nFilmed in Morocco, with lovely cinematography and score, this one is certainly worth a rental if you like Bible epics.\n\nWhat's in This Folder: Creating an Event in Heaven\n\n\nJesus and The Holy Spirit are alive and Well, that is The Truth.\n\nMy name is Mickey and I with the help of the Holy Spirirt created the POtHS Series.\n\nI released this amateurish video before watching it. (I think I look terrible,)The Words and Video did not sync in The Gospel Videos, my apologies.\n\nThis is my Testimony for the dozen or so Supernatural Happenings that I have been Blessed enough to personally experience and witness with Jesus and the Holy Spirit\nThey started happening on The Island of Kauai in 2005. Since then there have be a dozen or so happenings. A few visions, but mainly real life experiences.\n\nI do not expect any of you to believe me. If someone would have told me these stories 10 years ago, I would have laughed and not believed a Word. What I have come to learn is that it is NONE of my business what you think, so think what you want. I can only tell you that what you are about to here is 100% Truth, except for a couple speech errors. (I said 3 instead of 11 one time). Enjoy\n\nMany Thanks to the 2 Gospel Groups that I used in This Video:\nThe Rance Allen Group - http://www.theranceallengroup.com/\nThe Canton Spirituals -\nThis is dedicated to my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\n\nThe Entire Collection can be found here: \n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe That The Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed..\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...\n\nMay Yahweh Bless You as He has me. Seed Long and Prosper from the Blessings of our Lord. I have asked the Father to Bless all those that Seed Long.  \n\nDo Not believe anything you find here, search the Scriptures daily to determine the tRUtH.    \n\n\nGet info on the Take Over by The New World Order Below\n\n &lt;a href=&quot;\nhttp://www.khouse.org/topical_bible_study&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouse.org/topical_bible_study&lt;/a&gt;                                                         Free online Bible Study &lt;a href=&quot;\nhttp://www.babylonthegreatisfalling.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.babylonthegreatisfalling.net&lt;/a&gt;                                                                End Times Prophecy - Who is Babylon the Great &lt;a href=&quot;\nhttp://www.hickoryhammockbaptist.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hickoryhammockbaptist.org&lt;/a&gt;                                                                Pastueur Carl Gallops\n                                                                                       Listen to Alex Jones   Secular Truth &lt;a href=&quot;\nhttp://www.theberean.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theberean.org/&lt;/a&gt;                                                                                    Daily Bible Study in Your Email &lt;a href=&quot;\nhttp://www.khouseafrica.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.khouseafrica.com/&lt;/a&gt;                                                                               Chuck Missler - Africa &lt;a href=&quot;\nhttp://www.store.khouse.org/store/catalog&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.store.khouse.org/store/catalog&lt;/a&gt;                                                          Chuck Missler - USA &lt;a href=&quot;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.efoodsdirect.com/winter/?ait=13&amp;adit=79&lt;/a&gt;                                        Dehydrated Survival Food -  Excellent Taste &lt;a href=&quot;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.khouse.org/store/catalog/help/pacific_rim.html?it=C3sphAod&lt;/a&gt;       Chuck Missler - New Zealand, Australia, Pacific Rim\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n           \n      (thankyou) :thankyou:    (thankyou) :thankyou:     Thank You JESUS    \n\n\n\n\n\n\n\n\n\n                   \n                 \n","torrent":{"xt":"urn:btih:b4beca9cd69eb910352e64aec9004eb8366800ba","amp;dn":"POtHS+3+-+Bible+Movies+-+24+-+In+The+Beginning+%26amp%3B+Creating+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4beca9cd69eb910352e64aec9004eb8366800ba","infoHashBuffer":{"type":"Buffer","data":[180,190,202,156,214,158,185,16,53,46,100,174,201,0,78,184,54,104,0,186]},"announce":[],"urlList":[]}}