{"title":"Del Shannon - The Liberty Years (1991)","uid":8670232,"size":445716384,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b59b9111adec0ef80abc14c89ca0834c52002c3f&amp;dn=Del+Shannon+-+The+Liberty+Years+%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":34,"time":1373482263,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nDel Shannon - The Liberty Years (1991)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/31bIroOQZ6L._SL500_AA300_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/31bIroOQZ6L._SL500_AA300_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com) DVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nHas cover art only.\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by Richie Unterberger):\n\nOne of the best and most original rockers of the early '60s, Del Shannon was also one of the least typical. Although classified at times as a teen idol, he favored brooding themes of abandonment, loss, and rejection. In some respects he looked forward to the British Invasion with his frequent use of minor chords and his ability to write most of his own material. In fact, Shannon was able to keep going strong for a year or two into the British Invasion, and never stopped trying to play original music, though his commercial prospects pretty much died after the mid-'60s.\n\nRead all of the bio at: &lt;a href=&quot; http://www.allmusic.com/artist/del-shannon-p5407/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/artist/del-shannon-p5407/biography&lt;/a&gt;\n\nAll Music Album Review (by Bruce Eder):\n\nDel Shannon was on Liberty Records from 1966 through 1973, a period in which he was in commercial eclipse, barely brushing the lower regions of the charts with &quot;The Big Hurt&quot; and his version of &quot;She,&quot; the latter a tune most closely associated with the Monkees. The 26 songs here represent most of the better tracks from this period, including some wonderfully ambitious rock &amp; roll early on, mostly built around big tunes, solid guitar hooks, and seriously impassioned vocals. Some of the early material here, such as the rockers &quot;Show Me&quot; and &quot;For a Little While,&quot; are rivals to Shannon's classic early-'60s sides for their sheer animation and memorable hooks, and why they didn't attract more sales is a mystery. The ballads, including &quot;I Got It Bad (Never Thought I Could)&quot; and &quot;Hey! Little Star,&quot; are a little more problematic -- Shannon's vocal range was somewhat limited, and except on the occasions when he had an exquisite tune to work with, such as &quot;I Go to Pieces&quot; (an original that he didn't even think of recording himself at first), he was usually at his best working behind a dance beat, sharing the spotlight with an animated guitar part and Max Crooks' musitron. Once in a while, as on &quot;Under My Thumb,&quot; he could challenge Mick Jagger in the realm of macho posturing, and he did get better as a singer as he went along. None of the slower stuff here is bad -- some of it lacks excitement, or the dramatic tension to carry it off completely, and the dense musical textures on certain tracks may also have been off-putting to radio programmers; in that regard, it's possible that Shannon was produced too well for his own good by the likes of Leon Russell, Snuff Garrett and others. Even &quot;She&quot; buries the singing just a bit too much beneath the heavy organ and rhythm guitar accompaniment, to compete with the Monkees' rendition, which sounds warmer and more passionate. A lot of the transitional psychedelic era material, however -- which was produced by Andrew Oldham -- including &quot;Cut and Come Again,&quot; &quot;My Love Has Gone,&quot; and &quot;Led Along,&quot; is great listening today, and his rendition of &quot;Life Is But Nothing&quot; is beautiful, even if it was unreleased until the mid-'70s. In all, this CD -- which is out of print as of 2002 -- is worth tracking down as the best anthology of Shannon's longest recording relationship with a single label, and for showcasing his least-known and most ambitious body of music. The sound is excellent, and the annotation is well-written and thoroughly detailed.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/album/the-liberty-years-r17839/review&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/the-liberty-years-r17839/review&lt;/a&gt;\n\nAmazon.com's page: &lt;a href=&quot; http://www.amazon.com/dp/B000008KMD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000008KMD&lt;/a&gt;\n\nTrack List:\n\n01. The Big Hurt\n02. Show Me\n03. I Got It Bad (Never Thought I Could)\n04. For A Little While\n05. Hey! Little Star\n06. Under My Thumb\n07. She Was Mine\n08. I Can't Be True\n09. She\n10. Stand Up\n11. The House Where Nobody Lives\n12. It's My Feeling\n13. Mind Over Matter\n14. Silently\n15. Cut And Come Again\n16. My Love Has Gone\n17. Led Along\n18. Life Is But Nothing\n19. Easy To Say\n20. Friendly With You\n21. He Cheated\n22. Runaway '67\n23. Thinkin' It Over\n24. Raindrops\n25. You Don't Love Me\n26. Leaving You Behind\n","torrent":{"xt":"urn:btih:b59b9111adec0ef80abc14c89ca0834c52002c3f","amp;dn":"Del+Shannon+-+The+Liberty+Years+%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b59b9111adec0ef80abc14c89ca0834c52002c3f","infoHashBuffer":{"type":"Buffer","data":[181,155,145,17,173,236,14,248,10,188,20,200,156,160,131,76,82,0,44,63]},"announce":[],"urlList":[]}}