{"title":"The American Breed - Lonely Side Of The City (1968)","uid":10211350,"size":71896675,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b5f3d97d269a2c534f0a6b17b7f4c759a3cbe155&amp;dn=The+American+Breed+-+Lonely+Side+Of+The+City+%281968%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lancestevens","files":14,"time":1400914917,"description":"The American Breed was a local Chicago '60s rock quartet from Cicero, IL, led by Gary Loizzo, that had several minor hits and one big one in the 60's. They scored a gold Top Ten hit in early 1968 with &quot;Bend Me, Shape Me.&quot; Later, drummer Andre Fischer and keyboard player Kevin Murphy were members of Rufus. \n\nThe group was formed in the southwest part of the Chicago area. Under the name of Gary &amp; the Nite Lites, they began to draw notice around Chicago. They managed to record one single, which had little success. In late 1966, the name of the group was changed to the American Breed, a name that was drawn from a hat that contained a number of suggestions. By this time the band consisted of Gary Loizzo on vocals and guitar, Chuck Colbert on bass, Al Ciner on guitar and Lee Graziano on drums. All of them had been born in the Chicago area. It was a racially integrated group and as such, a rather unusual thing at the time. Loizzo and Colbert had attended R&amp;B shows at places such as the Regal Show Club in Chicago and the influence of that experience would carry over to their music. \n\nThey became acquainted with members of other Chicago-area bands that were on the rise, such as the Ides of March, the Buckinghams, and Chicago Transit Authority. The American Breed, admirers of the music written by Carole King, did one-night shows at colleges, fairs and festivals and began sending out 16-millimeter films of their performances, which gained them more notice. \n\nThe American Breed worked with Dot Records and recorded for its subsidiary label known as Acta, working with Dot Records executives Morris Diamond and Kenny Myers. They put five records on the charts in 1967 and 1968, including I Don't Think You Know Me At All, Step Out Of Your Mind and Green Light. The group's biggest hit, Bend Me, Shape Me, reached number five early in 1968. By that time they had added Kevin Murphy on keyboards. The song had previously been recorded by an all-girl band known as the Shape, and it had been a hit on the British charts for the British group Amen Corner. It had also been recorded by the Outsiders after they had reached the top ten with Time Won't Let Me. Contributing to the success of the American Breed's version of Bend Me, Shape Me was the excellent arrangement of the song by the band's record producer, Bill Traut, who added horns among other changes. The song was written by Scott English and Larry Weiss, who individually had a hand in writing other hit songs such as Rhinestone Cowboy and Mandy. \n\nThe group was hot for a time, even moving to California for several weeks in order to take advantage of offers to appear on television shows hosted by entertainers such as Lloyd Thaxton, Dick Clark, Dick Cavett, and Joey Bishop. \n\nAs time went on the group changed; old members left and new members joined, and the name of the band changed several times. Eventually it evolved into Rufus featuring Chaka Khan. Gary Loizzo went on to write songs for The Hardy Boys television series. He started a recording studio in the Chicago area in 1977 that he still runs. He has worked with the popular rock band Styx since that time, and was still touring with them into the twenty-first century. \n\nBend Me, Shape Me was the biggest hit for the American Breed, and it is a song that is well known to those who enjoy the great music of the 60's. \n\n\n\nLonely Side of the City is the fourth and final studio album by the 1960s soul and pop group The American Breed, released in the fall of 1968. For their last album, the group decided to move more towards a soft rock approach. However, the group had all but fallen out of favor with the music public, and the album failed miserably. &quot;Walls&quot; was the only single released from the album, and, after releasing several more non-album singles, including the last official American Breed single, &quot;Can't Make It Without You&quot; (1970), the group officially disbanded, and later reorganized as soul/funk band Rufus.\n\n01 Always You  2:12  \n02 Love Is Just A State Of Mind  2:43  \n03 New Games To Play  2:21  \n04 Walls  2:30  \n05 I've Got To Get You Off My Mind  2:21  \n06 To Put Up With You  2:30  \n07 Another Bad Morning  2:55  \n08 What Can You Do When You're Lonely  3:10  \n09 River Of No Regrets  3:11  \n10 4 Partners In Life  3:06  \n11 Out In The Cold Again 2:39 \n","torrent":{"xt":"urn:btih:b5f3d97d269a2c534f0a6b17b7f4c759a3cbe155","amp;dn":"The+American+Breed+-+Lonely+Side+Of+The+City+%281968%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5f3d97d269a2c534f0a6b17b7f4c759a3cbe155","infoHashBuffer":{"type":"Buffer","data":[181,243,217,125,38,154,44,83,79,10,107,23,183,244,199,89,163,203,225,85]},"announce":[],"urlList":[]}}