{"title":"We Love Stock Aitken Waterman Vol 1 2010(@SSDJ)","uid":6015509,"size":221302411,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ba0c8ed2a511aca71fa3764b776d1b7a72b2c083&amp;dn=++We+Love+Stock+Aitken+Waterman+Vol+1+2010%28%40SSDJ%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"michelinman","files":25,"time":1291625026,"description":"[img]http://ecx.images-amazon.com/images/I/61L0JYFTX6L._SL500_AA300_.jpg[/img]\n\n# Audio CD (1 Nov 2010)\n# Number of Discs: 2\n# Format: Double CD\n# Label: Almighty Records\nMIKE STOCK, MATT AITKEN and PETE WATERMAN were the absolute best pop masters, record producers and songwriters of the late 80's and early 90's! This unbeatable trio has had MORE THAN 100 UK TOP 40 HITS, selling OVER 40 MILLION RECORDS and bringing us KYLIE, JASON, SONIA, RICK ASTLEY and DONNA SUMMER!\nAlmighty have featured both STOCK AITKEN WATERMAN and the PWL record label tracks, plus distinctive remixes commissioned for other companies and the most recent Stock and Waterman collaboration after the production trio's split - entitled 'THAT SOUNDS GOOD TO ME'!\nAn array of different production teams give 'WE LOVE STOCK AITKEN WATERMAN' an exciting and eclectic sound. With classic ALMIGHTY ANTHEM and ALMIGHTY DEFINITIVE mixes, alongside WAYNE G, MATT POP and CASTRO BOY mixes plus the new sounds of the T DANCE and HANDS IN THE AIR mixes, there's something for everyone in this UP-TO-DATE, yet still 80'S-INFLUENCED\nTAKE!\nFavourites include 'LOVE IN THE FIRST DEGREE', 'THIS TIME I KNOW IT'S FOR REAL' and the sought after 'HOW COULD HE DO THIS TO ME'. The latter, which went on to become one of the MOST POPULAR tracks from the Almighty cult classic album QUEER AS FOLK and the OFFICIAL CHANNEL 4 TV SERIES, has had an exciting new remix for 'WE LOVE STOCK AITKEN WATERMAN'\nalbum.\nAlmighty also couldn't forget KYLIE MINOGUE, especially after the success of Almighty's 'WE LOVE KYLIE' album! Kylie's debut single 'I SHOULD BE SO LUCKY' spent 5 WEEKS AT NO. 1 in the UK and as such was a must-have for this album, as was RICK ASTLEY's 'NEVER GONNA GIVE YOU UP' - the HIGHEST-SELLING SINGLE of its year!\nPacked full of classics and including NO. 1 hits such as 'NEVER GONNA GIVE YOU UP', 'I SHOULD BE SO LUCKY' and 'YOU'LL NEVER STOP ME LOVING YOU'; it's no wonder 'WE LOVE' THIS COLLECTION! \n[IMG]http://i896.photobucket.com/albums/ac169/pbf99/tr.gif[/IMG]\nDisc: 1\n1. Melanie Wilson - This Time I Know It's For Real (Almighty Anthem Radio Edit)\n2. Almighty Showgirls - That's What Love Can Do (Almighty Club Mix)\n3. Carolyn Winters - Never Gonna Give You Up (Almighty Radio Edit)\n4. Obsession - Movin' On (Wayne G &amp; Porl Young Club Mix)\n5. Belle Lawrence - You'll Never Stop Me Loving You (Almighty Anthem 12&quot; Mix)\n6. Almighty Boys - When I'm Good And Ready (Almighty Radio Edit)\n7. Almighty Showgirls - I Should Be So Lucky (Almighty Definitive Radio Edit)\n8. Tammy Haywood - How Could He Do This To Me (Almighty T Dance Mix)\n9. Cinnamon - Showin' Out (Almighty Radio Edit)\n10. Alisha King - The Love I Lost (Radio Edit)\n11. Almighty Boys - He Ain't No Competition (Matt Pop Club Mix)\n12. Natalie Browne - That Sounds Good To Me (Almighty Hands In The Air Mix)\nDisc: 2\n1. Carolyn Winters - Never Gonna Give You Up (Almighty Anthem Club Mix)\n2. Belle Lawrence - Love In The First Degree (Almighty Anthem Club Mix)\n3. Almighty Showgirls - That's What Love Can Do (Matt Pop Club Mix)\n4. Melanie Wilson - This Time I Know It's For Real (Almighty Anthem Club Mix)\n5. Almighty Boys - When I'm Good And Ready (Almighty Anthem Club Mix)\n6. Almighty Showgirls - I Should Be So Lucky (Almighty Anthem Club Mix)\n7. Almighty Showgirls - Turn It Into Love (Illusive Mix)\n8. Almighty Showgirls - Better The Devil You Know (Almighty 12&quot; Definitive Mix)\n9. Almighty Boys - He Ain't No Competition (Castro Boy Club Mix)\n10. Almighty Showgirls - What Do I Have To Do (Almighty 12&quot; Anthem Mix)\n11. Belle Lawrence - Love In The First Degree (Wayne G &amp; Porl Young Mix) \n[IMG]http://i896.photobucket.com/albums/ac169/pbf99/ENJOY.gif[/IMG]\n\n","torrent":{"xt":"urn:btih:ba0c8ed2a511aca71fa3764b776d1b7a72b2c083","amp;dn":"++We+Love+Stock+Aitken+Waterman+Vol+1+2010%28%40SSDJ%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba0c8ed2a511aca71fa3764b776d1b7a72b2c083","infoHashBuffer":{"type":"Buffer","data":[186,12,142,210,165,17,172,167,31,163,118,75,119,109,27,122,114,178,192,131]},"announce":[],"urlList":[]}}