{"title":"Lisa Marie Presley - To Whom It May","uid":5861659,"size":524048387,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ba88449ce0f5e1aa0c4271d82b18d05f0eeb74b3&amp;dn=Lisa+Marie+Presley+-+To+Whom+It+May+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ddawg","files":-1,"time":1285995727,"description":"\n &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/34/40/7807c0a398a09a958afcc110.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/34/40/7807c0a398a09a958afcc110.L.jpg&lt;/a&gt;\n\n\nTitle: To Whom It May Concern\nArtist: Lisa Marie Presley\nAudio CD (April 8, 2003) \nOriginal Release Date: April 8, 2003\nNumber of Discs: 1 \nGenre: Pop\nQuality: Lossless\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. S.O.B.\n02. The Road Between\n03. Lights Out\n04. Better Beware\n05. Nobody Noticed It\n06. Sinking In\n07. Important\n08. So Lovely\n09. Indifferent\n10. Gone\n11. To Whom It May Concern\n\n\nVideos Included:\n\nLights Out.mpg\nBehind Lights Out.mpg\n\n\nAmazon Review:\nBlessed -- or is it cursed?--with a visage that's a distinctly haunting echo of her father's, Lisa Marie Presley has either spent most of her adult life assiduously avoiding a music career or engaged in Machiavellian schemes to secure one, depending on your spin source. But here it is, informed by no small amount of tabloid-ready living (three failed marriages, including two bizarre years the King's daughter spent playing Princess of Pop to Michael Jackson) and a slate of modern record-biz heavy hitters. The album's first single, &quot;Lights Out,&quot; is a countryfied pop collaboration with Glen Ballard in which the singer's tough, bittersweet lyrics obliquely confront the daunting legacy of her father and the Memphis where her &quot;family's buried and gone.&quot; Her husky alto isn't the only thing that recalls Sheryl Crow; the bristling textures of Andy Slater (Wallflowers) and Eric Rosse (Tori Amos) are a veritable textbook of modern-rock techniques, wed to some smart cover choices that bolster her music's moody, introspective bent. But that gloss sometimes makes Presley seem like a guest artist on her own album, making one curious to hear her in the setting where her father was so often riveting: Alone in the spotlight. They don't call it the gene pool lottery for nothing.\n\nAllmusic Review:\nMuch has been made of the fact that Lisa Marie Presley didn't start her professional singing career until she was in her mid-30s, but let's face facts -- if you were the daughter of Elvis, you'd be in no rush to hear the criticisms and comparisons, either. To her credit, Lisa Marie doesn't shy away from her personal history on her 2003 debut album, To Whom It May Concern, sprinkling veiled and not-so-veiled references to her father and her marriages throughout the record, but where she really asserts her individuality is on the music. Pitched partway between flat-out commerciality and post-Alanis/Sheryl Crow ambition, it's a strange beast that lurches and stumbles as it finds its feet, which it does, but it might take a couple of listens to realize that the record is indeed front-loaded. This isn't immediately apparent because the production is overloaded, boasting layer upon layer of drum loops, keyboards, squealing and strumming guitars, backing vocals, and who knows what else. Once you get a lay of the land, its precision and business can be alluring, but it often is just a little too distracting, drawing attention away from Presley's surprisingly sturdy songs and her sexy, throaty voice, which are the two real selling points of the record. Though there are bluesy, gutsy elements to her singing and hints of roots rock, what makes it interesting is that this is placed within a commercial pop/rock setting. True, it's an overdressed setting, but the songs themselves are quite good, occasionally excellent (like the snarling opener, &quot;S.O.B.,&quot; and the Glen Ballard collaboration, &quot;Lights Out&quot;). This is a sharp, ambitious mainstream pop/rock album performed by a singer with real character -- thankfully, one that's surly, not sweet, since there's been too much sweetness from divas in the 2000s. There are stumbles: sometimes the songs don't catch hold, sometimes they sound too fussy, sometimes they sound underdeveloped. Even then, Lisa Marie remains an engaging presence, pushing the songs over their flaws, but she does wind up with more winners than losers here. Those who go in looking for clues to the King or just want to hear Elvis' baby daughter sing are those who will be the most disappointed, while those who would appreciate the record for what it is are the ones who would likely consider this too much of a novelty. Her debut would likely have faced that situation regardless of what kind of music she put out, but thankfully this is a strong, assured debut that sets her up for interesting things. Hopefully, she'll follow through on the promise next time around, and win over those who are still doubters this time around. \n \n","torrent":{"xt":"urn:btih:ba88449ce0f5e1aa0c4271d82b18d05f0eeb74b3","amp;dn":"Lisa+Marie+Presley+-+To+Whom+It+May+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba88449ce0f5e1aa0c4271d82b18d05f0eeb74b3","infoHashBuffer":{"type":"Buffer","data":[186,136,68,156,224,245,225,170,12,66,113,216,43,24,208,95,14,235,116,179]},"announce":[],"urlList":[]}}