{"title":"The Mars Volta Bedlam in Goliath 320","uid":3981846,"size":182204263,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bab78aaf34dead39487be1361554fbf89a3a0c6f&amp;dn=The+Mars+Volta+Bedlam+in+Goliath+320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Meatcoveredchrist","files":12,"time":1200595581,"description":"This Album Demands that you leave your body at the door and absolutely and fully allow your spirit to soar and your mind to dance in mystery as you try to uncover the mystery that these psychonautical sailors of the mind take you on a musical journey you won\\&amp;#039;t soon forget\n\n\nYES this is the FULL ALBUM almost 2 WEEKS before its release date.\nThis album came to me in a dream.\n\nIf you download this album and if you are moved by this album PLEASE purchase this album on its January 29th release date because there are so few albums of this quality that exist in this world today.\n\nFor a change my ears felt like they were being loved instead of RAPED\nMost music might as well just be Farting with the walkman on.\nThis is one of those shining glorious exceptions.\n\nThe genesis of The Mars Volta&amp;#039;s new album The Bedlam in Goliath is one of the weirdest stories in the history of modern music, a tale of long-buried murder victims and their otherworldly influence, of strife and near collapse, of the long hard fight to push &quot;the record that did not want to be born&quot; out into the world.\n\nOn a trip in Jerusalem, Cedric Rodriguez-Lopez purchased an archaic ouija-type talking board at a curio shop as a gift for Bixler-Zavala. They would return to their tour bus after shows to play with it during their 2006 tour with the Red Hot Chili Peppers, as it quickly became the band&amp;#039;s post-show ritual. Dubbed &quot;The Soothsayer&quot;, the board revealed stories, gave names and made demands, as the band was contacted by three different people who appeared in the form of one, whom was then referred to as &quot;Goliath&quot;. The more the band had interacted with &quot;The Soothsayer&quot;, otherworldly coincidences began plaguing the band&amp;#039;s experience writing and recording The Bedlam in Goliath: Deantoni Parks their current drummer at the time had quit mid-tour and left the band with financial troubles; Bixler-Zavala wound up needing surgery performed on his foot due to the shoes he had been wearing, forcing him to relearn how to walk post-surgery; audio tracks sporadically and literally disappeared off the screens; Rodriguez-Lopez&amp;#039;s home studio flooded and had been subject to multiple power outages; and the album&amp;#039;s original engineer had gone through a nervous breakdown, leaving behind all previous work with no notes as to where anything was.Rodriguez-Lopez was nearly on the brink of starting over from scratch, but instead kept on with the recruitment of Robert Carranza as the replacement engineer, along with assistance from Lars Stalfors and Isaiah Abolin. Midway through the recording sessions, Rodriguez-Lopez buried &quot;The Soothsayer&quot; as an attempt to undo the curse and halt the unforeseen tragedies, who ended the ordeal by swearing never to give away the whereabouts of its burial, and also asking the band not to speak of it again during the remainder of the album&amp;#039;s production\n\nBixler-Zavala incorporated themes and names into the lyrics that were taken from messages given by &quot;The Soothsayer&quot;, also including excerpts from poems that were found attached to the ouija, describing a love triangle between a woman, her daughter and a man. Each song reinterprets the relationship in some shape or form, and as a good luck charm to counteract the cryptic themes, Bixler-Zavala incorporated elements of the Afro-Caribbean religious tradition Santeria into the lyrics as a &quot;protective skin&quot; to protect the band.\n\nThe album ultimately serves as an attempt to artistically reverse their perceived bad luck by &quot;setting traps&quot; for the listeners to use as a way to undo what &quot;The Soothsayer&quot; had brought upon the band. To aid the concept, vinyl editions of the album contain the band&amp;#039;s own version of the ouija inside the gatefold","torrent":{"xt":"urn:btih:bab78aaf34dead39487be1361554fbf89a3a0c6f","amp;dn":"The+Mars+Volta+Bedlam+in+Goliath+320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bab78aaf34dead39487be1361554fbf89a3a0c6f","infoHashBuffer":{"type":"Buffer","data":[186,183,138,175,52,222,173,57,72,123,225,54,21,84,251,248,154,58,12,111]},"announce":[],"urlList":[]}}