{"title":"Vienna.New.Year's.Eve.Concert.2014.FEED.1080i.MPEG2-HDWTV","uid":9431067,"size":32875372940,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bacd11169a38478195c577be3222d39687eb6ea5&amp;dn=Vienna.New.Year%27s.Eve.Concert.2014.FEED.1080i.MPEG2-HDWTV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"linuxlove","files":1,"time":1388801632,"description":"The music always includes pieces from the Strauss familyÂ¡ÂªJohann Strauss I, Johann Strauss II, Josef Strauss and Eduard StraussÂ¡Âªwith occasional additional music from other mainly Austrian composers, including Joseph Hellmesberger, Jr., Joseph Lanner, Wolfgang Amadeus Mozart, Otto Nicolai (the Vienna Philharmonic's founder), Emil von Reznicek, Franz Schubert, Franz von SuppÂ¨Â¦, and Karl Michael Ziehrer. In 2009, music by Joseph Haydn was played for the first time: the 4th movement of his &quot;Farewell&quot; Symphony to mark the 200th anniversary of his death. There are traditionally about a dozen compositions played, with an interval halfway through the concert and encores at the end. They include waltzes, polkas, mazurkas, and marches. Of the encores, the first is often a fast polka. The second is Johann Strauss II's waltz The Blue Danube, whose introduction is interrupted by applause of recognition and a New Year greeting from the musicians to the audience. The last is Johann Strauss I's Radetzky March, during which the audience claps along under the conductor's direction. In this last piece, the tradition also calls for the conductor to start the orchestra as soon he steps onto the stage, before reaching the podium. The complete duration of the event is around two and a half hours.\n&quot;Gro?er Saal&quot; (Large Hall) of the Musikverein\n\nThe concerts have been held in the &quot;Gro?er Saal&quot; (Large Hall) of the Musikverein since 1939. The orchestra is joined by pairs of ballet dancers in selected pieces during the second part of the programme. The dancers come from the Vienna State Opera Ballet and dance at different famous places in Austria, as Sch?nbrunn Palace, Schloss EsterhÂ¨Â¢zy, the Vienna State Opera or the Wiener Musikverein itself. Since 1980 the flowers that decorate the hall have been a gift from the city of Sanremo, Liguria, Italy.","torrent":{"xt":"urn:btih:bacd11169a38478195c577be3222d39687eb6ea5","amp;dn":"Vienna.New.Year%27s.Eve.Concert.2014.FEED.1080i.MPEG2-HDWTV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bacd11169a38478195c577be3222d39687eb6ea5","infoHashBuffer":{"type":"Buffer","data":[186,205,17,22,154,56,71,129,149,197,119,190,50,34,211,150,135,235,110,165]},"announce":[],"urlList":[]}}