{"title":"Religions of the World - 1st and 2nd Edition (Pdf) Gooner","uid":12224284,"size":90351439,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bad5bf72b763578652480b65c85da4fd78ac22a5&amp;dn=Religions+of+the+World+-+1st+and+2nd+Edition+%28Pdf%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1439414136,"description":"Publisher: ABC-CLIO (September 2002)\nLanguage: English\nISBN-10: 1576072231\nISBN-13: 978-1576072233\n\nFrom the Aboriginal Cult of Maria Lionza in Venezuela to Zionist and Apostolic churches in South Africa and Zimbabwe, Religions of the World is the only comprehensive compilation of the world's existing major religious communities. This extraordinary four-volume survey examines the religious history and key religious communities in all 240 recognized nations and territories. More than 200 international experts contributed the 1,200+ entries covering each group's origin, history, organization, ecumenical contacts, and present status.\n\nOther entries focus on individual countries, surveying the current state of religious practice, supported by statistical data from leading religious statisticians David B. Barrett and Todd M. Johnson. The volumes place African independent churches, Japanese new religions, and surviving indigenous beliefs alongside Catholicism, Judaism, Christianity, and Islam. Illustrated and indexed, and including cross-references and end-of-entry bibliographic citations, this remarkable set is destined to become the primary reference source on religious issues throughout the world.\n\n\nPublisher: ABC-CLIO; 2 edition (September 21, 2010)\nLanguage: English\nISBN-10: 159884203X\nISBN-13: 978-1598842036\n\nReligions of the World, Second Edition: A Comprehensive Encyclopedia of Beliefs and Practices is an extraordinary work, bringing together the scholarship of some 225 experts from around the globe. The encyclopedia's six volumes offer entries on every country of the world, with particular emphasis on the larger nations, as well as Indonesia and the Latin American countries that are traditionally given little attention in English-language reference works. Entries include profiles on religion in the world's smallest countries (the Vatican and San Marino), profiles on religion in recently established or disputed countries (Kosovo and Nagorno-Karabakh), as well as profiles on religion in some of the world's most remote places (Antarctica and Easter Island).\n\nReligions of the World is unique in that it is based in religion &quot;on the ground,&quot; tracing the development of each of the 16 major world religious traditions through its institutional expressions in the modern world, its major geographical sites, and its major celebrations. Unlike other works, the encyclopedia also covers the world of religious unbelief as expressed in atheism, humanism, and other traditions","torrent":{"xt":"urn:btih:bad5bf72b763578652480b65c85da4fd78ac22a5","amp;dn":"Religions+of+the+World+-+1st+and+2nd+Edition+%28Pdf%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bad5bf72b763578652480b65c85da4fd78ac22a5","infoHashBuffer":{"type":"Buffer","data":[186,213,191,114,183,99,87,134,82,72,11,101,200,93,164,253,120,172,34,165]},"announce":[],"urlList":[]}}