{"title":"Pokey Quest I - So You Want to be a Penguin (RMXP)","uid":9900316,"size":67967413,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bb1c4c47a65feb28e5f10c53090640f0c1915241&amp;dn=Pokey+Quest+I+-+So+You+Want+to+be+a+Penguin+%28RMXP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Green.Banana","files":-1,"time":1396753285,"description":"Pokey the Penguin is a long-running online comic strip viewable at [url=http://www.yellow5.com/]Yellow5.com[/url]. Irreverent and strange, it is also classically witty. Pokey the Penguin is an educational children's cartoon! Pokey has fun and learning about the hazards of the arctic circle!  \n\nThis game is an unauthorized devotion to the aforementioned series. What it lacks in capturing the source material's je ne sais quoi it sort of makes up for in play length (though is still admittedly short). This project has journeyed in spirit from the days of RM95+. After much toiling, passing through RM2k and 2k3, it is now complete under the RMXP engine. I make no promises for this game's endearing qualities, but it sure is complete (save for a few scarce bugs) and nobody can take that away from it. \n\nPokey the Penguin has fun and adventures learning about the hazards of the arctic circle! Alas, change is inevitable, and not always for the sake of progress (just look at Google and social networking). Pokey awakens in his bathtub one day to realize something is amiss. His cereal is cold and his fence isn't painted. One by one, his liberties are being taken away by foreign interlopers! Witness Pokey tackle the controversies of foreign policy, alchemy, monstrous wildlife and the internet in his most coherent madness yet! \n\n&gt; You do not need the RTP\n&gt; If the game won't run, check the enclosed instructions regarding RTP.\n&gt; No affiliation with the source material or the artists of the enclosed materials.\n&gt; You are a child of the stars, no lesser than the trees. ","torrent":{"xt":"urn:btih:bb1c4c47a65feb28e5f10c53090640f0c1915241","amp;dn":"Pokey+Quest+I+-+So+You+Want+to+be+a+Penguin+%28RMXP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb1c4c47a65feb28e5f10c53090640f0c1915241","infoHashBuffer":{"type":"Buffer","data":[187,28,76,71,166,95,235,40,229,241,12,83,9,6,64,240,193,145,82,65]},"announce":[],"urlList":[]}}