{"title":"New Super Mario Bros NDS Rom {Angelus1609}","uid":9584151,"size":12042507,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:bba3cdfb2dd2c0365f6e4fb33fd34df21cfed023&amp;dn=New+Super+Mario+Bros+NDS+Rom+%7BAngelus1609%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Angelus1609","files":-1,"time":1391800338,"description":"Torrent Info:\n\nNewSuperMarioBros.nds is a Rom File. You will need a emulator to play this file. This game does work as I have tested it to ensure its working order. If you need an emulator I have one available here: http://thepiratebay.se/torrent/9580949/NDS_Emulator_with_Pokemon_Games\n\nGame Info:\n Twenty years after Nintendo's biggest franchise was born, the Mario Bros. return in a dazzling, all-new platformer sure to set players' fingers twitching. In New Super Mario Bros. for DS, fans from Mario's classic days will see their dreams answered in this return to the Mushroom Kingdom, while a new generation of Mario players will learn what true platforming greatness means. The game contains 80 levels of side-scrolling fun across 8 worlds and features multiplayer support both in wireless DS single-card download play and wireless DS multi-card play. \nStory\nThe storyline of New Super Mario Bros. is simple, but 100% classic Mario Bros. During a tranquil walk with Princess Peach, Mario witness a lightning strike on Peach's castle. Mario predictably races off to lend a hand, but no sooner has he stepped away from the always popular Peach, than he sees Bowser Jr. step into the picture and drag her away. As mario pursues them throughout both overworld and underworld, the appearance of Bowser and the Koopas shows that the list of fiends opposing him is longer than he expected. But Mario is not one to be put off by such things. Come along with Mario, Luigi and other friends as they venture into the depths of the Mushroom Kingdom to get Peach back once again.\n\nGameplay\nAlthough New Super Mario Bros. is a modern addition to the Mario Bros. tome, it revels in the fact that it is an old school side-scrolling platformer through and through. The single player mode is set on 80 levels spread across eight worlds, with players assuming the role of either Mario or Luigi. As in all Mario Bros. games, the ultimate goal is to rescue Peach, but as players traverse game levels the immediate goal is to collect coins, hop on top of enemies, and break open blocks while searching for power-ups as you race to capture the flag at the end of each level. Each of the game's eight worlds climaxes with a boss battle tied into the abduction of Peach, in which players will need to utilize the game's six power-ups in order to have success.\n\nAlong with its single player mode New Super Mario Bros. for DS also features two different multiplayer modes. The first is the Mario vs. Luigi, 2-player competitive mode. Here it's brother vs. brother in a literal race for Stars. Players choose to play as either Mario or Luigi, with the goal to collect the Stars that appear throughout the stage at timed intervals. If one brother gets a star(s) first they can be stolen away by the other player by doing damage. The one who gets to the set number of stars wins. This mode uses local wireless DS Single-Card download play, so only one game card is needed. The other multiplayer mode revolves around mini-game play. There are variety of these, which can be engaged in on a one-on-one basis, or in tournament fashion with 2-4 players.\n\nThe Power-ups.\nNew Super Mario for DS contains contains six power-up options. Three of these, the Super Mushroom, the Fire Flower and the Starman are back from previous games. There are also three entirely new to the game, these being: the Blue Koopa Shell, which Mario can crawl into to protect himself and spin when inside it to attack enemies; the Mega Mushroom, which allows for a huge Mario; and the Mini-Mushroom, which makes Mario very small and able to get into places that wouldn't otherwise be available.\n\nKey Game Features\n\n    Old-School Platforming Fun - Jump, bounce and power-up through visually stunning side-scrolling worlds filled with Mushroom Kingdom madness.\n    New Action - Grab a Mega Mushroom and grow to incredible proportions, or smash through your foes in a blue Koopa shell.\n    2 Distinct Multiplayer Modes - New Super Mario Bros. features competitive 2-player multiplayer and mini-game functionality supporting up to 4 players.\n    A Classic Storyline - Bowser and Bowser Jr. have kidnapped Princess Peach, again, and only Mario and you can save her.\n    Powerups Galore - You'll find classic power-ups, like the Super Mushroom and the Fire Flower in the game, as well as some all-new ones that let Mario explore the Mushroom Kingdom like never before.\n    New Moves - New Super Mario Bros. expands Mario's arsenal of moves to include some very powerful advanced techniques. If you want to uncover every secret in the game, you'll have to master them all.\n\n\n\n\nSize:\nCompressed - 11,759k/b\nDeCompressed - 32,768k/b\n\nThanks for downloading and hope you enjoy. Set Sail and Don't forget to SEED!!!","torrent":{"xt":"urn:btih:bba3cdfb2dd2c0365f6e4fb33fd34df21cfed023","amp;dn":"New+Super+Mario+Bros+NDS+Rom+%7BAngelus1609%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bba3cdfb2dd2c0365f6e4fb33fd34df21cfed023","infoHashBuffer":{"type":"Buffer","data":[187,163,205,251,45,210,192,54,95,110,79,179,63,211,77,242,28,254,208,35]},"announce":[],"urlList":[]}}