{"title":"Tad Williams - [Shadowmarch 04] - Shadowheart (Fantasy)","uid":5931797,"size":4686456,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bbc870595d95fb98918f691ce7fe61aa29e860ba&amp;dn=Tad+Williams+-+%5BShadowmarch+04%5D+-+Shadowheart+%28Fantasy%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kash79","files":-1,"time":1288805031,"description":"Tad Williams - [Shadowmarch 04] - Shadowheart (2010)\n\nEPUB,MOBI,LIT\n\nThe long-awaited concluding novel in Tad Williams's thrilling epic Shadowmarch series.\n\nSouthmarch Castle is about to be caught between two implacable enemies, the ancient, immortal Qar and the insane god-king, the Autarch of Xis. Meanwhile, its two young defenders, Princess Briony and Prince Barrick, are both trapped far away from home and fighting for their lives.\n\nAnd now, something is awakening underneath Southmarch Castle, something powerful and terrible that the world has not seen for thousands of years. Can Barrick and Briony, along with a tiny handful of allies, ordinary and extraordinary, find a way to save their world and prevent the rise of a terrible new age-an age of unending darkness?\n\nBarrick Eddon, prince of Southmarch, is no longer entirely human. He has vowed to safeguard the legacy of the dark Qar race, and must now decide where his loyalties lie. His twin sister Briony has a difficult choice of her own. Her father, King Olin, is held captive by the Autarch, a mad god-king who plans to use Olin's blood to gain unlimited power. And the castle of Southmarch still remains in the possession of Hendon Tolly, Briony's murderous relative. As time runs out, will Briony decide to save her father's kingdom ...or her father? As the foretold Great Defeat draws near, history is stripped of its costume of lies. Poets and players, mortals and fairies, warriors and gods, all will have their roles to play as the fate of the known world hangs in the balance. ","torrent":{"xt":"urn:btih:bbc870595d95fb98918f691ce7fe61aa29e860ba","amp;dn":"Tad+Williams+-+%5BShadowmarch+04%5D+-+Shadowheart+%28Fantasy%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbc870595d95fb98918f691ce7fe61aa29e860ba","infoHashBuffer":{"type":"Buffer","data":[187,200,112,89,93,149,251,152,145,143,105,28,231,254,97,170,41,232,96,186]},"announce":[],"urlList":[]}}