{"title":"Bashar - Building the Bridge","uid":8124186,"size":2879085553,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:bfa2abfc60acd0f3053b48b6121319603627154d&amp;dn=Bashar+-+Building+the+Bridge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":2,"time":1360455668,"description":"Bashar helps us prepare for the new higher frequencies coming in 2013 and beyond.\n\nQ&amp;A Includes: Could you comment on the &quot;we&quot; perspective and the individual perspective?  Taking action vs internal action. What is the percentage of humans that have been detained?  Do I have a connection with The Pleades and Lemuria?  Seeing a scary being in my dreams. What is the history of our solar system?  Is there a civilization inside the earth? Have ETs been in contact with government officials?  Are aliens living among us on earth?  What is the purpose of abductions?  What is the effect of monatomic gold on the human brain?  How can we accelerate contact?  Does my future self have a message for me? How can we remove the political polarization in our country? What does the triangle in the Pink Floyd album signify?  Redefining injury.  Are our higher minds the same thing as guides?  Where do aliens go when they die?  What are the vibrations of different languages?  Contacting a lover who passed.  What did Buddha mean when he said &quot;Words are supposed to lead one to silence&quot;?","torrent":{"xt":"urn:btih:bfa2abfc60acd0f3053b48b6121319603627154d","amp;dn":"Bashar+-+Building+the+Bridge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfa2abfc60acd0f3053b48b6121319603627154d","infoHashBuffer":{"type":"Buffer","data":[191,162,171,252,96,172,208,243,5,59,72,182,18,19,25,96,54,39,21,77]},"announce":[],"urlList":[]}}