{"title":"The Father Brown Mysteries  (Dramatized - 3 Stories)","uid":6715925,"size":57553032,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c0a4871bc1fe0d182d3534882c48e2665c17a2b6&amp;dn=The+Father+Brown+Mysteries++%28Dramatized+-+3+Stories%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rosie1966","files":3,"time":1317564794,"description":"Audio Books : Mystery : MP3/64Kbps : English\n \nThe Blue Cross, The Secret Garden, The Queer Feet, and The Arrow of Heaven: The Father Brown Mysteries (Dramatized)\nby G. K. Chesterton , M. J. Elliott \nNarrated by J. T. Turner, The Colonial Radio Players \nLength: 1 hour 59 minutes\n\nFrom London to Cornwall, then to Italy and France, a short, shabby priest takes on bandits, traitors and killers. Why is he so successful? The reason is that, after years spent in the priesthood, Father Brown knows human nature and is not afraid of its dark side. Thus he understands criminal motivation and how to deal with it. \n\n&quot;The Blue Cross&quot;: Father Brown is traveling to London to attend a meeting of priests, and he is carrying with him a priceless silver cross, studded with blue sapphires. Flambeau, the thief, plans to steal it. \n\n&quot;The Secret Garden&quot;: Father Brown is called to investigate the beheading of a man, committed in a closed garden. How did the murderer escape? \n\n&quot;The Queer Feet&quot;: Father Brown investigates a death at the Vernon Hotel. \n\n&quot;The Arrow of Heaven&quot;: Father Brown comes to the aid of a man receiving threatening letters, but he is unable to prevent him from being killed with an arrow.\n\nThese four radio dramas recapture the joy of the Father Brown mysteries. The Blue Cross, of course remains a favorite, and one of the most memorable detective stories of all time where the original readers had no idea who the detective was until the end of the tale. I will say that the end got a little messed up and elongated to accomodate linking it directly to, &quot;The Secret Garden.&quot; But such was the necessity of a regular broadcast. \n\nThat &quot;The Secret Garden&quot; and &quot;The Queer Feet&quot; were perfect pitched of the original stories and connected together well. They managed to capture the social commentary of the original very well in &quot;The Queer Feet.&quot; \n\n&quot;The Arrow of Heaven&quot; while not tying into the other three stories was still well-told and actually gently corrects an error by Chesterton. Chesteron in writing, &quot;The Arrow of Heaven&quot; described Father Brown as never having been to America, seeming to forget a decade before Chesterton wrote a short story describing Father Brown's time as a Prison Chaplain in Chicago. Authors perhaps weren't as fussy about continuity back there. In this play, the the Colonial Theater has Father Brown, rather than saying he'd never been in America, mention the time as a prison chaplain. Altogether, works well in an entertaining preformance. \n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:c0a4871bc1fe0d182d3534882c48e2665c17a2b6","amp;dn":"The+Father+Brown+Mysteries++%28Dramatized+-+3+Stories%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0a4871bc1fe0d182d3534882c48e2665c17a2b6","infoHashBuffer":{"type":"Buffer","data":[192,164,135,27,193,254,13,24,45,53,52,136,44,72,226,102,92,23,162,182]},"announce":[],"urlList":[]}}