{"title":"Twisted Sister - We're Not Gonna Take It (2nafish)","uid":5243673,"size":109312004,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c0b2a08a4cdc0823094fe15abd96e3e1975ddf3a&amp;dn=Twisted+Sister+-+We%5C%27re+Not+Gonna+Take+It+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1261898598,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n\nTwisted Sister - We're Not Gonna Take It (Live-Beat Club)  (2nafish)\n\n\n&quot;We're Not Gonna Take It&quot; is a 1984 hit song by the American glam metal/heavy metal band Twisted Sister from their album Stay Hungry. The song was first released as a single (With B-Side song &quot;You Can't Stop Rock &amp; Roll&quot;) on April 27, 1984. The Stay Hungry album was released two weeks later, on May 10, 1984. The single reached #21 on the Billboard Hot 100 singles chart, making it Twisted Sister's only Top 40 single. The song was ranked #47 on 100 Greatest 80's Songs and #21 on VH1's 100 Greatest One Hit Wonders of the 80s (coincidentally, it also charted at #21 on the Billboard Hot 100) .\n\nThe song was written by vocalist Dee Snider. As influences for the song, he cites the glam rock band Slade, the punk band Sex Pistols, and the Christmas carol, &quot;O Come, All Ye Faithful&quot;.\n\nThe song is notable for its popular music video directed by Marty Callner, with its emphasis on slapstick comedy, where a parent gets the worst of the band's mischief. Controversy arose when the depiction of the family in the video caused a public outcry long before the &quot;explicit lyrics&quot; warning was placed on records, cassettes, and CDs. This led to the formation of the Parents Music Resource Center. Mark Metcalf, the actor portraying the father in the video, had previously played Neidermayer, the ROTC student commander in National Lampoon's Animal House (1978). In a reference to his role in the film, Metcalf says &quot;A Twisted Sister pin? On your uniform?!&quot; in the video. Snider himself can also be heard cursing and swearing the question &quot;A pledge pin? On your uniform?&quot; at the end of the song. The actor portraying the teenager is Jeremy Sisto of the HBO series Six Feet Under, Clueless, Suicide Kings, and the t.v. series Law and Order.\n\nIn 1999, the US rock band Lit parodied the opening scene in their video for &quot;Zip Lock&quot;. The crazy father was played by Dee Snider.\n\nStay Hungry is the third album by American heavy metal band Twisted Sister. Released on May 10, 1984, the album features the band's two biggest hits, &quot;We're Not Gonna Take It&quot; and &quot;I Wanna Rock&quot; and the power ballad &quot;The Price.&quot;\n\nTwisted Sister performed the song &quot;Burn in Hell&quot; during a cameo appearance in the 1985 film Pee-Wee's Big Adventure. The song &quot;Burn In Hell&quot; was covered by black metal band Dimmu Borgir on Puritanical Euphoric Misanthropia. &quot;We're Not Gonna Take It&quot; was also covered by Bif Naked on the Ready to Rumble soundtrack. The two songs that comprise the Horror-Teria segment became the basis of Twisted Sister lead-singer Dee Snider's 1999 film Strangeland, in which Captain Howdy was played by Snider himself. The &quot;Captain Howdy&quot; segment of the &quot;Horror-teria&quot; suite would later be covered by the death metal group Broken Hope on their album Repulsive Conception.\n\nIn 2004, the band re-recorded the tracks from this album and re-released them under the title Still Hungry.\n\n\nMy Videos:\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n\n\n","torrent":{"xt":"urn:btih:c0b2a08a4cdc0823094fe15abd96e3e1975ddf3a","amp;dn":"Twisted+Sister+-+We%5C%27re+Not+Gonna+Take+It+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0b2a08a4cdc0823094fe15abd96e3e1975ddf3a","infoHashBuffer":{"type":"Buffer","data":[192,178,160,138,76,220,8,35,9,79,225,90,189,150,227,225,151,93,223,58]},"announce":[],"urlList":[]}}