{"title":"Collins French Dictionary v 3.2.104 By bobiras2009","uid":7600918,"size":654001,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:c1acf864efda354df961b5cb6d82f418d0889f29&amp;dn=Collins+French+Dictionary+v+3.2.104+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1346815278,"description":"                                   By bobiras2009\t\n\t\t\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\n\nRequirements: 2.0 and up\nOverview: Collins English-French-English dictionary with over 80,000 translations.\n\nCollins English-French-English dictionary with over 80,000 translations.\n\nIf you are starting to learn French, or want to extend your knowledge of the language the Collins French Dictionary is the ideal book to help you understand and communicate.\n\nThe dictionary has over 80,000 references, contemporary vocabulary, cultural equivalents, and notes on dialect. It is ideal if you're conducting business with French-speaking customers or colleagues. With Collins, you can trust each translation is correct.\n\nThe Foremost Authority on the Language of Today\n\n* Over 80,000 words, phrases and translations\n* Comprehensive and up-to- date coverage of all words and phrases you need, and French updated for the new spelling reform\n* In-depth treatment of difficult words\n* Cultural notes provide insight into the life in French-speaking countries\n\nWords are tools for life. And a Collins Dictionary makes them work for you.\n\nThe MSDict Dictionary Format\n\nThe Collins French Dictionary is here presented in MSDict electronic format. MSDict offers best experience in mobile reference and is available for any handheld platform.\n\n* Quick dynamic search of words while you type\n* Transcriptions facilitating pronunciation\n* Hyperlinks between different related words\n* History to see the last 50 words you have looked up\n* Support for memory cards\n* Filters to help you locate the word you are searching for:\no Fuzzy filter- used when you are not sure of the correct spelling of a word\no Keyword-used to locate the instances of a key word within other compound words\no Wild card - &quot;?&quot; and &quot;*&quot; replace a letter and group of letters in words\n* Fast article scrolling\n* Ability to have dictionary Word of the day as a widget on the phone home screen\n* Ability to search words in the installed dictionaries through the standard phone search feature\n\n                                   By bobiras2009\t","torrent":{"xt":"urn:btih:c1acf864efda354df961b5cb6d82f418d0889f29","amp;dn":"Collins+French+Dictionary+v+3.2.104+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1acf864efda354df961b5cb6d82f418d0889f29","infoHashBuffer":{"type":"Buffer","data":[193,172,248,100,239,218,53,77,249,97,181,203,109,130,244,24,208,136,159,41]},"announce":[],"urlList":[]}}