{"title":"Resurrection_1980.mp4","uid":4412181,"size":903287483,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c24f4d086926aedd9dfff38689bd4277a86daf31&amp;dn=Resurrection_1980.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sugarb","files":1,"time":1222311318,"description":"Resurrection (1980) - Ellen Burstyn\nhttp://www.imdb.com/title/tt0081414/\n\nVHS Rip - fair quality\nRare movie not available anywhere else.\n\nThis file encoded with MPEG Streamclip from a so-so VHS conversion with poor audio-visual sync. Jittery superfluous borders were cropped, timecode breaks repaired, and a bit more saturation added to what was likely a fairly worn tape. Sync repaired to watchable, if a bit challenged, and varies during the film. Best I could do with what I had to work with.\n \nFormat: h264\nSize: 432 x 320\nFramerate: 29.97\nRun Time: 103 minutes\nAudio Format: mpeg4aac 48000Hz\nScreenwriter: Lewis John Carlino (The Great Santini)\nDirector: Daniel Petrie (A Raisin In The Sun)\n\n\nThis little movie features one of Ellen Burstyn's finest performances.\n\nWarning: spoilers in the following synopsis.\nAfter a car crash leaves her paralyzed and widowed, Edna McCauley (Ellen Burstyn) returns to her small hometown in Kansas to recuperate with her loving grandmother and curmudgeonly father. Gradually discovering that she has been endowed with the ability to heal, Edna begins using her new powers, but insists on attributing them to the power of human love rather than to divine intervention, a belief that does not go over well with some in her Bible-belt hometown. Her boyfriend (Sam Shepard), whose life she has saved, insists that she confess that her powers come from God, and when Edna is unable to do so, this conflict leads to a chilling confrontation and the end of their affair. \nUltimately, Edna breaks free of the rigid and emotionally repressed men that surround her. The final luminous scene takes place many years later.\n\nThe supporting cast is outstanding, especially Roberts Blossom as Edna's harsh father, Eva Le Gallienne as Grandma Pearl, and Robert Farnsworth as Esco in a wonderful bit part that takes on added importance at the story's end. \n\nBoth Ellen Burstyn and Eva Le Gallienne (as Burstyn's grandmother) were nominated for Academy Awards.\n","torrent":{"xt":"urn:btih:c24f4d086926aedd9dfff38689bd4277a86daf31","amp;dn":"Resurrection_1980.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c24f4d086926aedd9dfff38689bd4277a86daf31","infoHashBuffer":{"type":"Buffer","data":[194,79,77,8,105,38,174,221,157,255,243,134,137,189,66,119,168,109,175,49]},"announce":[],"urlList":[]}}