{"title":"Petworld.3D.My.Animal.Rescue.v1.8.Android","uid":8395804,"size":32174474,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:c2570eb6c4ce692b6f1402b47a0b13f410d1b6b0&amp;dn=Petworld.3D.My.Animal.Rescue.v1.8.Android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JayHorror","files":1,"time":1366570295,"description":"\n\n&quot;Help care for adorable creatures and find them the perfect owners. The game includes fantastic 3D environments and loads of interactive items.&quot;\n\nâ˜… ANIMAL CARE â˜…\n\nMany of your rescues didn't always have it easy in their lives, but luckily they at least found their way to you. After an initial examination to determine current health conditions and to establish any necessary treatment, life in the animal rescue can begin. Take care of your little friend with food and water and make sure that they always have fresh litter. When they have everything they need, pretty soon they'll feel fit as a fiddle again!\n\nâ˜… FIND A NEW HOME â˜…\n\nOf course the animals are in the best possible hands with you, but they do eventually need a real home. As soon as the head of the animal rescue, a grumpy professor, puts you in charge of the animal adoption process, it's your job to find the most suitable new animal owner. When you pay attention to the animal's needs and the owner's preferences, nothing can stand in the way of their happiness.\n\nâ˜… FANTASTIC 3D GRAPHICS â˜…\n\n&quot;PetWorld 3D: My Animal Rescue&quot; is not only a lot of fun and addictive, it's also visually pleasing. Move through the impressive 3D world of the animal rescue while scooping water out of the well or getting the right food. When you visit the animals you can also of course see them at close range and can observe how the hamsters clean themselves or how the bunnies hop around. You'd rather keep your rescues forever!\n\nSo: Go to the Animal Rescue Sunflower, your new friends are waiting for you!\n\n","torrent":{"xt":"urn:btih:c2570eb6c4ce692b6f1402b47a0b13f410d1b6b0","amp;dn":"Petworld.3D.My.Animal.Rescue.v1.8.Android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2570eb6c4ce692b6f1402b47a0b13f410d1b6b0","infoHashBuffer":{"type":"Buffer","data":[194,87,14,182,196,206,105,43,111,20,2,180,122,11,19,244,16,209,182,176]},"announce":[],"urlList":[]}}