{"title":"Aurelio - Laru Beya 2011 (flac)","uid":6431515,"size":298555456,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c4171875257d557e1a4f46ac139b8a6a82bb2dcc&amp;dn=Aurelio+-+Laru+Beya+2011+%28flac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1306668892,"description":"Aurelio Martinez is a Honduran musician and politician who is also a member of the Garifuna community. He is the first black person to become a deputy in the National Congress of Honduras.\n\nThe Garifuna communities that line the Caribbean coast of Central America have their origin in a fortuitous shipwreck of 1675, which allowed enslaved Africans from what is now southeast Nigeria to escape to the island now known as Saint Vincent. There, they were initially forced to battle the resident Carib Amerindians, but later intermarried with Caribs and Arawaks, subsequently working together to repel both French and British colonisers. Then, once the British took full control of the island, in 1795, the Garifuna, known as Black Caribs, were forcibly deported to the island of Roatan, from which they migrated to Honduras, Belize, Guatemala and Nicaragua.\n\nDuring the mid-1990s, the late Andy Palacio brought Garifuna music to widespread acclaim through a hybrid style known as punta rock. And although Aurelio Martinez contributed to Palacios landmark album Watina, his own Laru Beya feels very atypical, being a quietly absorbing album that incorporates unusual rhythms from the traditional Garifuna repertoire, given greater depth and complexity via the presence of Senegalese musicians on several tracks.\n\nFollowing Palacios sudden death in 2008, Aurelio decamped to a small Honduran fishing village to begin recording the basic tracks of Laru Beya, which appropriately means By the Beach. After further recording sessions were undertaken in Belize with producer Ivan Duran, Aurelio travelled to Dakar, Senegal, for a series of collaborative sessions, after being selected for Youssou NDours Protege Arts Initiative. The Senegalese sojourn brought all kinds of new textures. In addition to the presence of Orchestra Baobab members on the mournful Bisien Nu and the title-track, upcoming local rappers contribute to Weibayuwa (Sharks), which criticises political excess, and Ineweyu, a traditional refutation of infidelity. NDour also contributes to the opening number, Lubara Wanwa (Waiting for the Arrival of a Son), which evidences a strong reggae influence, and the moving Wamada (Our Mutual Friend), the latter being a rousing tribute to the departed Palacio, which draws on the rhythm of a sacred Garifuna funeral rite.\n\nIn lesser hands, such fusion elements could have fallen flat, but Aurelios obvious talent, and Durans sterling musical arrangements, instead yield an impressive album that simply sounds better which each new listening.\n\n\nAurelio Martinez - lead vocals, acoustic guitar, turtle shells, maracas\nRolando Chichiman Sosa - Garifuna drum, tenor sax, congas, percussion, vocals\nOnan Sambo Castillo - lead Garifuna drum\nGuayo CedeÃƒÂ±o - lead electric guitar\nOns Barnat  baritone guitar\nEdgardo Tongo Rivera - trombone\nIvan Duran - bass, electric guitar\nThio Mbaye - sabar drum\nEdou Manga - kora\nAl Ovando - electric guitar\nPhil Nicolas: electric piano\nAssane Thiam - tama drum\nWomen singing group - Sofia Blanco, Neta Fernandez, Idalia Valerio, Nelsi Flores, Andrea    Lambert, Esther Valerio, Esmeralda Arzu.\nFeaturing Mamadou Jimi Mbaye on lead electric guitar\n\n\n 1. Lubara Wanwa\n 2. Laru Beya\n 3. Yange\n 4. Weibayuwa\n 5. Yurumei\n 6. Ineweyu\n 7. Bisien nu\n 8. MayahuabÃƒÂ¡\n 9. Tio Sam\n10. Wamada\n11. Nuwaruguma\n12. Ereba\n","torrent":{"xt":"urn:btih:c4171875257d557e1a4f46ac139b8a6a82bb2dcc","amp;dn":"Aurelio+-+Laru+Beya+2011+%28flac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4171875257d557e1a4f46ac139b8a6a82bb2dcc","infoHashBuffer":{"type":"Buffer","data":[196,23,24,117,37,125,85,126,26,79,70,172,19,155,138,106,130,187,45,204]},"announce":[],"urlList":[]}}