{"title":"Take No Prisoners(eng PC WIN)","uid":3632917,"size":720676538,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c44299fb9c453f3f4c9847d44e0cb1422c160e28&amp;dn=Take+No+Prisoners%28eng+PC+WIN%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"deamon2000","files":2,"time":1173129958,"description":"As I said i would ! \n\nBe sure to burn to disk for soundtrack to play !\n\n\nRun-and-gun fans can get a breath of fresh air with Take No Prisoners, a shooter that takes an interesting perspective on the genre.\n\nWith an uncountable number of first-person shooters flooding the market - and even more looming ominously on the horizon - it&amp;#039;s refreshing when a slightly different 3D action game comes along. Run-and-gun fans can get a breath of fresh air with Take No Prisoners, a shooter that takes an interesting perspective on the genre - both literally and figuratively.\n\nIn Take No Prisoners, nuclear warheads and radioactive fallout have transformed San Antonio, Texas, into an irradiated hellhole, full of microwaved ex-yuppies and other mutated critters just begging for a shotgun blast to the chest. You play Slade, a Snake Pliskin wanna-be, who has been recruited by The Man to infiltrate a mysterious, center-city dome. Once inside, the goal is to retrieve a special crystal, using the timeless negotiating skill of blasting everyone with heavy artillery.\n\nAll of the action in Take No Prisoners is viewed via an overhead floating camera, which follows you around as you romp through post-apocalyptic wastelands while mowing down bad guys, picking up objects and keycards, and doodling with computer terminals. While at first glance Take No Prisoners may appear to be little more than Quake from above, there&amp;#039;s a good deal of depth below the surface. You can get a feel for the continuous storyline by reading personal logfiles stored on computers (a nod to Origin&amp;#039;s System Shock), and solve puzzles that are a few steps above the &quot;find the key to open the door&quot; variety.\n\nGraphics are appropriately dark and moody, and the control is as responsive as expected. The game moves at a good clip on the base system, though a 3D accelerator will jack up the frame rate while adding sparkly colored lighting to ooh and aah at. Internet play has been implemented via the RedOrb Zone interface, though performance issues are questionable - it&amp;#039;s best left for players with fast connections.\n\nAside from the sluggish Net play, a few minor annoyances hold back Take No Prisoners. The game&amp;#039;s view seems a bit too low in some places, inducing claustrophobia and depleting the situational awareness of what lies in front of you. And when you pull down your PDA in the middle of the game to read a briefing or check a passcode, the game doesn&amp;#039;t pause - if there&amp;#039;s a mutated critter out of your field of vision, he&amp;#039;ll have you for lunch while you attempt to review your notes.\n\nTake No Prisoners&amp;#039; audio is also pretty shabby. It&amp;#039;s not just the irritatingly repetitive enemy taunt voices, it&amp;#039;s just that Slade&amp;#039;s zippy one-liners simply aren&amp;#039;t that clever - Duke Nukem did it much, much better. The controversial content is in there, though - if the bordering-on-tasteless ad campaign didn&amp;#039;t clue you in, you may be offended by the amount of blood and gore.\n\nThough it has its problems here and there, Take No Prisoners is different enough to warrant a look. It may not be the end-all of blast fests, but it&amp;#039;s a welcome departure from scores of Quake clones, and consequently a good and solid ride while it lasts.\n\n\n\n\nImages (Dont let the graphix fool you the game RoCKS!) &lt;a href=&quot;\nhttp://www.gamespot.com/pc/action/takenoprisoners/screenindex.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gamespot.com/pc/action/takenoprisoners/screenindex.html&lt;/a&gt;","torrent":{"xt":"urn:btih:c44299fb9c453f3f4c9847d44e0cb1422c160e28","amp;dn":"Take+No+Prisoners%28eng+PC+WIN%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c44299fb9c453f3f4c9847d44e0cb1422c160e28","infoHashBuffer":{"type":"Buffer","data":[196,66,153,251,156,69,63,63,76,152,71,212,78,12,177,66,44,22,14,40]},"announce":[],"urlList":[]}}