{"title":"Friends with Benefits (Vault #1) (2014) Anne Lange (multi)","uid":9540379,"size":1225130,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5d36af99693d7aa1108cb89d9a923461943a52f&amp;dn=Friends+with+Benefits+%28Vault+%231%29+%282014%29+Anne+Lange+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1391031531,"description":"\nFriends with Benefits (Vault #1) by Anne Lange\n\n\nFormat: mobi/epub/azw3\nLength: 233 pages\nGenre: Erotic Romance\nDate: 15 January 2014\n\nCan sexual exploration lead to three times the bliss?\n\nTyler had no idea his wife Angela's desires so closely matched his own. But when some unguarded pillow talk reveals her fantasy of two men at once, Tyler jumps at the chance to make her happy. Enlisting the help of his best friend Connor, who'd shared some threesome adventures with him in the past, Tyler secretly hopes exploring Angela's fantasies will lead to his own personal desire?a permanent threesome with the two people he loves most in the world.\n\nConnor can't believe it when his best friend asks him to seduce his wife. Then he meets Angela, and all the women in his past fade away. With Tyler's blessing, Connor sets out to melt Angela's reserve, and when Tyler joins the party, the three of them set the sheets on fire.\n\nAngela is floored when her husband suggests they explore some of her fantasies - things she'd only read about but never in a million years thought she'd actually do. Sandwiched between Tyler and Connor, she's never felt so treasured, so protected, so loved. But the reality proves much more complicated than the fantasy. She loves her husband, but she finds herself falling for his best friend too. That's not normal, is it? What will people think?\n\nAuthor:\n\nI started writing in late 2009, realized I needed to figure out what in the world I was doing, and began my trek of workshops and networking, and writing. I finally got my break in October 2012, when Etopia Press asked if they could publish my novella, Worth the Risk.","torrent":{"xt":"urn:btih:c5d36af99693d7aa1108cb89d9a923461943a52f","amp;dn":"Friends+with+Benefits+%28Vault+%231%29+%282014%29+Anne+Lange+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5d36af99693d7aa1108cb89d9a923461943a52f","infoHashBuffer":{"type":"Buffer","data":[197,211,106,249,150,147,215,170,17,8,203,137,217,169,35,70,25,67,165,47]},"announce":[],"urlList":[]}}