{"title":"Logic and Discrete Mathematic: A Concise Introduction [2015]","uid":11958039,"size":5963344,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5e7606a198de2dc7f2afe17be8f583fd2590f6d&amp;dn=Logic+and+Discrete+Mathematic%3A+A+Concise+Introduction+%5B2015%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1432496678,"description":"Title: Logic and Discrete Mathematic: A Concise Introduction\nAuthor: Willem Conradie, Valentin Goranko\nFormat: PDF\nHardcover: 376 pages\nPublisher: Wiley; 1 edition (May 26, 2015)\nLanguage: English\nISBN: 9781118751275\n\nThis book features a unique combination of comprehensive coverage of logic with a solid exposition of the most important fields of discrete mathematics, presenting material that has been tested and refined by the authors in university courses taught over more than a decade. \n\nThe chapters on logic - propositional and first-order - provide a robust toolkit for logical reasoning, emphasizing the conceptual understanding of the language and the semantics of classical logic as well as practical applications through the easy to understand and use deductive systems of Semantic Tableaux and Resolution. The chapters on set theory, number theory, combinatorics and graph theory combine the necessary minimum of theory with numerous examples and selected applications. Written in a clear and reader-friendly style, each section ends with an extensive set of exercises, most of them provided with complete solutions which are available in the accompanying solutions manual.\n\nKey Features:\n\n- Suitable for a variety of courses for students in both Mathematics and Computer Science.\n- Extensive, in-depth coverage of classical logic, combined with a solid exposition of a selection of the most important fields of discrete mathematics\n- Concise, clear and uncluttered presentation with numerous examples.\n- Covers some applications including cryptographic systems, discrete probability and network algorithms.\n\nLogic and Discrete Mathematics: A Concise Introduction is aimed mainly at undergraduate courses for students in mathematics and computer science, but the book will also be a valuable resource for graduate modules and for self-study","torrent":{"xt":"urn:btih:c5e7606a198de2dc7f2afe17be8f583fd2590f6d","amp;dn":"Logic+and+Discrete+Mathematic%3A+A+Concise+Introduction+%5B2015%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5e7606a198de2dc7f2afe17be8f583fd2590f6d","infoHashBuffer":{"type":"Buffer","data":[197,231,96,106,25,141,226,220,127,42,254,23,190,143,88,63,210,89,15,109]},"announce":[],"urlList":[]}}