{"title":"2012 - The Mayan Calendar - And The World's Prophecies - (Mal","uid":4813333,"size":642157,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c62d6d058c1fc2bd8cea5cfd5c4d0a2d9dac3f11&amp;dn=2012+-+The+Mayan+Calendar+-+And+The+World%5C%27s+Prophecies+-+%28Mal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"malestrom_HH","files":1,"time":1238455610,"description":"Short Overview.\n\nThe authors demonstrate how the Mayan Holy Number 1,366,560 days, known as the birth of Venus and the basis of their calendar, indicates ancient knowledge of sun spot cycles and their effect on the human race. They explore the popular myth of Quetzalcoatl and its origins in Maya ideas concerning the sun cycle.\n\nThey show the links between the pre-Columbian civilizations of Central America and the Old World, in particular Egypt. Examining the archaeological record, they find further evidence for linking the origins of Mayan civilization with the mythical lost continent of Atlantis, which according to Plato was destroyed in a series of catastrophes. They reveal that the Mayan calendar prophesies the end of our own Age of the Jaguar, the fifth and final sun in 2012 AD. This, according to Cotterell's sun-spot theories, will be brought about by a sudden reversal in the earth's magnetic field. The book is lavishly illustrated with 40 colour plates as well as many black and white pictures and diagrams. It is a book full of startling discoveries not only about the past and the seemingly remote civilization of the Maya but ourselves and the destiny of the human race.\n\nIntroduction\n\nMexico is a strange country that contains many secrets. On March 4 1519 Hernan Cortes, with 11 ships, 600 foot soldiers, 16 horses and some artillery landed on the coast near what was to become Vera Cruz. By August 13 1521 he had conquered the Aztec Empire, the most powerful state in all of the Americas. Part of the reason for his success was a case of mistaken identities, the Indians believing that he was a god named Quetzalcoatl whose return had long been prophesied. The Spanish for their part were both fascinated and appalled by what they found in this New World. To them the indigenous religion, which included human sacrifice on a grand scale, was both barbarous and satanic. Accordingly they set about destroying it without trace.\n\nWhole libraries of colourful bark-books were burnt and those natives who did not die from disease, hunger and over-work were forcibly converted to Catholicism. Fortunately not all the Spanish were as unsympathetic towards the Indians as Cortes. A few, such a friar named Bernadino Sahagun, made friends with the natives and attempted to record for posterity their traditional beliefs and ideas. He discovered that central to their philosophy was a belief in the cyclical nature of time and an awesome fear that one day, possibly sooner rather than later, their world would come to an end. It seems that they believed that the sun, which they nourished with their sacrifices, would one day no longer send its life force, thereby bringing to an end the fifth and last age of man. They counted the days according to two calendars, one a vague year of 365 days and the other a shorter cycle of 260 days. Every day had two names, one according to each calendar so that the same combination of names would not recur for 52 years. When one of these 52 year time periods, known as an Aztec century, came to an end they would leave their cities and, going up into the surrounding hills, anxiously watch the stars.\n\nThe sign they were looking for was the Pleiades star-group, symbolising for them a cosmic snake's rattle, crossing the southern meridian at midnight. This, they believed, meant that the heavens had not stopped turning and the sun would rise again. The Aztecs celebrated the birth of this new 'century' with rejoicing and the lighting of fires, symbolising the rebirth of the world. Most native Meso-American documents were destroyed in the early years of the Spanish occupation but a few priceless books and relics did survive the destruction, either having been hidden by the Indians or exported back to Europe as presents for the King. The most important of these was what is now called the Dresden Codex, named after the town in whose library it was lodged. This strange book, inscribed with unknown hieroglyphs, was written by Maya Indians who once ruled over much of Central America, the ruins of their once grand civilization littering the jungle. In 1880 a brilliant, German scholar, who was working as a librarian in Dresden, turned his attention to this codex. By a process of extraordinary detective work he cracked the code of the Mayan calendar making it possible for other scholars and explorers to translate the many dated inscriptions to be found on buildings, stelae and other ancient Mayan artefacts. He discovered that the Dresden Codex itself was concerned with astronomy providing detailed tables of lunar eclipses and other phenomenon.\n\nThese were so accurate that they put our own calendar to shame. He also found evidence for a curious magic number- 1,366,560 days, which could be factorised in a number of ways and which harmonised the cycles of Venus and Mars with two yearly cycles also used by the Maya: the sacred tzolkin of 260 days and the Haab of 365 days. However, he also found that they had another system of counting the days relative to a starting date, called the Birth of Venus and now known to be 13 August 3114 BC. This calendar was divided into months or uinals of twenty days, years or tuns of 360 days and longer periods of 7200 days, the katun and 144,000 days, the baktun. The number 13 was magically important to them and they believed that, starting from the Birth of Venus, after 13 of these longest periods, or baktuns, the world would come to an end. Working from their start date this Mayan Prophecy points to a date in our own time, 22 December 2012.\n\nIn 1986 Maurice Cotterell put forward a revolutionary theory concerning astrology and sun cycles. He had for some years suspected that the sun's variable magnetic field had consequences for life on earth. The sun has a complex field which loops and twists itself into knots. It has long been suspected that these loops give rise to sunspots, which are dark blemishes on the sun's skin. The number, size and location of sunspots are constantly changing and as a former Radio Officer, Cotterell was well aware that they have profound effects upon the earth's magnetic envelope, the magnetosphere. Whilst working as Head of Electrical and Communications Engineering (Estates) at Cranfield Institute of Technology, he devised a program that would compute the relationship between the sun's magnetic field and the Earth. As expected his model predicted that there should be a sunspot cycle of roughly eleven and a half years, closely corresponding to what has been observed over several centuries.\n\nHowever, he also found graphic evidence for longer cycles including a period of 1,366,040 days. His work took a new turn when he read about the Mayan super number from the Dresden Codex: 1,366,560 days. This was exactly two 260 day cycles larger than his theoretical sunspot period. He therefore proposed that the two were related. As his earlier work on what he called Astrogenetics indicated that human fertility was dependent on the presence of sunspots, he now had evidence that the Mayan calendar was not arbitrary but was based on a knowledge of the effects of sunspots. This explained the near obsession they had for long cycles of time and their belief in the rise and fall of four previous ages of man. Travelling in Mexico, Cotterell extended his ideas and gave them a public airing on television. After giving a lecture at the Voluntary Cultural society, he was awarded a medal by the wife of the President. By now his work included some very esoteric investigations into the 'Lid of Palenque', a mysterious sarcophagus cover made famous in the 1960s by Eric von D?niken, who believed it showed the picture of an ancient astronaut. Cotterell now identified the lid as a graphic representation of Mayan philosophy and as containing many hidden messages and codes. In 1994 he met up with Adrian Gilbert, who had recently co-authored a book on the Egyptian pyramids called The Orion Mystery.\n\nGilbert too went to Mexico and was fascinated to discover the extent to which the ancient Mexicans venerated the rattlesnake. He discovered some curious cultural similarities between the early Maya and the ancient Egyptians, even though their civilizations are separated by millennia. Whereas the Egyptians studied the movements of the Hyades, Orion and its companion star Sirius, the Maya were more interested in the nearby Pleiades star-cluster. They viewed it as the warning rattle of a great cosmic serpent, which seems to have corresponded to the ecliptic. The head of this serpent was the sun and they believed that it was the source of all life on earth. The Maya, like the Aztecs, believed there had been four ages prior to our own. Gilbert was able to relate the first of these to Atlantis and investigated certain prophecies relating to this fabled civilization. It seems that the serpent religion, which the early Spanish conquistadors attempted to eradicate, may well owe its origins to survivors of this lost race, some of whom went to Egypt and some to Central America. The original Quetzalcoatl, whose name means plumed serpent and who was identified with the planet Venus, probably lived at the start of the fourth age, around 3114 BC and initiated a highly ethical religion of penance. This later degenerated into human sacrifice: physical hearts instead of emotions being offered to the sun.\n\nOther prophets of the same name lived later and Cortes was mistaken for his reincarnation. The Mayan calendar points to 22 December 2012 as being the end of our present age. Changes around that time to the sun's magnetic field could have consequences for us all. Perhaps we are already witnesing the beginnings of this change with the desertification of more and more land. This seems to have happened in a more localised way at the time of another sun spot minima, leading to the collapse of the Mayan civilization. Their ruined, jungle cities are a warning to us all.","torrent":{"xt":"urn:btih:c62d6d058c1fc2bd8cea5cfd5c4d0a2d9dac3f11","amp;dn":"2012+-+The+Mayan+Calendar+-+And+The+World%5C%27s+Prophecies+-+%28Mal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c62d6d058c1fc2bd8cea5cfd5c4d0a2d9dac3f11","infoHashBuffer":{"type":"Buffer","data":[198,45,109,5,140,31,194,189,140,234,92,253,92,77,10,45,157,172,63,17]},"announce":[],"urlList":[]}}