{"title":"The Kiss (1929) Greta Garbo (Silent).avi","uid":4581915,"size":629078016,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c7fe1b12e221fca96d05f4b1600b49316e95b2b4&amp;dn=The+Kiss+%281929%29+Greta+Garbo+%28Silent%29.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"johnefp","files":-1,"time":1229459512,"description":"Plot Synopsis\tby Hans J. Wollstein\n\nMGM's paranoid fear of audience reaction to Greta Garbo's speaking voice must have been the only reason for this plodding courtroom melodrama to have been made as a silent. Released with a synchronized score and two important sound effects, The Kiss would prove to be Garbo's, and Metro's, final silent feature film. Happily, Belgian director Jacques Feyder used both the pantomime format and the aforementioned sound effects -- a gunshot and the incessant ringing of a telephone -- to optimum effect. When ulcer-plagued husband Anders Randolf returns unexpectedly in the middle of a smooch between his wife and 18-year-old Lew Ayres, he naturally jumps to the wrong conclusion. But the kiss is in reality merely Garbo's firm goodbye to an overly anxious admirer. Randolf and Ayres fight, Garbo vainly attempts to reason with her husband, a closed door shields the action from the viewer, and only a muffled shot is heard (yes, heard). Then the telephone rings: It is Ayres' father (Holmes Herbert) wondering why his appointment, Randolf, never showed. To shield the boy, Garbo takes the blame for the killing (she actually did do it but only to save Ayres' life) and is defended in court by the real love of her life, Conrad Nagel. Hans Kraly's screenplay is a bit heavyhanded and certainly nothing special, but Garbo's luminous presence almost saves the film from the doldrums. She plays the kind of society wife who lounges about in Art Deco elegance, keeping a stack of eight-by-ten glossies at the ready to hand out to young admirers like Ayres. It is all completely artificial of course, but Garbo somehow makes it believable. The supporting cast is what you expect: Ayres, handsome and impossibly young, Randolf, all bombast and pomposity, and Nagel, his usual dull self. For now obscure reasons, Conrad Nagel was highly regarded at the time and was by far Hollywood's busiest leading man at the changeover to sound. Garbo enjoyed working with Feyder, who went on to guide her through the German-language version of Anna Christie in 1930; and she was always more relaxed on and offscreen when other Scandinavians were around, in this case the Danish-born Randolf. As the near future would reveal, neither Garbo nor Metro had anything to worry about regarding the diva's accent and in February of 1930, the studio could at long last proudly proclaim that Garbo talks. She was the last major star to do so with the possible exception of Charles Chaplin.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0020062/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0020062/&lt;/a&gt;\n\nDirector:\nJacques Feyder\n\n\n\tGreta Garbo\t... \tIrene Guarry\n\tConrad Nagel\t... \tAndrÃƒÂ© Dubail\n\tHolmes Herbert\t... \tLassalle\n\tAnders Randolf\t... \tCharles Guarry\n\tLew Ayres\t... \tPierre Lassalle\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 01:01:48\nMovie complete : Yes\n\n[Video]\nResolution : 576x432\nCodec : XviD MPEG-4 codec\nFPS : 25,00\nBitRate : 1284 Kbps\nQuality Factor : 0,21 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 1\nSample Rate : 48000 Hz\nBitRate : 73 Kbps\n\n\nENJOY  AND  SEED\n","torrent":{"xt":"urn:btih:c7fe1b12e221fca96d05f4b1600b49316e95b2b4","amp;dn":"The+Kiss+%281929%29+Greta+Garbo+%28Silent%29.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7fe1b12e221fca96d05f4b1600b49316e95b2b4","infoHashBuffer":{"type":"Buffer","data":[199,254,27,18,226,33,252,169,109,5,244,177,96,11,73,49,110,149,178,180]},"announce":[],"urlList":[]}}