{"title":"Sky Wars - A History of Military Aerospace Power {BBS}","uid":7348505,"size":656939,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c867e73a51706261bcb840c9bc7124e6642109dd&amp;dn=Sky+Wars+-+A+History+of+Military+Aerospace+Power+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1339512901,"description":"Unlike land and maritime military warfare, which has evolved over thousands of years, the history of war in the air is as short as it has been spectacular: only 100 years have passed since the first flight in a powered aircraft. Despite its brief history, however, military air power is not an insignificant part of the modern military machine: on the contrary, it has played a strikingly prominent role in recent conflicts and humanitarian relief operations, and is likely to take the leading position in many future ones. In the decades since World War II the skies, and increasingly space, have acquired ever more importance as the ultimate &quot;high ground&quot;.\n\nIn Sky Wars, David Gates examines the history of military aerospace power, discussing technical developments between both World Wars and the use of air power in specific wars in the latter part of the 20th century, including the recent conflict with Iraq. At the same time he analyses the military and civil applications of airpower in the contemporary world, some of which have led to scientific and technical advances of great benefit to humanity. As well as looking at the ways in which developments in air power, military prowess and space exploration have had a major impact on our daily lives, he highlights more contentious issues, for example the so-called &quot;CNN factor&quot;, whereby the increasing capacity for journalistic intrusion into ongoing military operations compels armed forces to be much more sensitive to public opinion.\n\n\nPaperback: 224 pages\nPublisher: Reaktion Books (April 4, 2004)\nLanguage: English\nISBN-10: 186189189X\nISBN-13: 978-1861891891","torrent":{"xt":"urn:btih:c867e73a51706261bcb840c9bc7124e6642109dd","amp;dn":"Sky+Wars+-+A+History+of+Military+Aerospace+Power+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c867e73a51706261bcb840c9bc7124e6642109dd","infoHashBuffer":{"type":"Buffer","data":[200,103,231,58,81,112,98,97,188,184,64,201,188,113,36,230,100,33,9,221]},"announce":[],"urlList":[]}}