{"title":"Electronics Analog and Digital - 2nd Edition - I.J. Nagrath","uid":11996435,"size":28901512,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca428467946fc790659ddc553a8992f236c9c729&amp;dn=Electronics+Analog+and+Digital+-+2nd+Edition+-+I.J.+Nagrath&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1433636519,"description":"The second edition of this book has been updated and enlarged, especially the chapters on digital electronics. In the analog part, several additions have been made wherever necessary. Also, optical devices and circuits have been introduced. Analog electronics spans semiconductors, diodes, transistors, small and large-signal amplifiers, OPAMPs and their applications. Both BJT and JFET, and MOSFET are treated parallely so as to highlight their similarities and dissimilarities for thorough under-standing of their parameters and specifications. The digital electronics covers logic gates, combinational circuits, IC families, number systems codes, adders/subtractors, flip-flops, registers and counters. Sequential circuits, memories and D/A and A/D convertor circuits are especially stressed. Fabrication technology of integrated devices and circuits have also been dealt with. Besides, many new examples and problems have been added section-wise.\n\nThe text is written in simple yet rigorous manner with profusion of illustrative examples as an aid to clear understanding. The student can self-study several portions of the book with minimal guidance","torrent":{"xt":"urn:btih:ca428467946fc790659ddc553a8992f236c9c729","amp;dn":"Electronics+Analog+and+Digital+-+2nd+Edition+-+I.J.+Nagrath","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca428467946fc790659ddc553a8992f236c9c729","infoHashBuffer":{"type":"Buffer","data":[202,66,132,103,148,111,199,144,101,157,220,85,58,137,146,242,54,201,199,41]},"announce":[],"urlList":[]}}