{"title":"The Police - Message In A Box -  The Complete Recording CD 1","uid":3710230,"size":179848565,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:caef429f88cdbb0df80628d9e96342dae30e4074&amp;dn=The+Police+-+Message+In+A+Box+-++The+Complete+Recording+CD+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wofflan","files":21,"time":1181491104,"description":"Review from Musicians Only magazine by Chris Welch \n\nPhew, what an amazing mass of magical music, the legacy of a band who soared across the late seventies and early eighties like a comet of energy and inspiration. It\\&amp;#039;s fascinating to hear these classic cuts in chronological order, so we can trace the musical development of Sting, Andy Summers and Stewart Copeland. Who were these street urchins bashing out punk music on \\&amp;#039;Fall Out\\&amp;#039; and \\&amp;#039;Dead End Job\\&amp;#039; It certainly wasn\\&amp;#039;t Andy on guitar on the first cut, but one Henri Padovani. The change of guitarist and Stewart\\&amp;#039;s abrupt change of drum style on So Lonely heralded the classic era of The Police\\&amp;#039;s development. The cuts from their 1978 \\&amp;#039;Outlandos d\\&amp;#039;Amour\\&amp;#039; showed all the characteristics that would combine to make the band both so commercially attractive and musically innovative. Just listen to the carefree confidence of \\&amp;#039;Roxanne\\&amp;#039;. Sting\\&amp;#039;s casual laugh, Stewart\\&amp;#039;s reggae drums grooving their own sweet way and Andy\\&amp;#039;s simple rhythm guitar lines show how a rock band should be recorded - live! It\\&amp;#039;s amazing to think back to the ludicrously vindictive reviews the band used to get from a confused and jealous music press at the time. Now they are no longer a threat but a sweet memory perhaps at last their output will be put into proper artistic perspective. Of course not everything they recorded was great. Indeed sometimes they could be very neurotic and repetitive. Sometimes Sting\\&amp;#039;s vocals were strained to breaking point as he tried to hit those elusive high notes. But there was so much good stuff - so many great songs and a lot of ideas that set standards for years to come. Here is one boxed set well worth the investment!\n\n\n\n320kbit/s\n\nThe other 3 cds will come as soon as there is some seeders!!\n\nSee u in Stockholm Globe Arena in August\n\nWofflan","torrent":{"xt":"urn:btih:caef429f88cdbb0df80628d9e96342dae30e4074","amp;dn":"The+Police+-+Message+In+A+Box+-++The+Complete+Recording+CD+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caef429f88cdbb0df80628d9e96342dae30e4074","infoHashBuffer":{"type":"Buffer","data":[202,239,66,159,136,205,187,13,248,6,40,217,233,99,66,218,227,14,64,116]},"announce":[],"urlList":[]}}