{"title":"Espers - The Weed Tree (2005)","uid":3649302,"size":44539912,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cb35ebbca4fec6fbd9f0c93c5c7984f9e3d6d85d&amp;dn=Espers+-+The+Weed+Tree+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"epeb","files":8,"time":1175086919,"description":"Neo-psychedelic folk trio the Espers began appearing in the Philadelphia area in early 2002. With a core provided by singer/songwriter Greg Weeks, Meg Baird, and Brooke Sietinsons and rounded out by numerous collaborators, their heady blend of chamber rock, baroque pop, and late-&amp;#039;60s British folk won them a small but devoted following both locally and nationally. Their intoxicating self-titled debut arrived in 2004 on the Locust label. The EP Weed Tree, a collection of covers, traditional pieces, and originals, arrived in 2005, followed in 2006 by the full-length II. \n\nLike a reincarnated Pentangle for the neo-psychedelic folk crowd, newly expanded Philadelphia sextet the Espers come full circle on their intoxicating EP Weed Tree. Less murky than their self-titled debut, Tree is a bright, fluid, and promising collection of six covers and one original that sees the group poised for an explosive (quietly, that is) full-length record in the near future. The Espers mine the traditional (&quot;Rosemary Lane,&quot; &quot;Black Is the Color&quot;) with grace and reverence, keeping the framework steeped in enough British folk acoustics that when a keyboard appears out of nowhere it&amp;#039;s not at all intrusive; rather it&amp;#039;s the lightening bolt in a gray sky that illuminates the crows below. Speaking of dark imagery, the collective&amp;#039;s creepy rendition of Blue Ã–yster Cult&amp;#039;s &quot;Flaming Telepaths&quot; from 1974&amp;#039;s Secret Treaties stays surprisingly true to its source. A haunting version of Manchester, England, post-punk outfit Durutti Column&amp;#039;s &quot;Tomorrow&quot; is also a highlight, with the refreshingly clear voices of Meg Baird and Greg Weeks finding the perfect middle ground between despair and serenity. Weed Tree could have been an exercise in tedium, but like fellow interpreter Alasdair Roberts, the Espers have more than a love for the sound of late-&amp;#039;60s acid folk; they have a vision for its future. \n","torrent":{"xt":"urn:btih:cb35ebbca4fec6fbd9f0c93c5c7984f9e3d6d85d","amp;dn":"Espers+-+The+Weed+Tree+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb35ebbca4fec6fbd9f0c93c5c7984f9e3d6d85d","infoHashBuffer":{"type":"Buffer","data":[203,53,235,188,164,254,198,251,217,240,201,60,92,121,132,249,227,214,216,93]},"announce":[],"urlList":[]}}