{"title":"Moxy - Under The Lights [1978] HQ Vinyl [LOVERBOY]","uid":4448795,"size":49986270,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cb3c7d0119f437e366df059281f915b79a4e693d&amp;dn=Moxy+-+Under+The+Lights+%5B1978%5D+HQ+Vinyl+%5BLOVERBOY%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sweetthing","files":9,"time":1224173259,"description":"Ok some some die hards say this isn&amp;#039;t a proper Moxy album but it is a good one nevertheless. It also introduced the world to Mike Reno who took over as lead vocalist. He would later make a bigger impact in LOVERBOY. The title track is a classic and is worth the admission price alone.\n\n\nRipped from good quality vinyl for your listening pleasure. The vinyl was centralized which means there was absolutely no side to side movement of the tone arm. This is usually the major flaw with vinyl as it causes a &quot;WOWING&quot; effect noticable to most audiophiles. It is caused by the hole not being entirely central and is more annoying than the occasional click in my opinion. Also in use on the Dual 505 Record Deck was a Platter Pad [a solid rubber, turntable mat, about 1 and a half cm thick] which no user of vinyl should be without. It enhances the sound no end!\n\n\n\nMoxy - Under The Lights [1978] High Quality Vinyl Rip @ 192kbps\n\n1. High School Queen \n2. Under the Lights \n3. Maybe I&amp;#039;m a Dreamer \n4. Sing to Me \n5. Sailor&amp;#039;s Delight \n6. Thinking About You \n7. Easy Come, Easy Go \n8. Living and Learning \n\n\n\nUnder the Lights is the fourth album by the rock band Moxy in its second incarnation, released in 1978. With the departure of Buzz Shearman as lead vocalist in 1977 for medical reasons, Mike Reno then called Michael Rynoski was brought for his debut in music. The album produced two minor Canadian hits with the title track &quot;Under the Lights&quot; and &quot;High School Queen&quot;, that gives a preview of the sound that Reno would take with him to his next band Loverboy that saw great success in the 1980s. Album sales were poor, as fans did not take to the new softer sound on the album. Although Michael Rynoskis vocals are clean it just doesn&amp;#039;t fit in the Moxy mold. But then this isn&amp;#039;t Moxy, this is a band that was left with the Moxy name and was forced by the record company to put out some radio play material. Missing the raw vocals that made the band by &quot;Buzz&quot; and founding member drummer Bill Wade shows a totally different band with a name of a hard rockin band of the past. Go to Canada or Texas and any real true Moxy fan wont even recognize this as a Moxy album After the departure of Earl Johnson in the summer of 1978 Moxy would not record a new album until Bill Wade got Earl Johnson and Buddy Caine back into the studio in 1999 for Moxy V that would have the 3rd line-up change in singer&amp;#039;s with Brian Maxim.\n\nMichael Rynoski: vocals \nEarl Johnson: Guitar \nBuddy Caine: Guitar \nTerry Juric: Bass \nDanny Bilan: drums \nJack Richardson - percussion \nScott Cushnie - Piano \nColina Phillips - Background Vocals \nTracy Richardson - Background Vocals \nSharon Williams - Background Vocals \nBrian Christian - Engineer \nPaul Hoffert -Vocal Arrangements \nJack Richardson - Producer ","torrent":{"xt":"urn:btih:cb3c7d0119f437e366df059281f915b79a4e693d","amp;dn":"Moxy+-+Under+The+Lights+%5B1978%5D+HQ+Vinyl+%5BLOVERBOY%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb3c7d0119f437e366df059281f915b79a4e693d","infoHashBuffer":{"type":"Buffer","data":[203,60,125,1,25,244,55,227,102,223,5,146,129,249,21,183,154,78,105,61]},"announce":[],"urlList":[]}}