{"title":"Anti-Heros - That's Right-Don't Tread on Me","uid":4633107,"size":169248564,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cd1d175fc64379147a6ef49a3273627f6006a875&amp;dn=Anti-Heros+-+That%5C%27s+Right-Don%5C%27t+Tread+on+Me&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"most_hated","files":27,"time":1231458105,"description":"The Anti-Heros started playing together in 1984 with an original lineup of Mike, Joe, Phil, and Mark. They broke up in August 1989 but reformed in 1993 after the release of the Election Day EP. The line up currently consists of Mark Noah on vocals, Mike Jones on bass, Phil on drums, and one Mark Magee (formerly of The Glory and Condemned 84!) on guitar. They have a rather unique sound from which it's hard to discern any prominent influence. As Mark Noah put it, &quot;We try to be as original as possible and we listen to everything from Mozart to Moonstomp.&quot; They must listen to Bach to because the organ at the beginning of &quot;Hate Edge&quot; makes me feel like I'm at Mass...\n\nThe band had two releases originally on Link Records in the late '80s (That's Right! in 1987 and Don't Tread on Me in 1988). It's rather well known that Link screwed the band over and Mark Brennan never paid the Anti-Heros for the recording the band paid for! Link also never paid Moonstomp, the Kicker Boys, the Glory, and a slew of other bands. Jack the Lad has a song about Mr. Brennan entitled &quot;Businessman&quot;...check it out if you can.\n\nBesides the Link LPs (and the 5 compilations the Anti-Heros are on, including Oi! Glorious Oi!), they released the Election Day 7&quot; in 1992 and the Murder One mini CD in 1995 on the GMM label. They've also released a full length album on Taaang! Records and is called American Pie which has some of their best material to date, including &quot;The Tradition&quot; and the skinhead anthem &quot;Jerry Was A Piece of Shit&quot;. .\n\nIn February of '97, the band said goodbye to long time drummer Phil Solomon and brought on Mark McClusky to take care of the percussion duties. Lately, Don Shumate, aka El Guapo, formerly of Time Bomb '77 fame, has taken over the beating of the skins. The Anti-Heros have been around for a long time and through out a history of being screwed over by record companies and even a break up, the band have remained true and loyal to the streetpunk sound they helped bring to the United States of America. Lately, the band doesn't consider themselves as much Oi! music; they're more happy with the hardcore streetpunk label, but in the end, isn't all Oi! music hardcore streetpunk? Either way, the Anti-Heros' contribution to American Oi! music will always be remembered.\n\nFor those of you who saw American History X, the more observant might have noticed that the fat Nazi had the Anti-Heros logo tattooed on his forearm. Before you ask, the band not only knows about it but specifically denied permission to use it when approached by the producers of the film. I believe there's a lawsuit in the works, one that could make the boys alot of money. And it couldn't have happened to more deserving folks...\n\n\nformat: mp3\nbit rate: 320kbps  \nripped with: windows media player","torrent":{"xt":"urn:btih:cd1d175fc64379147a6ef49a3273627f6006a875","amp;dn":"Anti-Heros+-+That%5C%27s+Right-Don%5C%27t+Tread+on+Me","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd1d175fc64379147a6ef49a3273627f6006a875","infoHashBuffer":{"type":"Buffer","data":[205,29,23,95,198,67,121,20,122,110,244,154,50,115,98,127,96,6,168,117]},"announce":[],"urlList":[]}}