{"title":"P J Harvey - Dry","uid":4193048,"size":59588657,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cd44d2138e28033ab12ddaf01788346541282afa&amp;dn=P+J+Harvey+-+Dry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"billy_stretcher","files":14,"time":1211063980,"description":"P.J Harvey\nDry\nAlt.Rock-Pop/Singer-songwriter\n1992\n192Kbps\n\n1.Oh My Lover \n2.O Stella \n3.Dress \n4.Victory \n5.Happy and Bleeding \n6.Sheela-Na-Gig \n7.Hair \n8.Joe \n9.Plants and Rags \n10.Fountain \n11.Water \n\nFront, Back And CD Covers Included.\n\n\nDry is the cornerstone of the 1990&amp;#039;s &quot;women in rock&quot; movement. To paraphrase what Lou Reed said about the Velvet Underground: Not many people bought the album, but those who did formed a band. The attraction is unmistakable: bluesy riffs played with punk-rock energy suddenly crash to a hush, while Harvey&amp;#039;s desperate wails become fatigued moans. What is she so hung up about? Well, in the spirit of the Rolling Stones, love and hope and dirty dreams and sex and sex and sex. Through the raucous &quot;Oh My Lover&quot; and &quot;Joe&quot;, Harvey airs her laundry quite loudly but never loses her wit, as &quot;Sheela-Na-Gig&quot;, which features the mantra &quot;I&amp;#039;m gonna wash that man right outta my hair / I&amp;#039;m gonna take my hips to a man who cares,&quot; attest.\n\nPolly Jean Harvey arrives fully formed as a songwriter on PJ Harvey&amp;#039;s debut album, Dry. Borrowing its primitive attack from post-punk guitar rock and its form from the blues, Dry is a forceful collection of brutally emotional songs, highlighted by Harvey&amp;#039;s deft lyricism and startling voice, as well as her trio&amp;#039;s muscular sound. Her voice makes each song sound like it was an exposed nerve, but her lyrics aren&amp;#039;t quite that simple. Shaded with metaphors and the occasional biblical allusion, Dry is essentially an assault on feminine conventions and expectations, and while there are layers of dark humor, they aren&amp;#039;t particularly evident, since Harvey&amp;#039;s singing is shockingly raw. Her vocals are perfectly complemented by the trio&amp;#039;s ferocious pounding, which makes even the slow ballads sound like exercises in controlled fury. And that&amp;#039;s the key to Dry: the songs, which are often surprisingly catchy &quot;Dress&quot; and &quot;Sheela-Na-Gig&quot; both have strong hooks are as muscular and forceful as the band&amp;#039;s delivery, making the album a vibrant and fully realized debut.\n\nEnjoy! :) \n","torrent":{"xt":"urn:btih:cd44d2138e28033ab12ddaf01788346541282afa","amp;dn":"P+J+Harvey+-+Dry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd44d2138e28033ab12ddaf01788346541282afa","infoHashBuffer":{"type":"Buffer","data":[205,68,210,19,142,40,3,58,177,45,218,240,23,136,52,101,65,40,42,250]},"announce":[],"urlList":[]}}