{"title":"Sri Bhaktisiddhanta Vaibhava - Bhakti Vikasa Swami [mobi - kindl","uid":8784148,"size":11087898,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cdef6d2e73f5597a8e39dbc3fd1c11abf3243d0f&amp;dn=Sri+Bhaktisiddhanta+Vaibhava+-+Bhakti+Vikasa+Swami+%5Bmobi+-+kindl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"harinama","files":-1,"time":1375785533,"description":"The result of over twenty years of research, Sri Bhaktisiddhanta Vaibhava, presents a wealth of newly translated material. Replete with anecdotes told by disciples who lived with him, this devotional, philosophical, cultural, and historical study gives intimate insights into the activities, teachings, and character of an empowered emissary of the Supreme Lord.\n\nSrila Bhaktisiddhanta Sarasvati Thakura, the guru of His Divine Grace A. C. Bhaktivedanta Swami Prabhupada, altered the course of religious history by reviving and forcefully propagating pure Krishna consciousness. His boldness in combating cheating religion earned him the appellation &quot;lion guru&quot; - yet his heart was soft with divine love for Krishna.\n\nBased in Bengal and traveling throughout India in the early twentieth century, Bhaktisiddhanta laid the foundation for and was the inspiration and guiding force behind the later world wide spreading of the Hare Krishna movement.\n\nThe first volume features a biographical overview, plus a detailed analysis of the message, mission, and personality of Srila Bhaktisiddhanta Sarasvati.\n\nThe second volume details the preaching challenges that Bhaktisiddhanta Sarasvati faced, and also includes biographical sketches of several of his disciples and associates.\n\nThe third volume features an overview of Bhaktisiddhanta Saraswati's contributions, with selections from his lectures, writings, and colloquies, his astrological chart, and appendixes that include important details concerning Srila Bhaktisiddhanta Sarasvati and the Gaudiya Matha, the organization he founded.","torrent":{"xt":"urn:btih:cdef6d2e73f5597a8e39dbc3fd1c11abf3243d0f","amp;dn":"Sri+Bhaktisiddhanta+Vaibhava+-+Bhakti+Vikasa+Swami+%5Bmobi+-+kindl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdef6d2e73f5597a8e39dbc3fd1c11abf3243d0f","infoHashBuffer":{"type":"Buffer","data":[205,239,109,46,115,245,89,122,142,57,219,195,253,28,17,171,243,36,61,15]},"announce":[],"urlList":[]}}