{"title":"Soil Mechanics Fundamentals [2015] [PDF]","uid":12721176,"size":6231300,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce9f487dcd5ea227aea2427f5a01445edea10f2a&amp;dn=Soil+Mechanics+Fundamentals+%5B2015%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1446994993,"description":"Title: Soil Mechanics Fundamentals \r\nAuthor: Muni Budhu \r\nFormat: PDF \r\nHardcover: 376 pages \r\nPublisher: Wiley-Blackwell; 1 edition (June 15, 2015) \r\nLanguage: English \r\nISBN: 9780470577950 \r\n\r\n\r\nThis accessible, clear and concise textbook strikes a balance between theory and practical applications for an introductory course in soil mechanics for undergraduates in civil engineering, construction, mining and geological engineering. Soil Mechanics Fundamentals lays a solid foundation on key principles of soil mechanics for application in later engineering courses as well as in engineering practice. With this textbook, students will learn how to conduct a site investigation, acquire an understanding of the physical and mechanical properties of soils and methods of determining them, and apply the knowledge gained to analyse and design earthworks, simple foundations, retaining walls and slopes. The author discusses and demonstrates contemporary ideas and methods of interpreting the physical and mechanical properties of soils for both fundamental knowledge and for practical applications. The chapter presentation and content is informed by modern theories of how students learn: *Learning objectives inform students what knowledge and skills they are expected to gain from the chapter. *Definitions of Key Terms are given which students may not have encountered previously, or may have been understood in a different context. *Key Point summaries throughout emphasize the most important points in the material just read. *Practical Examples give students an opportunity to see how the prior and current principles are integrated to solve 'real world' problems","torrent":{"xt":"urn:btih:ce9f487dcd5ea227aea2427f5a01445edea10f2a","amp;dn":"Soil+Mechanics+Fundamentals+%5B2015%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce9f487dcd5ea227aea2427f5a01445edea10f2a","infoHashBuffer":{"type":"Buffer","data":[206,159,72,125,205,94,162,39,174,162,66,127,90,1,68,94,222,161,15,42]},"announce":[],"urlList":[]}}