{"title":"DmC Devil may Cry.Update.1-P2P","uid":8084246,"size":1084914622,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cf2a634aa85d98c2510cbe05d4b8cb43c3c4fc81&amp;dn=DmC+Devil+may+Cry.Update.1-P2P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gh0stNet","files":2,"time":1359586055,"description":"\nDmC Devil may Cry.Update.1-P2P\n------------------------------\n\nDmC: Devil May Cry (c) Capcom\n\n01/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Action\n\nDetailing Dante's early years and set against a contemporary backdrop,\nDmC Devil May Cry will retain the stylish action, fluid combat and\nself-assured protagonist that have defined the iconic series but\ninject a more brutal and visceral edge.\n\nThe Dante of DmC is a young man who has no respect for authority or\nsociety in general. Dante knows that he is not human, but also that he\nis not like the demons that have tormented him throughout his life.\nCaught between worlds, he feels like an outcast\n\nHe is now discovering and coming to terms with what it means to be the\nchild of a demon and an angel. This split personality has a real impact\non gameplay with Dante being able to call upon angel and demon abilities\nat will, transforming his Rebellion sword on the fly to dramatically\naffect both combat and movement\n\n- Do it with style - Utilize Dante's Angel and Demon powers to chain\ntogether ground-based and aerial combos to achieve the best style\nranking\n\n- Who is Dante? - Explore Dante's early years in a gripping narrative\nfeaturing familiar faces from the series alongside all new characters\n\n- Unbridled action - The intense and iconic sword and gun based combat\nreturns with the addition of new weapons all designed to dispatch\nthe demonic spawn back to hell with style and panache\n\n- Retaining the Devil May Cry DNA - Capcom staff, including team members\nfrom previous Devil May Cry titles, have been assigned to the project\nfrom the outset to ensure DmC is a true addition to the Devil May Cry\nfranchise\n\n- Unrivalled production values - Ninja Theory will take advantage of the\nlatest performance capture technology to deliver a level of character\ndesign, story-telling and cinematics that perfectly complements DmC's\nhigh-octane combat\n\nInstall notes:\n\nUnpack it into game folder and run &quot;dmc.update.1.bat&quot; file.\n\nMinimum System Requirements:\n\nOS: Windows Vista/XP, Windows 7, Windows 8\nProcessor: AMD Athlon X2 2.8 GHz or better, Intel Core2 Duo 2.4 Ghz or better\nMemory: 2 GB RAM\nHard Disk Space: 8 GB free hard drive space\nVideo Card: ATI Radeon HD 3850 or better, NVIDIA GeForce 8800GTS or better\nDirectX: 9.0c or greater\nSound: Standard audio device \n\nUploader notes:-\n\nThis works perfectly with reloaded and there is no official changelog for this update.","torrent":{"xt":"urn:btih:cf2a634aa85d98c2510cbe05d4b8cb43c3c4fc81","amp;dn":"DmC+Devil+may+Cry.Update.1-P2P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf2a634aa85d98c2510cbe05d4b8cb43c3c4fc81","infoHashBuffer":{"type":"Buffer","data":[207,42,99,74,168,93,152,194,81,12,190,5,212,184,203,67,195,196,252,129]},"announce":[],"urlList":[]}}