{"title":"[2003] Call Off The Search - Katie Melua @ 320kbs [only1joe]","uid":5244698,"size":154878051,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d005105a786b95d15f959635b84cdc623ecd126f&amp;dn=%5B2003%5D+Call+Off+The+Search+-+Katie+Melua+%40+320kbs+%5Bonly1joe%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"only1joe","files":-1,"time":1261939072,"description":"Call Off The Search - Katie Melua [2003] &lt;a href=&quot;\nhttp://img710.imageshack.us/img710/7533/calloffthesearchkatieme.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img710.imageshack.us/img710/7533/calloffthesearchkatieme.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/jAkOPAacL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/jAkOPAacL&lt;/a&gt;\n\nWikipedia - Call Off the Search is the debut album by Georgian-born British jazz and blues singer Katie Melua, released in in the UK on 3 November 2003. It became a hit, reaching number one on the UK album chart in January 2004 and the top twenty of the Australian album chart in June 2004. It spent 87 weeks in the ARIA Top 100, certified Platinum for shipments of 70,000+. First single &quot;The Closest Thing to Crazy&quot;, written by Batt, reached the top five in Ireland, top ten in the UK, top twenty in Norway, and top fifty in Australia. The second single from the album was the title track, &quot;Call off the Search&quot;, which gave Melua her second UK top twenty hit. The third single, a cover of Mayall's &quot;Crawling up a Hill&quot;, was released on 18 July as the third single in the UK. In the UK the album sold 1.2 million copies within its first five months of release, making it four times platinum. It spent six weeks at the top of the chart.\n\nAmazon.co.uk Review By Dan Gennoe - No doubt 18-year-old Katie Melua has got used to being tagged &quot;the next Norah Jones&quot;. After all, the similarities between her debut, Call Off the Search, and Jones's own five-Grammy-winning Come Away with Me more than support the comparison. Both feature precociously graceful and accomplished singers swirling through a haze of sweetly sensual sways--warm, slurred and gloriously lazy--and both certainly belong in the same stress-relieving rack in the easy-listening section. Yet to view Melua as a soundalike is to miss the strength and allure of her own distinctive character. Hers is intimate contemplation spiced with the jazzy drama of an off-Broadway musical. From the flamboyant inflections of her voice and the drowsy orchestra backing &quot;The Closest Thing to Crazy&quot; and &quot;Learnin' the Blues&quot;, to the honky-tonk seduction of &quot;My Aphrodisiac Is You&quot;, there's a street-smart attitude to her tender swoon that means the image of a dimly lit basement is never far away. With the velvety lounge of &quot;Blame It on the Moon&quot;, the dreamy romance of the title track and the devilish blues of &quot;Crawling Up a Hill&quot;, it's an eccentric and charming collection that very much stands Melua as a talent in her own right. \n\nJohnny Loftus, All Music Guide - English listeners went mad for Katie Melua with the release of her debut album in late 2003. Issued domestically in June 2004, Call Off the Search posits the lovely Melua pristinely in between pop, adult contemporary, and traditional American musical forms, with savvy marketing handling the finishing touches. (Think Norah Jones.) It's a comfortable, lightly melodic affair that drinks red wine safely in the middle of the road. Raised in Soviet Georgia and the United Kingdom, Melua has a beguiling accent that colors the ends of her phrases, adding character to her velvety, if occasionally only satisfactory singing voice. She has a nice time with the understated R&amp;B sashay of John Mayall's &quot;Crawling Up a Hill,&quot; as well as Mike Batt's &quot;My Aphrodisiac Is You,&quot; which is spiced up with barrelhouse piano, muted trumpet, and sly references to opium and the Kama Sutra. The singer's own &quot;Belfast (Penguins and Cats)&quot; opens nicely with a few measures of solo acoustic guitar before it's joined by the orchestral maneuvers that sweep through the majority of Call Off the Search's after-dark cabaret. (Melua also penned a dedication to Eva Cassidy, who she's been compared to vocally.) While the instrumentation is never overbearing, a stoic version of Randy Newman's &quot;I Think It's Going to Rain Today&quot; and a couple of late-album pop vocal entries do dawdle a bit in the soft-focus halo that hovers over Search's more easygoing stretches. These selections are perfectly capable, yet pretty obvious, as if the decision was made to sprinkle Melua's debut equally with safety and variety, in case a particular style didn't stick. Still, despite a few detours down easy street, Call Off the Search is a promising debut, and comfortable like the first drink of the evening.\n\nTrack Listings\n\n[01] Call Off The Search            \t[03:24]\n[02] Crawling Up A Hill          \t[03:25]\n[03] The Closest Thing To Crazy \t[04:12]\n[04] My Aphrodisiac Is You        \t[03:34]\n[05] Learnin' The Blues         \t[03:23]\n[06] Blame It On The Moon       \t[03:47]\n[07] Belfast                    \t[03:21]\n[08] I Think It's Going To Rain Today\t[02:30]\n[09] Mockingbird Song            \t[03:06]\n[10] Tiger In The Night         \t[03:07]\n[11] Faraway Voice              \t[03:13]\n[12] Lilac Wine                 \t[04:10]\n\nMusic Video\n\nBehind The Scenes - Starting Out 2003\n\n\nTotal Mp3 Play Time\t&gt; 00h:41m:12s\nTotal File Size \t&gt; 147mb (Including MP3s, Art Covers, File &amp; Video)\nTotal Bit Size  \t&gt; 320kbps\nMusic File Type \t&gt; I-Tunes MP3 Format\nMusic Video Format\t&gt; v7.6.2.9 Mpeg N / A\nScanned Artwork \t&gt; Yes @ 300dpi\nOriginal CD Rip \t&gt; Yes - only1joe\nOriginal Uploader\t&gt; Yes - only1joe \nUpload Speed    \t&gt; 33-35KB/s\nMusic Genre     \t&gt; Blues Jazz Pop\nRelease Date    \t&gt; 03 November 2003 [UK]\nRecord Company  \t&gt; Dramatico Records\nArtists WebSite \t&gt;\n\n&gt; http://www.katiemelua.com \n&gt; http://www.katiemeluausa.com \n&gt;\n&gt; http://en.wikipedia.org/wiki/Katie_Melua\n&gt; http://www.azlyrics.com/m/melua.html\n&gt; http://www.ilike.com/artist/Katie+Melua \n&gt;\n&gt; http://www.videocure.com/music-videos/k/c9be4f2c26add8f5bf7a738fce2d4ac8.html \n&gt;\n&gt;\n\n\n* * * Please Seed To A Ratio Of 1:1 Or Greater * * *\n* * * I Will Only Re-Seed If There Is More Than 10 Peers Waiting * * *\n* * * Any Problems - Leave Comments On My Most Recent Torrents * * *\n* * * This Is A Multi-Tracker Torrent Check Your Bit Torrent Client For A True Number Of Seeds * * *\n","torrent":{"xt":"urn:btih:d005105a786b95d15f959635b84cdc623ecd126f","amp;dn":"%5B2003%5D+Call+Off+The+Search+-+Katie+Melua+%40+320kbs+%5Bonly1joe%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d005105a786b95d15f959635b84cdc623ecd126f","infoHashBuffer":{"type":"Buffer","data":[208,5,16,90,120,107,149,209,95,149,150,53,184,76,220,98,62,205,18,111]},"announce":[],"urlList":[]}}