{"title":"Warhammer 40K Codex: Gaunts Ghosts v2","uid":8719131,"size":1077311,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d05a447ee6e9183a12b2e3c837881f145f66725b&amp;dn=Warhammer+40K+Codex%3A+Gaunts+Ghosts+v2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Chaos_Seer","files":1,"time":1374386806,"description":"Here is V2 of Codex: Gaunts Ghosts. Coming with that are quite a few changes and improvements I should think:\n\n- Overall improved look, feel and read.\n- Majority of characters are now found in a seperate section at the end of the codex making for an easier read.\n- Better bookmarks.\n- Added an Introduction/Why field the Tanith? section to summarize the purpose of the codex and the tactical vision behind it.\n- Many rules balanced, pts costs generally increased, codex entries improved or fixed where previously broken, confusing, etc...\n- New units added: Crusade Advisors (Not your 5e advisors list!), Tanith Firing Teams (the armies answer to new codex tendancies to have extended bodyguard units).\n- Many characters changed, balanced to work well in different character groups. This allows you to change the feel and overall tactic of your army based on how you use your characters.\n- New characters: Commissar Blenner, Scout Mkvenner, Sergeant Caffran, Sergeant Agun Soric, Captain Ban Daur. Criid and Caffran may be taken together as a heavy weapons team. Kolosim was removed (he became redundant). \n\nThus far it's a 24 page codex and it includes what my plans are for future releases. Check my user name for the previous version.\n\nFeel free to give me your thoughts and let me know if this codex release is more appealing than the last one!","torrent":{"xt":"urn:btih:d05a447ee6e9183a12b2e3c837881f145f66725b","amp;dn":"Warhammer+40K+Codex%3A+Gaunts+Ghosts+v2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d05a447ee6e9183a12b2e3c837881f145f66725b","infoHashBuffer":{"type":"Buffer","data":[208,90,68,126,230,233,24,58,18,178,227,200,55,136,31,20,95,102,114,91]},"announce":[],"urlList":[]}}