{"title":"Hell's Gate - Stephen Frey ","uid":5910806,"size":332935215,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d1a0d2625cfeffe9bbe43536f6e0694e3c384c4a&amp;dn=Hell%5C%27s+Gate+-+Stephen+Frey+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"captainelliotspencer","files":2,"time":1288049246,"description":"Read by Erik Steele\nFrom New York Times bestselling author Stephen Frey comes a riveting new thriller about a disillusioned star litigator who goes west to forge a new life in Big Sky Country -- and stumbles onto the toughest case of his career.\n\nWhen thirty-five-year-old lawyer Hunter Lee decides to turn his back on the New York City rat race that has made him rich but cost him his marriage, he takes his brother's advice and sets out to build a new life in the beautiful but isolated town of Fort Mason, Montana. However, escape is hardly what he finds there.\n\nHunter befriends Paul Brule, a Fire Jumper -- one of an elite corps of firefighters who parachute into remote wilderness areas to put out blazes before they become infernos -- and gets a terrifying firsthand look at the reality of vast tracts of forest being reduced to ash in seconds by hundred-foot walls of flame. In this tiny town where everyone seems to have a secret, Hunter comes to suspect that this particular rash of summer fires is anything but accidental and could, in fact, be serving a more sinister purpose.\n\nAs Hunter follows his instincts, Montana becomes a crucible where good and evil collide -- and where one man, running from his past, takes on the burden of exposing the guilty while saving himself and those he cares about most from the greatest danger they have ever faced.\n\n----------------------------------------\nVisit us for this and loads more:\n\nwww.audiobookvault.com\n----------------------------------------","torrent":{"xt":"urn:btih:d1a0d2625cfeffe9bbe43536f6e0694e3c384c4a","amp;dn":"Hell%5C%27s+Gate+-+Stephen+Frey+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1a0d2625cfeffe9bbe43536f6e0694e3c384c4a","infoHashBuffer":{"type":"Buffer","data":[209,160,210,98,92,254,255,233,187,228,53,54,246,224,105,78,60,56,76,74]},"announce":[],"urlList":[]}}