{"title":"Physical and Chemical Properties of Carbon Nanotubes","uid":14540823,"size":55122967,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1f01860b903bc450d326dea132e1aaa00e53e69&amp;dn=Physical+and+Chemical+Properties+of+Carbon+Nanotubes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462520830,"description":"Physical and Chemical Properties of Carbon Nanotubes - Satoru Suzuki (InTech, 2013).pdf\r\n\r\nCarbon nanotubes are rolled up graphene sheets with a quasi-one-dimensional structure ofnanometer-scale diameters. More than twenty years have passed since the pioneering work oncarbon nanotubes by Prof. Iijima in 1991. During all these years, carbon nanotubes have attracteda lot of attention from physicists, chemists, material scientists, and electronic deviceengineers because of their excellent structural, electronic, optical, chemical, and mechanicalproperties. Most of these unique properties mainly originate in the parent material, graphene,which has also been very intensively studied as a Dirac Fermion system in more recent years.Carbon nanotube research, especially that aiming at industrial applications is becoming moreimportant, and it would be meaningful to summarize recent research topics as a book.\r\n\r\nThis book contains recent research topics covering the physical, structural, chemical andelectric properties of carbon nanotubes. All chapters were written by researchers who areactive on the front lines and the readers are expected to have a fundamental knowledge ofthe structure and physics of carbon nanotubes. This book consists of four parts. Part 1 describesthe physical properties of carbon nanotubes, such as their heat transfer characteristics,the characteristics of laser-induced defects, and the electronic and vibrational propertiesof functionalized carbon and boron nitride nanotubes. In Part 2, theoretical and experimentalanalyses of the atomic structure of carbon and boron nitride nanotubes are presented.Some attempts at structure-controlled nanotube growth are also presented. Part 3 focuses ontheoretical and experimental works regarding the functionalization of the outer and innersurface of carbon nanotubes, which is important for applications. The structural and chemicalproperties of the functionalized nanotubes are also presented. In Part 4, the electric propertiesof carbon nanotube devices are presented. Some attempts at using carbon nanotubesfor neural recordings are also reviewed","torrent":{"xt":"urn:btih:d1f01860b903bc450d326dea132e1aaa00e53e69","amp;dn":"Physical+and+Chemical+Properties+of+Carbon+Nanotubes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1f01860b903bc450d326dea132e1aaa00e53e69","infoHashBuffer":{"type":"Buffer","data":[209,240,24,96,185,3,188,69,13,50,109,234,19,46,26,170,0,229,62,105]},"announce":[],"urlList":[]}}