{"title":"Minder.S08.  AVI","uid":6397978,"size":6793000400,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d26d81bc487a4a3162fbffd890c0f8ff96bf77f7&amp;dn=Minder.S08.++AVI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OLDLIMEY4","files":14,"time":1305576400,"description":"Episode 1 - Loneliness Of A Long Distance Entrepreneur\nOriginally Aired: 5th September 1991\n\nArthur is shocked to learn that Terry has moved out of his flat for good, and gone to Australia to live. With Terry gone, Arthur is now under threat from a local protection firm and is in desperate need of a new Minder. To add to his problems, Arthur is troubled at the thought that the imported car that he has just sold DS Morley isn't all it is made out to be. Arthur enlists the help of his young nephew Ray.\n\nEpisode 2 - A Bouquet Of Barbed Wire\nOriginally Aired: 12th September 1991\n\nArthur is convinced the British wine will be the new seller throughout the Europe, and as a result buys several crate loads of what he believes is the genuine article. Little does he know he only tried the sample bottle!\n\nEpisode 3 - Whatever Happened To Her Indoors?\nOriginally Aired: 19th Sepember 1991\n\nArthur is convinced that the way to make money is to appeal to British patriotism, and erects a flagpole and the union jack at the car lot. The council promptly disagrees and Arthur finds himself up in court attempting to justify why he has done it. In the meantime, Morley is informed of the disappearance of Arthur's wife by her weekly hairdresser. He pulls out all the stops to find her, convinced that Arthur has murdered her because he is sufferinfrom a severe cash crisis.\n\nEpisode 4 - Three Cons Make A Mountain\nOriginally Aired: 26th Sepember 1991\n\nThree of Arthur's old business partners decide it is time to frame Arthur.\n\nEpisode 5 - Guess Who's Coming To Pinner?\nOriginally Aired: 3rd October 1991\n\nWhen Arthur and Ray pay their respects to the late Charlie Johnson, Tommy Hanbury who is an old friend of Arthur's, persuades him to help with a 'job' bigger than the great train robbery. With the lock up under police surveillance, Ray sets out to discover exactly what Tommy has planned. Meanwhile Charlie's widow has plans of a more romantic nature for Arthur.\nEpisode 6 - The Last Temptation Of Daley\nOriginally Aired: 10th October 1991\n\nArthur visits the Doctor only to be told to cut down on the booze and cigars. Doing as the doctor suggests, Arthur experiences serious side effects, only made worse by a local builder called Benny McLeish threatening Arthur as a result of a dodgy blue paint deal. Arthur's strange behaviour in this episode is unlike any other episode of Minder.\n\nEpisode 7 - A Bird In The Hand Is Worth Two In Shepherds Bush\nOriginally Aired: 17th October 1991\n\nRay travels up North to bring a pigeon back to London, as part of a race. During this time, he falls very much in love with Donna, the daughter of Arthur's northern business partner. As a result of this, Ray and Donna disappear and Arthur is left to start the pigeon race himself. Arthur does whatever he can to ensure that Ray and Donna don't have a future.\n\nEpisode 8 - Him Indoors\nOriginally Aired: 24th October 1991\n\nSeeing an opportunity in selling and fitting burglar alarms, Arthur employs the services of ex-burglar, turned herbal tea enthusiast Ron. As a result of Ron's handy work, Arthur ends up trapped in the lock up with a titanium aluminium roll-up door that doesn't work quite as it should. While Arthur is stuck at the lock up, Ray is unavailable and Ron decides that he has another use for Arthur's list of customers.\n\nEpisode 9 - The Greatest Show In Willesden\nOriginally Aired: 31st October 1991\n\nArthur believes a that entertainment is the order of the day, and ends up in a spot of bother over a karaoke machine that he has borrowed which is stolen. Ray discovers the person who stole it is none other than Barry, a bloke who he has been working for, and decides to get his own back.\n\nEpisode 10 - Too Many Crooks\nOriginally Aired: 7th November 1991\n\nA talented young French chef called &quot;Henri&quot; who Arthur has employed as part of &quot;Daley Catering&quot; is been hunted by a group of gangsters. While providing the hospitality for a Police leaving function without a proper chef, Arthur is abducted for information as to Henri's whereabouts. This episode contains a good scene where Arthur offers his secretary a new computer. &quot;It's got bytes, floppy bits, everything - It'll make your life a lot easier my dear&quot; - if Arthur Daley said it, it must be true!\n\nEpisode 11 - The Odds Couple\nOriginally Aired: 14th November 1991\n\nArthur is asked by his friend, casino boss Lewis for help with his wife Lorna, who has a gambling problem. While Ray is looking after Lorna at Lewis' country house, Arthur turns up and is soon convinced by Lorna that she has a winning system. Meanwhile, while Arthur is at the casino, Lewis and his heavies are trying to find the reason why cash is disappearing and re-packaging all his old used playing cards into new packs. I wonder who that could be?\n\nEpisode 12 - The Coach That Came In From The Cold\nOriginally Aired: 21st November 1991\n\nIn order to straighten out the Police accounts, Morley and his Superintendent offer to sell Arthur the Police coach. Aiming to make a quick earner Arthur decides to start &quot;Daley Tours&quot; around London for unsuspecting foreign punters. Realising that another officer is trying stitch him up, the Superintendent decides he wants the coach back, and sends Morley off to retrieve it, only to discover that Arthur has sold it. Meanwhile, Ray is helping to save the destruction of a golf club while protecting Arthur from Denny Willis, to whom Arthur owes rather a large sum of money to.\n\nXmas Special - The Cruel Canal\nOriginally Aired: 26th December 1991\n\nArthur is having trouble shifting a job lot of stolen videos across London using the van. Arthur is under pressure to get shot of them quickly when a local Welsh hard guy Dai comes sniffing around looking for clues as to why his stock of &quot;videos&quot; have been nicked. Arthur finds the only way to deliver the videos is by boat but runs into all sorts of troubles along the way, not least of all with Ray.\n\nDVD Extra - Interview with George Cole\n\nAn interview with George Cole, an extra feature on the series 8 DVD.\n","torrent":{"xt":"urn:btih:d26d81bc487a4a3162fbffd890c0f8ff96bf77f7","amp;dn":"Minder.S08.++AVI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d26d81bc487a4a3162fbffd890c0f8ff96bf77f7","infoHashBuffer":{"type":"Buffer","data":[210,109,129,188,72,122,74,49,98,251,255,216,144,192,248,255,150,191,119,247]},"announce":[],"urlList":[]}}