{"title":"Stephen Lovell - Destination in Doubt. Russia since 1989 [2006][","uid":10317082,"size":1405733,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d2c626e21cf7617ca673cfa331bb9abeecdf77a6&amp;dn=Stephen+Lovell+-+Destination+in+Doubt.+Russia+since+1989+%5B2006%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1402261171,"description":"Description\nProduct Details\nBook Title: Destination in Doubt: Russia Since 1989 (Global History of the Present)\t\nBook Author: Stephen Lovell\nSeries: Global History of the Present\nPaperback: 224 pages\nPublisher: Zed Books (October 3, 2006)\nLanguage: English\nISBN-10: 1842776657\nISBN-13: 978-1842776650\n\n===================================================================================\nBook Description\nRelease date: October 3, 2006 | ISBN-10: 1842776657 | ISBN-13: 978-1842776650\nThis book is a short history of Russia since the collapse of Communism in Eastern Europe. In a matter of months, Russia was apparently demoted from &quot;evil empire&quot; to despondent poor relation of the prosperous West. Yet the country also seemed extraordinarily -- and alarmingly -- open to all manner of political outcomes: from the return of Communism to the creation and consolidation of liberal democracy. Many of the scripts written for Russia in 1991 have had to be drastically revised in subsequent years. This book is a historian's attempt to stand back from the turbulent post-Soviet era and inquire into the nature of the &quot;Second Russian Revolution.&quot;\n\n===================================================================================\nReviews\n&quot;Usually Russia after the collapse of the Soviet Union is the purview of political scientists, but in this short, smart book Stephen Lovell gives us a history of the catastrophes and resurgences that Russians have experienced since 1989. His account is lively and informed and offers both students and specialists facts and insights that will guide them through the vicissitudes of post-socialism.&quot;--Ronald Grigor Suny, Charles Tilly Professor of Social and Political History, University of Michigan\n\n&quot;Stephen Lovell is an attentive, well-informed historian concerned with one of the most dramatic periods in the modern history of Russia. Without simplification or bias, he describes the decay of the Soviet institutional system and the establishment of new relations between state and society. I would recommend this book to all those who look for non-trivial approaches to understanding the modern world.&quot;--Dr Lev Gudkov, Yuri Levada Analytical Center, Moscow\n\n&quot;A short but acute study of the changes that have swept over the world's largest country since 1989, and perhaps the best starting point to read about it that is now available in English. This is a book that raises the big questions and at least begins to answer them; it should have a wide readership.&quot;--Stephen White, Professor of International Politics, University of Glasgow\n\n===================================================================================\nAbout the Author\nStephen Lovell is a Reader in History at King's College London.\n===================================================================================","torrent":{"xt":"urn:btih:d2c626e21cf7617ca673cfa331bb9abeecdf77a6","amp;dn":"Stephen+Lovell+-+Destination+in+Doubt.+Russia+since+1989+%5B2006%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2c626e21cf7617ca673cfa331bb9abeecdf77a6","infoHashBuffer":{"type":"Buffer","data":[210,198,38,226,28,247,97,124,166,115,207,163,49,187,154,190,236,223,119,166]},"announce":[],"urlList":[]}}