{"title":"Andy Warhol (Viking Art Ebook).pdf","uid":13998876,"size":33660931,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d2fd8ce07cc766ec4468008824ffb1fd6f305cb0&amp;dn=Andy+Warhol+%28Viking+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1458767190,"description":"Andy Warhol\r\nViking Press | 2001 | ISBN 0670030007 | English | 248 pages | PDF | 32 MB\r\n\r\n&quot;The sixties were the &quot;sex, drugs, and rock-and-roll&quot; era, and Andy Warhol was its cultural icon. Painter, filmmaker, photographer, philosopher, Warhol was both celebrity and celebrant, the man who put the &quot;Pop&quot; in art. His studio, the Factory, where his free-spirited cast of &quot;superstars mingled with the rich and famous, was ground zero for the explosions that rocked American cultural life. And yet for all his fame, Warhol was an enigma: a participant in the excesses of his time who remained a faithful churchgoer, a nearly inarticulate man who was also a great aphorist (&quot;In the future, everyone will be world-famous for fifteen minutes&quot;), an artist whose body of work sizzles with sexuality but whose own body was a source of shame and self-hatred.&quot; &quot;In his account of Warhol's life and work, scholar and culture critic Wayne Koestenbaum gets past the contradictions and reveals the man beneath the blond wig and dark glasses. Nimbly weaving brilliant and witty analysis into an absorbing narrative, Koestenbaum approaches Warhol as a serious artist, one whose importance goes beyond the sixties. Focusing on Warhol's provocative, powerful films (many of which have been out of circulation since their initial release), Koestenbaum shows that Warhol's oeuvre, in its variety of forms (films, silkscreens, books, &quot;happenings&quot;), maintains a striking consistency of theme: Warhol discovered in classic American images (Brillo boxes, Campbell soup cans, Marilyn's face) a secret history, an erotics of time and space.&quot;","torrent":{"xt":"urn:btih:d2fd8ce07cc766ec4468008824ffb1fd6f305cb0","amp;dn":"Andy+Warhol+%28Viking+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2fd8ce07cc766ec4468008824ffb1fd6f305cb0","infoHashBuffer":{"type":"Buffer","data":[210,253,140,224,124,199,102,236,68,104,0,136,36,255,177,253,111,48,92,176]},"announce":[],"urlList":[]}}