{"title":"Metal Evolution S01E04 New Wave of British Heavy Metal","uid":6900249,"size":438882302,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d396d5511f25382eb7d70ce29b90e7aed6630550&amp;dn=Metal+Evolution+S01E04+New+Wave+of+British+Heavy+Metal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dududus","files":-1,"time":1324371789,"description":"Metal Evolution presents 11 episodes based on the much-debated Metal History &quot;family tree&quot; originally shown in Headbanger's Journey. This 24 sub-genre genealogical chart reveals the vast complex progeny of heavy metal--from Early Metal and Shock Rock to Thrash, from Progressive Metal to Grunge and Nu Metal. Using the chart as his road map, our host, metalhead turned anthropologist Sam Dunn, will crisscross the globe in search of the very essence of Metal, from bars and back alleys to the biggest open air festivals. \n\nThe New Wave Of British Heavy Metal marks no less than the establishment of hard rock's very first heavy metal army. Loud 'n' proud of it, this jean-jacketed legion of headbanging air guitarists snarled back at punk, expressed impatience with prog, and purposefully declared a banishment of ballads. Previously undefined and even a bit shameful, heavy metal was now boldly out of the closet, Iron Maiden, Motorhead, Saxon, Def Leppard, Raven, Tank and the Tygers Of Pan Tang seething out of the gates with fast, technical, uncompromising metal music, building a fanatical, energized movement that would lead to-as we will demonstrate in Episode 5-the establishment of a hard rock scene in Los Angeles built on similar devotional principles. The result would be a fulcrum shift to ten years of metal glory for America, with glam, thrash and everything in-between emerging out of California, thanks to the power and the glory of the NWOBHM and the obsessive fan culture it fostered\n &lt;a href=&quot;\nhttp://www.vh1.com/shows/metal_evolution/episode.jhtml?episodeID=181791&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.vh1.com/shows/metal_evolution/episode.jhtml?episodeID=181791&lt;/a&gt;","torrent":{"xt":"urn:btih:d396d5511f25382eb7d70ce29b90e7aed6630550","amp;dn":"Metal+Evolution+S01E04+New+Wave+of+British+Heavy+Metal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d396d5511f25382eb7d70ce29b90e7aed6630550","infoHashBuffer":{"type":"Buffer","data":[211,150,213,81,31,37,56,46,183,215,12,226,155,144,231,174,214,99,5,80]},"announce":[],"urlList":[]}}