{"title":"Reds (1981) 2GB 720p DivX HD from bluray (moviesbyrizzo)","uid":5965334,"size":2416835412,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:d49a7b97a5c472c82b5a9822e9bd91f6f990c366&amp;dn=Reds+%281981%29+2GB+720p+DivX+HD+from+bluray+%28moviesbyrizzo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1290098065,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0082979/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0082979/&lt;/a&gt;\n3hrs 15mins (cd1 1:43:58 cd2 1:31:18)\n\nStars Mr. Warren Beatty and the lovely Ms. Diane Keaon\n\nThis is a 1280 x 720 lovely convert from bluray source files\n256k audio track - English (if you speak Russian please note we have a separate\noffering for you of a Russian over-dubbed version launching separately on nominal\nbandwidth at this startng point).\n\nReds is the beautiful accomplishment of Mr. Warren Beatty. It is certainly one\nof the greatest of all tim movies ever made. the previous 1.4GB DivX we\nlaunched in 2 separate 700Meg files along with two great songs from the soundtrack\nis still seeding on the net quite well after all these years, however we intend to\nreplace it with this launch here, along with a non-HD disc player version of the\nbluray source files, which we are waiting to lauch soon in addition.\n\nWe aim for practical application of all our avi movie files so that they are\nable to play on your computer - which can hook up to your TV, or used on a disc\nplayer without having to pay for expensive blanc discs to do your burn\nwith. Nero has a free &quot;lite&quot; disc burner software download which is great\nand very competently designed in its appeal. Always burn at the minimum disc\nspeed setting that you can specify Nero to use, and then use &quot;windows task \nmanager&quot; on your PC to specify &quot;high processing priority&quot; for Nerosmart (during\nthe disc creation process). Make sure no other programs are running at the time,\nand always use &quot;disc verify&quot; feature in turned ON position in the Nero settings\ncontrol. A disc from HP should cost 20 cents or so.\n\n\nThe idea of this movie is to portray the spirit of American &quot;intellectuals&quot;\nof the era of when communism was a force the world had yet to come to terms with.\nAlthough this interest was well intentioned, it must be remembered that communism\nis cruel to the human spirit and is no real answer to our concerns for the \nappropriate sharing of resources as each must be given acoording to his true needs\n- his needs for justice, fairness, and the regonition of his true worth relatively\nspeaking, even amongst his own kinfolk, on the basis of true merit overall.\n\nWithout this, the human spirit starts to suffer and begins to wither away.\nThank goodness that this nightmare has come to an end, and more socially\nresponsible means must now be found for a better allocation of resources amongst\nour own folks in a spirit of true Christianly kindness without losing sight of merit of individual contribution and worthiness in this respect.\n\nYet - people of Russia have survived, and there is a beautiful spirit that \nyearns to join with its kindred spirits in other parts of Europe and elsewhere -\neven Australia I should think! It is time to reach out to our folks there and\nto help make Russia a vibrant part of a fuure European union based on real compatibilities that do exist most striongly here compared to elsewhere\nwe seek to add from perhaps too.\n\nRussia has much to teach from its experiment with communism - there is a spirit of family and of care for the larger community - as humans of worth always do their\nbest to strive for real meaning amidst whatever difficulties we have had to endure\nin what has been our existance on this earth thus far.\n\nThe spirit of communism must end - but not the spirit of willing to share and care\namidst our own, in our communities in a spirit of true Christianly kinship\nwith adequate care and regard for our societies overall, and in consideration\nof all we are able to contribute to make for a better place in which to live,\ncollectively in fact - as that is always how it should be - in a real sense\nfor that matter.\n\n\nMichael Rizzo Chessman\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:d49a7b97a5c472c82b5a9822e9bd91f6f990c366","amp;dn":"Reds+%281981%29+2GB+720p+DivX+HD+from+bluray+%28moviesbyrizzo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d49a7b97a5c472c82b5a9822e9bd91f6f990c366","infoHashBuffer":{"type":"Buffer","data":[212,154,123,151,165,196,114,200,43,90,152,34,233,189,145,246,249,144,195,102]},"announce":[],"urlList":[]}}