{"title":"PS2 MultiEmulator by HORUS (9196 roms)","uid":7252500,"size":3797843354,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:d7100b7351fcb9e538318b4bf6fb41245e2c0724&amp;dn=PS2+MultiEmulator+by+HORUS+%289196+roms%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dan.horus","files":1,"time":1336491100,"description":"This is my first torrent, hope you like it.\n\nIt's a MultiEmulator for the PS2 with a total of 9196 roms for Atari, Genesis, Master System, Nintendo and Super Nintendo.\n\nI also included the super-useful uLaunchELF in the DVD.\nYou can use it to backup your Memory Cards to PenDrives, transfer files between them, etc.\nThe CD version dummy file (~25 MB) is on the DVD root as well.\n\nI believe you need to have a ModChip-ed PS2, or use Swap Magic or something else to get this working.\nI have a Matrix Infinity on my PS2 Slim and it works just fine.\n\nNote on the Master System emulator, PSMS:\nBefore entering this emulator, you need to press circle in order to change to version 1.33!\nYou also need a Memory Card inserted in your PS2 for it to work!\n\nNote on the Super Nintendo Emulator, SNES Station:\nIn-game sound is disabled by default. \nTo turn it on, enter the options menu in the emulator by pressing triangle in the rom selection screen.\nThe first option there is a sound toggle.\n\nThis work is intended to be completely free!\nCredits go to the coders and developers of the ELF files included.\nSpecial credits go to Arcanjo.eb, the first one AFAIK to create a MultiEmulator based on Multiloader.elf.\nThis MultiEmulator I made is just a much more complete version of his.\n\nDownload it, keep seeding it and I hope you enjoy it a lot!\nIn case of other doubts, feel free to ask me or Google it. :)\n\nHere you can check a list of all the roms included (if the link appears, erase the spaces):\nnotepad . cc / share / 9o6Fn5g3D4","torrent":{"xt":"urn:btih:d7100b7351fcb9e538318b4bf6fb41245e2c0724","amp;dn":"PS2+MultiEmulator+by+HORUS+%289196+roms%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7100b7351fcb9e538318b4bf6fb41245e2c0724","infoHashBuffer":{"type":"Buffer","data":[215,16,11,115,81,252,185,229,56,49,139,75,246,251,65,36,94,44,7,36]},"announce":[],"urlList":[]}}