{"title":"Naruto (ALL EPISODES AND MOVIES)","uid":3556635,"size":39858939529,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d7d8911c5ccd41604493aa2f1c132482639adb99&amp;dn=Naruto+%28ALL+EPISODES+AND+MOVIES%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Duskeren","files":206,"time":1163427366,"description":"Age rating:\nTeenagers (May contain bloody violence, bad language, nudity)\n\nGenres:\nAdventure, Comedy, Drama, Fantasy, Historical, Shounen, Supernatural\n\nPlot Summary:\nNaruto closely follows the life of a boy who is feared and detested by the villagers of the hidden leaf village of Konoha. The distrust of the boy has little to do with the boy himself, but it?s what?s inside him that causes anxiety. Long before Naruto came to be, a Kyuubi (demon fox) with great fury and power waged war taking many lives. The battle ensued for a long time until a man known as the Fourth Hokage, Yondaime, the strongest ninja in Konoha, fiercely fought the Kyuubi. The fight was soon won by Yondaime as he sealed the evil demon in a human body. Thus the boy, Naruto, was born. As Naruto grows he decides to become the strongest ninja in Konoha in an effort to show everyone that he is not as they perceive him to be, but is a human being worthy of love and admiration. But the road to becoming Hokage, the title for the strongest ninja in Konoha, is a long and arduous one. It is a path filled with betrayal, pain, and loss; but with hard work, Naruto may achieve Hokage.\n\nNotes:\nThis series is still ongoing, so there will be one episode every week. This package contains the complete(i think) series up till now.\nPlease note that there is no EPISODE 205 in this package, thats because the group [DB] mistagged a release, there fore episode 202-203-204 SHOULD have been 203-204-205.\nBtw, no need to download it all, but if you&amp;#039;d like to try it out, just grap one episode or two.","torrent":{"xt":"urn:btih:d7d8911c5ccd41604493aa2f1c132482639adb99","amp;dn":"Naruto+%28ALL+EPISODES+AND+MOVIES%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7d8911c5ccd41604493aa2f1c132482639adb99","infoHashBuffer":{"type":"Buffer","data":[215,216,145,28,92,205,65,96,68,147,170,47,28,19,36,130,99,154,219,153]},"announce":[],"urlList":[]}}