{"title":"Age of Wonders III 2014  v.1.09.11085 (2-click run)","uid":9943575,"size":1390718798,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d81aee089869eb9799242925384bd0c758092384&amp;dn=Age+of+Wonders+III+2014++v.1.09.11085+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1397283686,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a 'Easy Run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDESCRIPTION:\nAge of Wonders III is the long anticipated sequel to the award-winning\nstrategy series. Delivering a unique mix of Empire Building, Role Playing and\nWarfare, Age of Wonders III offers the ultimate in turn-based fantasy\nstrategy for veterans of the series and new players alike!\n\nCreate an Empire in your own Image\n\n* Rule as one of 6 RPG style leader classes: Sorcerer, Theocrat, Rogue\nWarlord, Archdruid, or the tech-focused Dreadnought\n* Research powerful skills unique to your class to develop your empire and\narsenal\n* Choose your allies from among the six main races - Humans, High Elves\nDwarves, Orcs, Goblins and Draconians - and fantastical monster dwellings\nExplore and Exploit a Living Fantasy World\n\n* Explore a rich fantasy world that is more detailed and alive than ever with\nover 50 location types to raid for treasure\n* Expand your domain by building new settlements, forge pacts with monstrous\nallies and capture valuable resources\n* Wield earth shattering magic and terra-form the lands for your needs\nFight In-depth Tactical Battles\n\n* Recruit legendary heroes, equip them with magical weapons, and let them\nlead your armies into battle\n* Crush your enemies using the detailed 3D turn-based Tactical Combat System\n* Become a master tactician. Crush city defenses. Learn to use flanking and\nmaster your army's hundreds of abilities\nMaster Age of Wonders III's many Modes!\n\n* Immerse yourself in a rich single player story campaign, playable from two\nsides of an epic conflict\n* Create endless scenarios using the random map generator\n* Compete in multiplayer wars with up to 8 players online\nPlease note that:\n\n* Level Editing Tools are provided as a courtesy to fans. They might have\ndifferent system specifications from the Age of Wonders III game, are not\ntech supported and have an English only interface\n* Coop: Random maps and stand-alone scenarios can be played using player\nalliances versus computer opponents\n* Local Coop: Random maps and stand-alone scenarios can be played using Hot\nSeat mode on the same computer using player alliances versus computer\nopponents\n\n\n\nInstallation instructions:\n1. Execute the .exe file.\n2. Follow the instructions.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:d81aee089869eb9799242925384bd0c758092384","amp;dn":"Age+of+Wonders+III+2014++v.1.09.11085+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d81aee089869eb9799242925384bd0c758092384","infoHashBuffer":{"type":"Buffer","data":[216,26,238,8,152,105,235,151,153,36,41,37,56,75,208,199,88,9,35,132]},"announce":[],"urlList":[]}}