{"title":"Kindle Book: Lust Demented (Book 1 of the Race Against Death Ser","uid":6761750,"size":909544,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d83884a11f06294e9e52a59117c33f4e0407e20a&amp;dn=Kindle+Book%3A+Lust+Demented+%28Book+1+of+the+Race+Against+Death+Ser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Noirfreak","files":1,"time":1319230634,"description":"Summary from Amazon.com:\n\nNo writer in NYC is safe. Gothic scribes with cult followings are bleeding under stained glass. Golden child authors are swandiving from the top of New York Public Library defiling their legacy. Scumbag cops, Detective Anderson and Sgt. Bethany Powers are slaps away from exposing the shady deal Farrow cut with Featherton. The world Farrow enters just keeps moving faster and faster...it seems only his own death can slow it down, until he discovers that something greater than his words were stolen...something more beautiful than he's ever run into before...something that inspires him to dig deeper into his own soul...something alive...\n\nAn Excerpt:\n\nThe entire city was sinister, full of secret worlds. We were already halfway down the curling stairs. Past the non-descript sign. Past the doorman who let us in with a wink. I wasn't sure exactly where the sleeze was oozing from, but it was oozing.\n&quot;Farrow this may not be easy for you to hear: We know where Missy is.&quot; Detective Anderson looked twice as menacing and massive in the red-lighting. Together we allowed ourselves to be swallowed by the giant velvet labia with mirrored ceilings and walls. In a backless dress, black lace cut diamonds of soft skin on her thighs. She wasn't facing me yet. She teased us with glimpses of improvisation. Even the women in the audience got excited twirling the thin straws dangling in their drinks.\nShe was something else, dancing the same old feather boa routing as if nothing's on the line. Whipping her body with a quick turn and a look of suspense, she fell back when she saw my face. Already on her hands and knees, she called me to her, hand outstretched, hooking her finger to the slappy upright bass. The entire lair was sure she was summoning them. I blinked and her stockings were off, balled up and flying through the air. Hypnotically, I gravitated as close as possible to her scent, until my nose was resting on the stage with the others. Hysteria got the better of us as we grabbed for her uncontrollably. She taunted us ripping a cane out of an older gentleman's hand, sliding it across her skin, pumping it between her legs, mockingly attempting to deep throat it, only\nto twirl it like a schoolgirl at a pep rally.\n&quot;Hey you.&quot; She whispered breathily leaning in towards me, blowing a kiss.\n&quot;What baby what?&quot; I mouthed at her, shaking my head instinctively. She tightened her lips, raising an eyebrow.\n&quot;You better learn to read a lady's mind.&quot; The music stopped momentarily so the whole\nroom could hear her.\n&quot;I will.&quot; All the men mouthed in unison.\n&quot;What gives you the right to look at me like that?&quot; She held her stare for as long as I could take it. Squeezing her breasts together, she stood above me, brave and unashamed, commanding the dive with a whimsical smirk.\n&quot;You look like someone I know. Someone I once knew.&quot; I looked and looked away. She\ngrabbed me violently and kissed me gently. It was another last kiss that I waited for without admitting. She tasted of Christmas tree gin and subway tunnel perfume. It was theatrical and anonymous. It was a soft spark. Static electricity.\nCalm moments pass fast in this land. The bloated fellows packing the joint lost their brotherhood and resorted to simpler times. A scuffle broke out. Two desperadoes that didn't forget to bring their brimmed hats when they crossed the border. The space was so cramped that we were all connected at the hips. The band tried to hold it together as the percussion intensified knuckles striking bone. Violent men with looks of insatiable hunger multiplied spawning from each other. Strange how they focused on each other with such hate, forgetting the one woman left the room. She punched and kneed the air playfully. Biting into nothingness like a newborn going for a missing breast. There was a\ncertain freedom to the madness. I saw beauty, but had no hold on her. \n\nA NOTE FROM THE AUTHOR: This book is a declaration of literary war on the large publishing houses of New York City and the World.\n\nLust Demented is Book #1 of the Race Against Death series. \n\nAvailable on Amazon","torrent":{"xt":"urn:btih:d83884a11f06294e9e52a59117c33f4e0407e20a","amp;dn":"Kindle+Book%3A+Lust+Demented+%28Book+1+of+the+Race+Against+Death+Ser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d83884a11f06294e9e52a59117c33f4e0407e20a","infoHashBuffer":{"type":"Buffer","data":[216,56,132,161,31,6,41,78,158,82,165,145,23,195,63,78,4,7,226,10]},"announce":[],"urlList":[]}}