{"title":"Disney Movie - Chips the War Dog","uid":6666006,"size":1496876513,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d8683c0a95232cd9f579ad55257f553d33a5abb8&amp;dn=Disney+Movie+-+Chips+the+War+Dog&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cowboy23","files":2,"time":1315685071,"description":"Yet another one of my favorites from watching the Disney Channel growing up. Quality is pretty good, I've been unable to find this on DVD. Thanks is appreciated.\n\n\nChips the dog was the most decorated war dog from World War II. Chips was a German Shepherd-Collie-Siberian Husky mix owned by Edward J. Wren of Pleasantville, NY. During the war, private citizens like Wren donated their dogs for duty. Chips shipped out to the War Dog Training Center, Front Royal, Virginia, in 1942 for training as a sentry dog. He served with the 3rd Infantry Division in North Africa, Sicily, Italy, France and Germany. His handler was Pvt. John P. Rowell. Chips served as a sentry dog for the Roosevelt-Churchill conference in 1943. Later that year, during the invasion of Sicily, Chips and his handler were pinned down on the beach by an Italian machine-gun team. Chips broke from his handler and jumped into the pillbox, attacking the gunners. The four crewmen were forced to leave the pillbox and surrendered to US troops. In the fight he sustained a scalp wound and powder burns. Later that day, he helped take 10 Italians prisoner. For his actions during the war, he was awarded the Distinguished Service Cross, Silver Star, and Purple Heart; however, these awards were later revoked due to an Army policy preventing official commendation of animals. His unit unofficially awarded him a Theater Ribbon with an Arrowhead for an assault landing, and Battlestars for each of his eight campaigns. Chips was discharged in December 1945 and returned to the Wren family.\nIn 1990, Disney made a TV movie based on his life, entitled Chips, the War Dog.","torrent":{"xt":"urn:btih:d8683c0a95232cd9f579ad55257f553d33a5abb8","amp;dn":"Disney+Movie+-+Chips+the+War+Dog","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8683c0a95232cd9f579ad55257f553d33a5abb8","infoHashBuffer":{"type":"Buffer","data":[216,104,60,10,149,35,44,217,245,121,173,85,37,127,85,61,51,165,171,184]},"announce":[],"urlList":[]}}