{"title":"flashtool-0.9.18.3-windows.exe","uid":11666971,"size":185056618,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d9a09b8fda80cb493947232a1d7f62dd852e12dc&amp;dn=flashtool-0.9.18.3-windows.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lissa222","files":1,"time":1418073639,"description":"Flashtool is a S1 flashing software that works for all Sony phones from X10 to Xperia Z Ultra. They all use the S1 protocol for flashing firmwares.\nThis program was originally made to flash sin files downloaded by SEUS or PCC. From time to time, sin files have been bundled into what is now well known FTF (Flash Tool Firmwares). That is the core of Flashtool and the reason of its name.\nFlashtool can also easily unlock the bootloader of the phone using the BLU icon as far as the bootloader of your phone is unlockable\nThe flashing feature as well as bootloader unlock feature are available whatever the phone is recognized or not by the application. What is only mandatory for flashing is to own the FTF file according to the device you want to flash it on.\n\n\nWhy should I use flashtool ?\nOnce bootloader unlocked, official sony tools do not work anymore.\nUsing official sony tools, you can only upgrade. No downgrade possible.\nUsing flashtool, you can choose what to flash and what not to flash. This said, many rooting scenarios are available implying kernel only downgrade to retrieve a patched rooting exploit and then flash back the right kernel.\nMany other features have been built-in so that Flashtool can also be used to (as far as the phone is recognized by Flashtool) :\nRoot your phone\nInstall recovery, busybox, custom kernels\nClean your rom (remove /system/apps apps of your choice) (Be careful, unless you really know what you do, do not modify the default list. This can make your phone stuck at the SE Logo)\nClear dalvik cache\nOptimize (install of JIT v2) (plugin for 2.1 phones only from 2010 line)\nCustomize (installs apps found in the custom/apps folder of the flashtool)\nEdit any text file on the device\nRebrand your device","torrent":{"xt":"urn:btih:d9a09b8fda80cb493947232a1d7f62dd852e12dc","amp;dn":"flashtool-0.9.18.3-windows.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9a09b8fda80cb493947232a1d7f62dd852e12dc","infoHashBuffer":{"type":"Buffer","data":[217,160,155,143,218,128,203,73,57,71,35,42,29,127,98,221,133,46,18,220]},"announce":[],"urlList":[]}}