{"title":"Up with Chris Hayes 9-16-12.mp4","uid":7644435,"size":340256373,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:daf188aa62991e2c6b8434f9cfe08c0082486ab6&amp;dn=Up+with+Chris+Hayes+9-16-12.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"liberal42","files":-1,"time":1347864505,"description":"Up with Chris Hayes; Sunday, September 16, 2012. Guest host Sam Seder.\n\nSunday Sam and his guests took a close look at poverty figures released this week by the Census Bureau, which show that nearly one in six Americans are living in poverty. They examined the poverty crisis through the lens of education by talking about the teachers' strike in Chicago. They also discussed representations of poverty in our culture and in our politics, and highlighted a stunning new report which showed that poverty has been essentially ignored by the media covering presidential campaign.\n\nSam Seder, host of The Majority Report, filled in for Chris Hayes. Joining Sam were:\n\n\nJosh Barro (Bloomberg View), Melissa Boteach, director of the &quot;Half in Ten&quot; campaign at the Center for American Progress, a campaign to cut poverty by half in 10 years) Gary Younge, (Guardian columnist &amp; feature writer, columnist for The Nation, Chicago resident and parent who has been covering the Chicago teachers strike for the Guardian), Julie Cavanagh (NYC teacher) talked about the Chicago teacher's strike.\n\nYhen, Matt Farmer (Chicago lawyer and parent, member of his local school council at Philip Rogers Elementary School, contributor to the Huffington Post) joined via NBC News Chicago to discuss the strike.\n\nCompletely new panel:\n\nTanya Wells, (who, along with her husband, lost her job in 2008 and has gone back to school to try to get back on her feet. Tanya's family now survives in large part with the help of student loans, Medicaid, and food stamps), Stephen Pimpare, (associate professor at Columbia University School of Social Work, author of &quot;A People's History of Poverty in America&quot;), Steven Gates )program director, Youth Advocacy Programs-Illinois and resident of the Roseland area of Chicago), John Reel (assistant to the director at Senior Service America, Inc) talked about poverty.\n\n\nTanya Wells, Josh Barro, Gary Younge, and Mellisa Boteach made up the next panel, which discussed the politics of poverty.\n\n'You Should Know' the latest panel finished the show.","torrent":{"xt":"urn:btih:daf188aa62991e2c6b8434f9cfe08c0082486ab6","amp;dn":"Up+with+Chris+Hayes+9-16-12.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daf188aa62991e2c6b8434f9cfe08c0082486ab6","infoHashBuffer":{"type":"Buffer","data":[218,241,136,170,98,153,30,44,107,132,52,249,207,224,140,0,130,72,106,182]},"announce":[],"urlList":[]}}