{"title":"Cold Feet Season 3","uid":4862228,"size":3763449214,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:db1b7e87362258c36bbb8a073250bd96d8f8ef08&amp;dn=Cold+Feet+Season+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KP12388","files":8,"time":1240319017,"description":"Series 3\n\nHalf a year after the Lindisfarne trip, Pete and Jenny have separated. He moves from house to house, eventually finding a houseshare with a gay landlord. He has a brief fling with Ramona, which is followed by some dates with a teacher (Pooky Quesnel). Jenny begins a relationship with a dotcom millionaire (Ben Miles), who decorates her house with flowers and takes her on a trip to New York. The fling ends when Jenny realises he does not love her. She and Pete reconcile after briefly considering a divorce. David and Karen bring home their new-born twins and Karen's ex-pat mother (Mel Martin) moves in for a couple of episodes. Karen is reunited with an old boyfriend (Richard Dillane), who is in Manchester for a photography exhibition. Karen is rivalled by Jenny, who has returned to working to pay the bills while Pete is living elsewhere. David takes a sudden interest in politics after meeting local residents' activist Jessica (Yasmin Bannerman). He starts an affair with her but she dumps him after being offended by his insensitivity. Karen finds out about the affair in Episode 8 but is adamant that she and David will stay together for the children. Adam and Rachel decide to have children but are distraught to discover that she is infertile from complications with her abortion. They decide to get married instead but Adam is briefly tempted when he reunites with a long-lost love (Victoria Smurfit) on his stag weekend to Belfast.","torrent":{"xt":"urn:btih:db1b7e87362258c36bbb8a073250bd96d8f8ef08","amp;dn":"Cold+Feet+Season+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db1b7e87362258c36bbb8a073250bd96d8f8ef08","infoHashBuffer":{"type":"Buffer","data":[219,27,126,135,54,34,88,195,107,187,138,7,50,80,189,150,216,248,239,8]},"announce":[],"urlList":[]}}