{"title":"Wonders of the Universe (2011) [720p][Bluray]","uid":12624153,"size":3700066294,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:dbc04b0d05cabb5459430c6db3d6ff27fec24a33&amp;dn=Wonders+of+the+Universe+%282011%29+%5B720p%5D%5BBluray%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"redback9","files":4,"time":1445645485,"description":"Thanks to tlacatlc6 for providing and ripping the Bluray\r\n\r\nProfessor Brian Cox visits some of the most dramatic parts of the globe to explain the fundamental principles that govern the laws of nature - light, gravity, energy, matter and time. With the world's most profound science at its heart, Wonders Of The Universe reveals how the story of humanity is intimately entwined with that of the complex story of the origins of the universe.\r\n\r\nSeason 1\r\n\r\nThe Cosmos Made Conscious S1, Ep1\r\nNatural scientists fail to define time, yet they agree with philosophers it's crucial at least to our perception of reality. Without time, there could be no change, hence neither life nor civilization would exist. Measuring time and predicting the natural cycles which it drives, such as the seasons, is crucial for agriculture, etc., as ancient monuments testify. Yet time is always relative, even in natural terms.\r\n \r\nStardust S1, Ep2\r\nIn the second stop in his exploration of the wonders of the universe, Professor Brian Cox goes in search of humanity's very essence to answer the biggest questions of all: what are we? And where do we come from? This film is the story of matter - the stuff of which we are all made. Brian reveals how our origins are entwined with the life cycle of the stars. But he begins his journey here on Earth.\r\n\r\nFalling S1, Ep3\r\nProfessor Brian Cox takes on the story of the force that sculpts the entire universe - gravity. It seems so familiar, and yet gravity is one of the strangest and most surprising forces in the universe. In a zero gravity flight, Brian considers how much of an effect gravity has had on the world around us. But gravity also acts over much greater distances. It is the great orchestrator of the cosmos.\r\n \r\nMessengers S1, Ep4\r\nIn the last episode of Professor Brian Cox's epic journey across the universe, he travels from the fossils of the Burgess Shale to the sands of the oldest desert in the world to show how light holds the key to our understanding of the whole universe, including our own deepest origins. But first we need to understand the peculiar properties of light itself","torrent":{"xt":"urn:btih:dbc04b0d05cabb5459430c6db3d6ff27fec24a33","amp;dn":"Wonders+of+the+Universe+%282011%29+%5B720p%5D%5BBluray%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbc04b0d05cabb5459430c6db3d6ff27fec24a33","infoHashBuffer":{"type":"Buffer","data":[219,192,75,13,5,202,187,84,89,67,12,109,179,214,255,39,254,194,74,51]},"announce":[],"urlList":[]}}