{"title":"Weis &amp; Hickman - De Oorlog der Zielen  (E-Book)NLT-Release","uid":6629398,"size":2668352,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc18df9f3785c5590a8f9356030cc1849e62ad76&amp;dn=Weis+%26+Hickman+-+De+Oorlog+der+Zielen++%28E-Book%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"linday1","files":-1,"time":1314278413,"description":"\nDraken van een gevallen Zon:\n\nVeertig jaren zijn verstreken sinds de vernietigende Oorlog van de Chaos. De goden hebben het volk van Krynn verlaten. Wrede, machtige draken hebben het continent Ansalon in hun greep en eisen schatting van de onderworpen bevolking.\n\nDan steekt er een magische orkaan op over Ansalon. Branden en overstromingen, dood en verderf volgen.\n\nIn de ronkende wanorde staat een jonge vreemdelinge op. Haar mystieke lot hangt samen met dat van Krynn, want zij weet als enige de waarheid omtrent de toekomst, die bepaald wordt door een angstaanjagend geheim uit Krynns verleden. \n\n\n\nDragonlance werd in 1983 door Tracy Hickman ontworpen als wereld voor een groots nieuw spel. Spoedig daarna ontstonden, in samenwerking met Margaret Weis, vele games en fantasyromans. Ook Draken van een Gevallen Zon behoort tot de Dragonlance-groep. \n\n\nDraken van een Verloren Ster:\n\nHet volk van Krynn is onderworpen aan een geheimzinnige kracht. Een jonge vrouw roept een onbekende god aan om haar leger van donker geharnaste ridders de overwinning te schenken.\n\nTegelijkertijd worden de levenden van hun magie beroofd. En een drakenheer bedreigt Silvanesti, het geliefde land der elfen.\n\nTemidden van deze wanorde worstelt een groep dappere onbaatzuchtige helden tegen een onsterfelijke macht. Zal de invallende duisternis alle hoop, alle geloof, alle licht opslokken? \n\n\nDraken van een verdwenen Maan:\n\nOorlogsvlammen verzengen Ansalon. Het leger van de dode zielen trekt op onder aanvoering van de mystieke strijdster Mina.\n\nEen kleine groep helden voert het wanhopige gevecht aan, tegen alle beter weten in. Dan komen twee onwaarschijnlijke hoofdpersonen te voorschijn.\n\nDe een is Malys, die niet gemakkelijk afstand zal nemen van Mina's heerschappij. De ander, de fiere Tasslehoff, keert terug van een vreemde reis die op onthutsende en onvoorziene wijze zal eindigen. \n\n\nVoor de nieuwste films en muziek ga je naar:\n &lt;a href=&quot;\nhttp://www.movierecensies.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.movierecensies.nl&lt;/a&gt;\n\n\nBy Linday","torrent":{"xt":"urn:btih:dc18df9f3785c5590a8f9356030cc1849e62ad76","amp;dn":"Weis+%26+Hickman+-+De+Oorlog+der+Zielen++%28E-Book%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc18df9f3785c5590a8f9356030cc1849e62ad76","infoHashBuffer":{"type":"Buffer","data":[220,24,223,159,55,133,197,89,10,143,147,86,3,12,193,132,158,98,173,118]},"announce":[],"urlList":[]}}