{"title":"GAY - Studio 2000's Meltdown [avi-354-2002]","uid":4759059,"size":765625280,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:dc6b3bc633599fe5614cb0aba2a0d81a412fd99c&amp;dn=GAY+-+Studio+2000%5C%27s+Meltdown+%5Bavi-354-2002%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Froggy65","files":1,"time":1236622575,"description":"Meltdown stars perfect-peckered Ladislav Pekar, blond, bottom-babe Josef Sladek, and brunet beauty Daniel Palffy have never been more cumbustible. \n\nExtra special attention must be given to Spanish exclusive Rafael Carreras a pouty, provocative beauty with dark eyes, fuck-my-face lips, and a mane of tousled dark hair. \n\nThe rest of the cast - Patrik Levaj, Lubo Kurnikov, Zdenek Vespar, Reno Hacek, Carlo Kovarik and Michael Kozec prove once again that Studio 2000's Czech-Mates - are all in a carnal class by themselves.\n\n__________\n\n\nStudio 2000 International's ball-draining blockbuster Meltdown will arouse and astound you. As amazing as it sounds, director Jan Novak and Studio 2000 have come up with a cast of flawless, frisky fellows who all possess phenomenal foreskinned phalluses, bountiful bootys, and buffed boy-bods that will leave you smiling and spent. Studio 2000 International's most popular exclusives such as perfect-peckered Ladislav Pekar, blond, bottom-babe Josef Sladek, and brunet beauty Daniel Palffy have never been more cumbustible. Extra special attention must be given to Spanish exclusive Rafael Carreras a pouty, provocative beauty with dark eyes, fuck-my-face lips, and a mane of tousled dark hair. His massive meat, thick, long, full of cream, and surrounded by curly pubes, is forever roaring and ready to rock. The rest of the cast comprised of Patrik Levaj, Lubo Kurnikov, Zdenek Vespar, Reno Hacek, Carlo Kovarik and Michael Kozec prove once again that Studio 2000's Czech-Mates are all in a carnal class by themselves.\n\nThe location for all the sizzling action is a ski lodge and nearby village, which is full to the brim with horny guys. In a secluded room the incandescent Josef Sladek and dream-doll Rafael Carreras don't take long to get down to business. Sladek sucks on Carreras' cream sickle with obvious hunger, licking at the foreskin and savoring every considerable inch. Carreras' cock has a slight curve, which seems to slide down Sladek's throat with ease. When it comes time for Carreras to show his skills as a cocksucker he rises to the occasion and devours Sladek's schlong. They both shoot their loads with Carreras gushing what seems like gallons. The fun has just begun as Carreras laps at Sladek's butthole, getting it good and wet, before replacing his tongue with his donkey dick. The close-ups are tight, almost as tight as the fit, as he screws sexy Sladek in both the missionary and doggie positions before they both cum again.\n\nIn the village resort's gymnasium, the sauna and shower room is the setting for an oral encounter between fan favorite Daniel Palffy and ultra-cutie Michael Kozec. Nature takes its course as both these dazzling dudes take their time sucking on each other's joysticks. In what has become a Studio 2000 International trademark they both fire off truly eye-opening amounts of guy gravy.\n\nStill at the gymnasium and at the bottom of an empty indoor pool we are introduced to a couple of buff beauties, brunet, big-bonered Reno Hacek and glow-in-the-dark blond Zdenek Vespar. They both show off their skills at giving head with the best moment coming when Hacek pulls out of Vespar's mouth and creams all over his chest causing Vespar to milk off his own monkey. What cocks, what loads! Of course, it is the blond's fuzzy butt which gets fucked all over the place in a couple of potent positions until they both let fly another volley of lava- like loads.\n\nIn another part of the lodge, horse-hung Ladislav Pekar gets acquainted with luscious Lubo Kurnikov. Besides the fact that they are both adorable, this scene is extra hot because they look very much alike. In fact, the only sure way you can tell them apart is to look between their legs. Pekar's proud piece will always set him apart from other men. Kurnikov tries hard to swallow all that Pekar has to offer and is rewarded by Pekar deep-throating Kurnikov's cock. They both whack off their woodies with Pekar's prick the winner, hands down, in the size and the long-distance load departments. Kurnikov sits down on Pekar's poker for a wild ride, his asshole stretched to its limits, and both blast off, you guessed it, another round of sticky stuff. You will rewind this tape again and again to witness these garden hose cum-showers.\n\nRafael Carreras has a skiboard accident and, lucky for him, blond Carlo Kovarik is there to lend a hand. He helps Carreras back to his room and offers first aid, which in true Studio 2000 fashion, starts with pulling down his black briefs and sucking his jumbo joint. As he licks at his prick and nibbles his nuts we can see that the damage from the accident on the slopes has all but disappeared. The lesson to be learned is that a good blowjob will cure a multitude of problems. Blond boy-toy Patrik Levaj joins in and both he and Kovarik service Carreras' colossial cock. Believe us there is plenty to go around. This double dick-athon causes all to release and gets Carreras even hotter. He is soon fucking Kovarik who his sucking Levaj. This is one hell of a threeway with everyone getting into the action. Later on, Kovarik sits on Levaj's log and tries it on for size before all three climax again.\n\nMeltdown is Studio 2000 International at its white-hot best. This cast of fully-loaded cumsters is glossy and gorgeous and the sex is in your face where you want it to be.","torrent":{"xt":"urn:btih:dc6b3bc633599fe5614cb0aba2a0d81a412fd99c","amp;dn":"GAY+-+Studio+2000%5C%27s+Meltdown+%5Bavi-354-2002%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc6b3bc633599fe5614cb0aba2a0d81a412fd99c","infoHashBuffer":{"type":"Buffer","data":[220,107,59,198,51,89,159,229,97,76,176,171,162,160,216,26,65,47,217,156]},"announce":[],"urlList":[]}}