{"title":"Gone (FAYZ) Series by Michael Grant RELOADED","uid":8353049,"size":5387560,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de46db78e309457a04c3e406bcc06ebfc371893c&amp;dn=Gone+%28FAYZ%29+Series+by+Michael+Grant+RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NewSky000","files":7,"time":1365401746,"description":"Title: Gone (FAYZ) Series\n\nAuthor: Michael Grant\n\nBook(s): 6\n\nFormat: eBook (.epub)\n\nAdditional Info: Readme File\n\n*Calibre is a great free tool for managing ebooks. Link: http://www.calibre-ebook.com/\n\nGenres: Sci-Fi, Fantasy, Dystopia, Adventure\n\nSummary:\n\nIn the blink of an eye. Everyone disappears. GONE.\n\nExcept for the young. Teens. Middle schoolers. Toddlers. But not one single adult. No teachers, no cops, no doctors, no parents. Just as suddenly, there are no phones, no internet, no television. No way to get help. And no way to figure out what's happened.\n\nHunger threatens. Bullies rule. A sinister creature lurks. Animals are mutating. And the teens themselves are changing, developing new talents--unimaginable, dangerous, deadly powers--that grow stronger by the day.\n\nIt's a terrifying new world. Sides are being chosen, a fight is shaping up. Townies against rich kids. Bullies against the weak. Powerful against powerless. And time is running out: On your birthday, you disappear just like everyone else... - Goodreads Summary of Gone (Gone #1)\n\nNote: A critically claimed series, mainly for young adults. Recommendable to everybody (YA and older). This series is similar to the dystopian aspects of society like The Hunger Games by Suzanne Collins and Divergent by Veronica Roth. An excellent read and will most definitely hook you!\nP.S. Check RELOADED below to see what was updated in this torrent.\n\nCompatibility: Most eReaders\n\nCovers: Yes\n\nMetadata: Yes\n\nRELOADED: This torrent is a reload of the original for the purpose that this one has the fixed version of Plague. In the original version of book 4, the book was spammed with a string of HTML contexts that should've been removed, which I did manually. Also added the the final book, book 6; Light. Happy Reading!\n\nAny requests? Concerns? Comments? Anything of the sort? Then plz view readme for support link.\n\n\nPlease seed and thanks for downloading!\n\n\n\nBy: MastermindTTA ~ Thanks for the support!","torrent":{"xt":"urn:btih:de46db78e309457a04c3e406bcc06ebfc371893c","amp;dn":"Gone+%28FAYZ%29+Series+by+Michael+Grant+RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de46db78e309457a04c3e406bcc06ebfc371893c","infoHashBuffer":{"type":"Buffer","data":[222,70,219,120,227,9,69,122,4,195,228,6,188,192,110,191,195,113,137,60]},"announce":[],"urlList":[]}}