{"title":"HISTORY OF POP AND ROCK MUSIC - part 564","uid":10583832,"size":1221069355,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:de776a5a1da1a24cff1141591a147a3323632579&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+564&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1405724167,"description":"\n\n                          PART  564 \n\n\n                \n              CREAM  -  Spoonful  (1967)  - Revolution Club\n              CREAM  -  Tales Of Brave Ulysses  (1967)  - Revolution Club\n              CREAM  -  Sunshine Of Your Love (1967)  - Revolution Club\n              CREAM  -  White Room  (1968)  -  Royal Albert Hall\n                                  \n                                  \n\n\n         &quot;Spoonful&quot; is a blues song written by Willie Dixon and first recorded in 1960 by Howlin' Wolf. Called &quot;a stark and haunting work&quot;, it is one of Dixon's best known and most interpreted songs. The Rock and Roll Hall of Fame listed Howlin' Wolf's &quot;Spoonful&quot; as one of the &quot;500 Songs that Shaped Rock and Roll&quot;. It is also ranked #219 on Rolling Stone magazine's list of the &quot;500 Greatest Songs of All Time .\nEtta James had a pop and R&amp;B record chart hit with &quot;Spoonful&quot; in 1961 and it was popularized in the later 1960s by the British rock group Cream.  Cream recorded &quot;Spoonful&quot; for their 1966 UK debut album, &quot;Fresh Cream&quot;. For the American release of &quot;Fresh Cream&quot;, &quot;I Feel Free&quot; was substituted for &quot;Spoonful&quot;. \n\n       &quot;Tales of Brave Ulysses&quot; is a song performed by Cream. The lyrics were written by artist Martin Sharp, and the music was composed by Eric Clapton. Arranged by Robert Stigwood, the song is featured on Cream's album &quot;Disraeli Gears&quot;. The day before writing the song, Clapton discovered the wah-wah pedal, which augmented the song. The lyrics are inspired by Homer's Odyssey, an account of the adventures undertaken by Ulysses.This can be seen in the song's reference to &quot;how his naked ears were tortured by the sirens sweetly singing,&quot; an event from Homer's epic poem. \n\n         &quot;Sunshine of Your Love&quot; is a 1967 song written by Jack Bruce, Pete Brown and Eric Clapton. It was originally released on the album Disraeli Gears in November 1967, and was later released as a single in January 1968. It is Cream's only gold-selling single in the United States. It features a distinctive electric/bass guitar riff and a guitar solo from Clapton.\nIn 2004, the song was ranked at No. 65 on Rolling Stone magazine's list of The 500 Greatest Songs of All Time. In March 2005, Q magazine placed &quot;Sunshine of Your Love&quot; at No. 19 on its list of the 100 Greatest Guitar Tracks. In 2009 it was named the 44th best hard rock song of all time by VH1. The song is also a part of the Rock and Roll Hall of Fame's 500 Songs That Shaped Rock and Roll list.","torrent":{"xt":"urn:btih:de776a5a1da1a24cff1141591a147a3323632579","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+564","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de776a5a1da1a24cff1141591a147a3323632579","infoHashBuffer":{"type":"Buffer","data":[222,119,106,90,29,161,162,76,255,17,65,89,26,20,122,51,35,99,37,121]},"announce":[],"urlList":[]}}