{"title":"Coalesce - Discography (1997-2009) [FLAC]","uid":9446163,"size":2186752815,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:df41ca3591b5e9be01da2fcb61cd6f0459711dbd&amp;dn=Coalesce+-+Discography+%281997-2009%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"politux","files":-1,"time":1389054389,"description":"\n  Coalesce - Discography (1997-2009) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Hardcore, Metal\n  Source: CD\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  1997 Give Them Rope\n  1997 Give Them Rope (2004 Reissue)\n  1998 002 A Safe Place EP\n  1998 Functioning On Impatience\n  1999 There Is Nothing New Under the Sun\n  1999 There Is Nothing New Under The Sun (2007 Reissue)\n  1999 0:12 Revolution in Just Listening\n  2000 Split with Boysetsfire\n  2009 Ox EP \n  2009 Ox \n\n  Coalesce's music has consistently pushed the boundaries of the hardcore and metal genres, forging a mind-boggling obsession with strange, shifting tempos with power, noise, groove, and a creativity paralleled only by the band's peers in Dillinger Escape Plan and Botch. The origins of Coalesce can be traced back to a band called Breach -- a group not to be confused with the European outfit that shares their name. Breach formed in January of 1994 with Jes Steineger on guitar, Stacy Hilt on bass, and drummer James Redd. After a few abortive attempts at finding a musical direction with a different vocalist, screamer Sean Ingram -- late of the band Restrain -- was invited to join the fold.\n\n  As Coalesce, the quartet began to define its own sound, bridging together odd time signatures, an abrasive vocal style, and wandering guitar dissonance. They wrote five songs together and performed for free in basements, eventually releasing a self-titled 7&quot; single through Chapter Records that quickly blew through its initial 1,000-copy pressing. The buzz generated by the single and the band's increasingly volatile live performances drew the attention of metal powerhouse label Earache, which invited Coalesce to become the third band aboard their short-lived New Chapter imprint. The resulting record was a CD version of their three-song 002 demo. A year later, Coalesce released a split-CD EP with Britain's long-running Napalm Death. The two Earache releases were supported by a six-week tour with similarly minded Florida band Bloodlet and Krishna-core mavens 108.\n\n  Upon returning home, Coalesce broke up for the first time, with Redd going off to college in Baltimore shortly afterward. In 1996 the band re-formed, this time with manic drummer/multi-instrumentalist James DeWees aboard. The newly reinvigorated band signed a deal with Philadelphia's Edison label, which released Coalesce's debut full-length album, Give Them Rope. It was a bludgeoning affair wrought with Ingram's increasingly deep bellow and lyrical musings, personal polemics unlike many of the band's contemporaries. Split singles with Boy Sets Fire and the Get Up Kids followed, with Coalesce pairing up with each band to &quot;reinterpret&quot; one another's songs. Nathan Ellis replaced Hilt in the band around the time that Functioning on Impatience was released through band pal Dan Askew's Second Nature Recordings. The record saw the band streamlining their sound, sacrificing a bit of musical brutality in favor of a subtle accessibility, all the while remaining incredibly creative. The same label also released a record that presented newly recorded versions of the 002 songs alongside tracks from a long out of print single, titling it A Safe Place/002.\n\n  A trip to Red House Studios to record an album's worth of '70s rock songs resulted in seven Led Zeppelin covers instead, as Coalesce became so enthralled by the handful of Zeppelin songs they had originally elected to record that they decided to pay tribute solely to them. The songs were released as There Is Nothing New Under the Sun through Boston's Hydra Head label, the same company that issued the split with Boy Sets Fire. All of these releases, coupled with a handful of live appearances, culminated in several larger metal-oriented labels pursuing the band. After narrowing it down to two labels, Coalesce resolved to go with Relapse, deciding to break up once again before the recording of their new label debut had even begun.\n\n  Coalesce reassembled long enough to make 0:12 Revolution in Just Listening. It was arguably their best effort by that point -- accentuated by Ingram's now unmistakable lyrical prose, Steineger's now remarkably Jimmy Page-like approach to riff writing (albeit combined with his own bizarre time signatures), Ellis' fluid basslines, and DeWees' scattershot and powerhouse drumming. Hydra Head asked for one last song to include on the CD version of the Boy Sets Fire split, so Ingram, Ellis, and producer Ed Rose improvised over an old acoustic track, creating &quot;Bob Jr.&quot; A final show, dubbed Last Call for the Living, was discussed often yet never materialized. Members stayed busy -- DeWees with the Get Up Kids (for whom he had begun playing keyboards) and Reggie and the Full Effect; Ellis fronting a band called the Casket Lottery on guitar and vocals (together with the guy he replaced in Coalesce, Hilt). Ingram was involved with various projects -- including a live appearance screaming for a then singer-less Dillinger Escape Plan at Krazy Fest 4 in Louisville, KY, and a long-discussed project with members of Seattle's Training for Utopia called the American Spectator.\n\n  A collection of old Coalesce recordings surfaced as a vinyl-only release through Florida's No Idea, with the band re-forming once again in 2001. This time the lineup included Ingram, a returning Hilt on bass, DeWees, and a new guitarist named Cory White. Functioning on Impatience was the first album released under this lineup, arriving on Hydra Head Records during the following summer. In 2007, Coalesce released No Business in This Business, a four DVD collection of the bands legendary and explosive live performances spanning their entire career. In 2009, the band released Ox, their first full-length record in nearly a decade.","torrent":{"xt":"urn:btih:df41ca3591b5e9be01da2fcb61cd6f0459711dbd","amp;dn":"Coalesce+-+Discography+%281997-2009%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df41ca3591b5e9be01da2fcb61cd6f0459711dbd","infoHashBuffer":{"type":"Buffer","data":[223,65,202,53,145,181,233,190,1,218,47,203,97,205,111,4,89,113,29,189]},"announce":[],"urlList":[]}}