{"title":"Astrolinguistics - Design of a Linguistic System for Interstella","uid":9088540,"size":3539925,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df74b33f22a75404c53b59d63903e3db03af8395&amp;dn=Astrolinguistics+-+Design+of+a+Linguistic+System+for+Interstella&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheNobleWolf","files":1,"time":1382545255,"description":"ASTROLINGUISTICS : DESIGN OF A LINGUISTIC SYSTEM FOR INTERSTELLAR COMMUNICATION BASED ON LOGIC - Alexander Ollongren\n\n\nSpringer || ISBN : 978-1-4614-5467-0 || Pages : 266 || Format : PDF\n\n\nIn linguistics, one of the main areas of modern research involves the capabilities and possibilities of there being a &quot;lingua cosmica,&quot; a LINCOS, a universal language that could be used to communicate with non-human intelligences. This book touches on the area of the development and use of a &quot;lingua universalis&quot; for interstellar communication, but it also presents concepts that cover a broad area of linguistics. Chomsky's paradigm on universal properties of natural languages, for a long time a leading general theory of natural languages, includes the strong assumption that humans are born with some kind of universals stored in their brains. Are there universals of this kind of language used by intelligent beings and societies elsewhere in the universe? We do not know whether such languages exist. It seems to be impossible to determine, simply because the universe is too large for an exhaustive search. Even verification will be hard to obtain, without quite a bit of luck. This book uses astrolinguistic principles in message construction and is helpful in clarifying and giving perspective to discussions on existential questions such as these.\n\n\n** Brought to you by TheNobleWolf **","torrent":{"xt":"urn:btih:df74b33f22a75404c53b59d63903e3db03af8395","amp;dn":"Astrolinguistics+-+Design+of+a+Linguistic+System+for+Interstella","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df74b33f22a75404c53b59d63903e3db03af8395","infoHashBuffer":{"type":"Buffer","data":[223,116,179,63,34,167,84,4,197,59,89,214,57,3,227,219,3,175,131,149]},"announce":[],"urlList":[]}}