{"title":"Gwen Stefani - Hollaback Girl","uid":4279572,"size":130666500,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e05942d836bd8b8f342f9ba5507548da37b45112&amp;dn=Gwen+Stefani+-+Hollaback+Girl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":1,"time":1215352937,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n&quot;Hollaback Girl&quot; is a pop song written by singer Gwen Stefani and Pharrell Williams for Stefani&amp;#039;s debut solo album Love. Angel. Music. Baby (2004). As part of Stefani&amp;#039;s vision of creating &quot;a silly dance record,&quot; the song is influenced by 1980s dance and pop music. They wrote the song as a response to Courtney Love&amp;#039;s statement that Stefani was a &quot;cheerleader&quot; in an interview with Seventeen magazine.\n\nThe song was released as the album&amp;#039;s third single in early 2005 and was one of the year&amp;#039;s most popular songs, peaking inside the top ten on the majority of the charts it entered. It reached number one in Australia and the United States, where it became the first digital download to sell one million copies. &quot;Hollaback Girl&quot; received many award nominations, including Best Female Pop Vocal Performance and Record of the Year at the 48th Grammy Awards, yet it divided pop music critics.\n\nThe music video was directed by Paul Hunter and filmed in Van Nuys and Reseda, California, United States. The video opens with a scene of Stefani spending time with her Harajuku Girls, when a crowd of students appears. Stefani and the Harajuku Girls then drive down Sherman Way past Magnolia Science Academy to Birmingham High School in a 1961 Chevrolet Impala, accompanied by the crowd. Stefani and the group cause a commotion when they disrupt a game of American football by walking onto the field and when they go to a 99 Cents Only Store and throw cereal and other food products down an aisle. Throughout the video, there are intercut sequences of choreographed dancing filmed in a sound stage, intended to represent Stefani&amp;#039;s imagination.  Stefani and the Harajuku Girls are outfitted in cheerleading uniforms, accompanied by several Californian spirit groups: the Orange Crush All Stars, a cheerleading squad from Orange County; a marching band from Fountain Valley High School in Fountain Valley; a pep flag team named the Carson High School Flaggies from Carson; and a drill team from Stephen M. White Middle School in Carson. To visualize the song&amp;#039;s bridge, the Harajuku Girls spell the word &quot;bananas&quot; with cue cards. The video ends with a close-up frame of Stefani with her arms in the air.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:e05942d836bd8b8f342f9ba5507548da37b45112","amp;dn":"Gwen+Stefani+-+Hollaback+Girl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e05942d836bd8b8f342f9ba5507548da37b45112","infoHashBuffer":{"type":"Buffer","data":[224,89,66,216,54,189,139,143,52,47,155,165,80,117,72,218,55,180,81,18]},"announce":[],"urlList":[]}}