{"title":"Kriya - Breathing for balance.pdf","uid":4356892,"size":128831,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e0f1a84c0e0b7052d38e6f7ff27af70cc7b96841&amp;dn=Kriya+-+Breathing+for+balance.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"welovesrisri","files":1,"time":1219451712,"description":"Tuesday, July 4th, 2006\n\nBreathing for balance\n\nThe Art of Living teaches followers to find inner peace \nand then work for it in the world \n\nTuesday, July 4th, 2006\n\nThe Good Life - Carolin Vesely\n\nTHE world John Lennon asked us to imagine materialized on an\nairfield outside the south-India city of Bangalore last February\nwhen 2.5 million people from around the globe -- including a\ndozen or so Winnipeggers -- gathered to celebrate the 25th\nanniversary of the world's largest volunteer-run\nnon-governmental organization.\n\nFor three days there were no countries, no religions.\nThe Art of Living Foundation's silver jubilee -- dubbed the first\n&quot;spiritual Olympics&quot; -- saw kings, presidents and prime ministers\nmingle with corporate executives, backpackers and rural\nvillagers.\n\nIndians and Pakistanis, Chinese and Taiwanese, Bosnians and\nSerbians, and Iraqis and Americans sat together in the largest\ngroup meditation in history.\n\nAt the helm of this sea of humanity was a diminutive,\nlong-haired Hindu guru whose approach to building a better\nworld has attracted followers in 147 countries and earned him a\n2006 Nobel Peace Prize nomination. (Anti-poverty activist/rock\nstar Bono is also on the list.)\n\nAOLF founder Sri Sri Ravi Shankar (not to be confused with\nNorah Jones' sitar-playing father) will visit Winnipeg in\nSeptember to spread his simple message:\n\nThink globally, learn to breathe locally.\n\nTwo million people have already gotten that message by taking\nthe AOLF's yogic breathing and meditation courses, currently\nbeing taught in such diverse locales as New Delhi prisons,\nEuropean ashrams and downtown Winnipeg hotels. Around 200\nlocals have taken the course since it was introduced to the city\nin 2004.\n\nThe six-day, 23-hour workshops ($250, $125 for students)\ntouch on Shankar's philosophy of mindfulness, compassion and\ncommunity service, and include some basic yoga postures.\n\nBut the centrepiece is a powerful rhythmic breathing technique\ncalled the Sudarshan Kriya (Sanksrit for &quot;right vision, purifying\naction&quot;). The 90-minute process, developed by Shankar in 1982,\nis said to eliminate 80 per cent of toxins, release stored\nnegative emotions, and restore the natural cycles of the body\nand mind. (Students learn a 25-minute version to practise at\nhome.)\n\nShankar has likened it to &quot;diving deep into your own being.&quot;\nLouise Charette, a CBC Radio news reporter, says the kriya, as\nit's known in AOLF circles, has allowed her to turn off the &quot;alert&quot;\nswitch in her brain.\n\n&quot;My mind tends to go and go and go,&quot; says Charette, 46.\n&quot;Sooner or later, you'll pay for it. I know I was paying\nphysically.&quot;\n\nWhile she admits her job's hectic pace and unpredictability are\npart of its draw, stress was taking its toll when she turned to the\nAOLF last January.\n\n&quot;I tried yoga, but it ended up just being a workout. I tried\nBuddhist meditation, but I'd just sit there; I couldn't make it\nhappen.&quot;\n\nNow Charette simply sets her alarm clock early so she can\nbreathe before heading off to work.\n\nOn Saturdays she joins a group of fellow practitioners in the\npenthouse of the Place Louis Riel hotel to do the full kriya,\nwhich is always followed by a meditation. (The sessions are free\nto anyone who has completed the course.)\n\nCharette has only missed a day of her practice since January.\n&quot;It has enabled me to not spin,&quot; she says. &quot;I feel like I just can't\nafford to do that anymore.&quot;\n\nSo what does all this deep breathing have to do with world\npeace?\n\nWell, &quot;Guruji,&quot; as Shankar's devotees refer to him, teaches that\nthe basis of a stable, successful civilization is a strong individual\n-- &quot;disease-free body, quiver-free breath, stress-free mind,\ninhibition-free intellect, obsession-free memory, ego that\nincludes all, and soul which is free from sorrow.&quot;\n\nIn other words, all the qualities that can get wiped off the\nhuman radar in a muscle-clenching moment of stress.\n\nAnd since most people reportedly only use 30 per cent of their\nlung capacity, it can be difficult to attain the inner peace and\ngroundedness that Shankar says are key to achieving global\nharmony.\n\nTake it from a shallow breather who has taken the AOLF course\n-- twice: learning to breathe, sudarshan-kriya style, is not an\neasy, or comfortable, process. It is, after all, a kind of controlled\nhyperventilation.\n\nWhen the nasal breathing rhythm peaks (think runaway train),\nbody temperature may drop and limbs may grow numb, cramp\nup or vibrate.\n\nSome people cry, others laugh. Students are encouraged not to\nresist whatever emotions may arise.\n\nIt's all part of the &quot;deep cleansing&quot; necessary to open the mind\nand the heart, Swami Sukhchaitanya, one of Shankar's spiritual\nteachers and trainers, said during a recent visit from Toronto.\n\n&quot;You take a broom and you start sweeping, there will be dust all\nover.&quot;\n\nThe AOLF has medical research centres in Asia, Europe and the\nUnited States where studies are being done on the kriya's health\nbenefits for cancer, HIV, depression, post-traumatic stress\ndisorder and other mental ailments.\n\nIn 2000, a study at India's National Institute of Mental Health\nand Neurosciences concluded that daily practice was as effective\nas a standard antidepressant in treating patients hospitalized\nwith severe depression.\n\nRuchi Sud, a Toronto naturopath who moved here last winter to\nteach the AOLF course, says she responded with disinterest\nwhen her mom introduced her to the concept in 2001.\n\n&quot;I already knew how to breathe, and I wasn't that stressed,&quot;\nsays Sud, who attended the silver jubilee in Bangalore with her\nbrother Abhimanyu, a Toronto medical student who is also\nteaching the course here this summer.\nSo what changed for Sud?\n\n&quot;Only my perspective on life,&quot; she says, laughing.\n\n&quot;I just started seeing the world differently, wanting to make a\ndifference.&quot;\n\nSud says the breath is simply a tool with which people can\nconnect with their own power, a prerequisite for building\nstronger relationships, families, communities and, ultimately, a\nbetter world.\n\n&quot;There's nothing in this world that comes close to experiencing\nyour own being,&quot; she says. &quot;Then, as that feeling grows inside of\nyou, you can't help but want to share it with others.&quot;\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;ea898b9885868384c49c8f998f8693aa8c988f8f9a988f9999c48788c4898b&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n&quot;To be able to deal with our mind and negative emotions is an\nart: the Art of Living.&quot;\n-- Sri Sri Ravi Shankar, founder Art of Living Foundation\n\nFollowing your Art\n\n* Art of Living Foundation: India-based, volunteer-run NGO\noffering programs on stress-relief and personal and community\ndevelopment in 147 countries (www.artofliving.org).\n\n* Sri Sri Ravi Shankar: Hindu spiritual leader and two-time\nNobel Peace Prize nominee founded the AOL in 1982. Will visit\nWinnipeg on Sept. 6 as first stop on his 2006 One World Family\nCanadian Tour.\n\n* AOLF course: Intensive six-day yoga and meditation\nworkshops, taken by more than three million people, began in\nWinnipeg in 2004. Course fee is $250. For more information, call\n633-6084 or e-mail: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;d7b6a5a3b8b1bbbea1beb9b0a0beb9b9bea7b2b097aeb6bfb8b8f9b4b6f9&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n* Sudarshan kriya: Core of the Art of Living course; a rhythmic\nbreathing technique that infuses the body with oxygen and is\nsaid to release stress and energize and harmonize the body,\nmind and emotions.\n\n","torrent":{"xt":"urn:btih:e0f1a84c0e0b7052d38e6f7ff27af70cc7b96841","amp;dn":"Kriya+-+Breathing+for+balance.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0f1a84c0e0b7052d38e6f7ff27af70cc7b96841","infoHashBuffer":{"type":"Buffer","data":[224,241,168,76,14,11,112,82,211,142,111,127,242,122,247,12,199,185,104,65]},"announce":[],"urlList":[]}}