{"title":"Jennifer Lopez - If You Had My Love  (2nafish)","uid":5296148,"size":185673732,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e12f36a82e1927dfc155127eb42207fda4e8f574&amp;dn=Jennifer+Lopez+-+If+You+Had+My+Love++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1264068291,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;If You Had My Love&quot; is the lead single from Jennifer Lopez's debut album, On the 6 (1999). Released in 1999, the single peaked at number one in the United States, becoming Lopez's first number-one single; it also peaked at number four in the United Kingdom. The song is well-known for its voyeuristic music video.\n\nThe music video, directed by Paul Hunter, begins with a man (Adam Rodriguez) logging onto his personal computer. When prompted by a search bar, he enters the term &quot;Jennifer Lopez&quot; and is redirected to a website, &quot;Jennifer Lopez Online&quot;. Clicking on the link, he is then transported through the Internet (which is displayed by special effects emulating binary numbers). After arriving, a figure in white walks across a room filled with cameras recording action: it turns out to be Lopez in a hallway. From the privacy of his computer, the man then redirects to a new page where Lopez is now seen in the living room and crawling over a table.\n\nThe man is not alone in his voyeuristic actions as patrons of an Internet cafe and a little girl logging in from her own computer, watches Lopez, streaming live, on &quot;Internet TV&quot;. The man then clicks on a room showing Lopez in the bathroom, singing whilst checking her reflection in the mirror. Worldwide, Lopez's feed is being streamed live to a nightclub and to other users with laptops. The man then clicks on the dance option and is once again entered through the special effect binary. Lopez then proceeds to perform a series of dances (including jazz, house, and Latin soul) as the song moves into a remixed (Pablo Flores Remix) portion. The man then zooms in on Lopez's skirt, as she dances to Latin music.\n\nHe then raises the sexual intonation again by requesting a scene in which Lopez is taking a shower (although she is never seen nude). Garage workers who had been watching this soon turn their heads to Lopez and pay no attention to their burning car as they glue their eyes to the screen. A new user is introduced, and it is implied that he throws his computer underwater to &quot;turn down the heat&quot; (so to speak). He then continues to watch her there.\n\nThe video received four nominations at the 1999 MTV Video Music Awards: Best Female Video, Best Dance Video, Best Pop Video, and Best New Artist.\n\nThe song was written by Rodney Jerkins, Fred Jerkins III, LaShawn Daniels, and Cory Rooney and produced by Rodney Jerkins. In her debut single, Lopez is on the brink of sealing a relationship with a man she is interested in. However, before they can become a couple, she lays out some ground terms: she won't tolerate cheating and she needs to feel true love or it's &quot;got to end&quot;. She also wonders if he knew if his love was untrue, would he lie to her and still call her &quot;baby&quot;. Her insecurities build up to the point where Lopez questions, &quot;If you had my love, and I gave you all my trust, would you comfort me?&quot;.\n\n&quot;If You Had My Love&quot; debuted on the U.S. Billboard Hot 100 the week of May 15, 1999, jumping from number sixty-four to number eight two weeks later. The single reached the top spot on June 12, 1999, and stayed there for five consecutive weeks. The single was one of the most popular dance-pop singles of the summer of 1999, remaining on the top ten for fifteen weeks.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt; \n\n","torrent":{"xt":"urn:btih:e12f36a82e1927dfc155127eb42207fda4e8f574","amp;dn":"Jennifer+Lopez+-+If+You+Had+My+Love++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e12f36a82e1927dfc155127eb42207fda4e8f574","infoHashBuffer":{"type":"Buffer","data":[225,47,54,168,46,25,39,223,193,85,18,126,180,34,7,253,164,232,245,116]},"announce":[],"urlList":[]}}