{"title":"The.Letter.1940.DVDRip.XviD-rmrocha912","uid":4819990,"size":732385280,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e1d1a25276eb1c3adaa273f026aa7ac69dce1805&amp;dn=The.Letter.1940.DVDRip.XviD-rmrocha912&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rmrocha","files":1,"time":1238728557,"description":"The Letter is a 1940 American film noir directed by William Wyler. The screenplay by Howard Koch is based on the 1927 play of the same name by W. Somerset Maugham, originally filmed in 1929.\n\n\nPlot synopsis\n\nOn a moonlit night in the opening scene, Leslie Crosbie, the wife of a British rubber plantation manager in Malaya, shoots and kills a man whom her male servant recognizes as Jeff Hammond. She tells the servant to send for her husband Robert, who is working at one of the plantations. Her husband returns, having summoned his attorney and a British police inspector. Leslie tells them that Jeff Hammond &quot;tried to make love to me&quot; and she killed him to save her honor.\nLeslie is placed under arrest and put in prison in Singapore as a matter of form to await trial for murder. Everyone believes she acted heroically, with the exception of her attorney, Howard Joyce, who is clearly suspicious. Howard's suspicions seem justified when his clerk Ong Chi Seng shows him a copy of a letter Leslie wrote Hammond the day she killed him, informing him she would be home alone that evening and pleading with him to visit her. Ong Chi Seng tells Howard that the letter is in the possession of Hammond's widow, a Eurasian woman who lives in the Chinese quarter of town. Howard then confronts Leslie with the damning evidence and forces her to confess to Hammond's cold-blooded killing; but Leslie cleverly manipulates the attorney into agreeing to buy back the letter.\nHoward lends Leslie the money, and Hammond's widow requires that Leslie come personally to pay the $10,000 for the letter so that she can see the woman who killed her husband. With the letter excluded as evidence, Leslie is acquitted of her crime. It is only after she is freed and Robert announces that he plans to draw his savings out of his account in order to buy a rubber plantation in Sumatra that Howard and Leslie are forced to tell him that he owes the money to Howard. Robert is devastated to learn that Leslie had a lover and killed him out of jealousy but offers to forgive her if she can swear that she loves him. Leslie at first agrees and tells him she loves him, but she then breaks down and confesses &quot;with all my heart I still love the man I killed&quot;.\nLeslie wanders out into the moonlight in the garden of Howard's house and then outside the gate she meets and is killed by Mrs. Hammond, who she knew was there waiting for her with a knife.\n\n\n\nDirected by............William Wyler\n\nProduced by............Hal B. Wallis\n\nWritten by.............Howard Koch\n\nBased on the play by...W. Somerset Maugham\n\nStarring...............Bette Davis\n                       Herbert Marshall\n                       James Stephenson\n","torrent":{"xt":"urn:btih:e1d1a25276eb1c3adaa273f026aa7ac69dce1805","amp;dn":"The.Letter.1940.DVDRip.XviD-rmrocha912","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1d1a25276eb1c3adaa273f026aa7ac69dce1805","infoHashBuffer":{"type":"Buffer","data":[225,209,162,82,118,235,28,58,218,162,115,240,38,170,122,198,157,206,24,5]},"announce":[],"urlList":[]}}