{"title":"Gay - SaggerzSkaterz-Skater Beatdowns-Boys Spanking Boys Vol. 6","uid":4551190,"size":1172586496,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e25d77a5dae2e9529e8d5b9cada5fd1c035a6b98&amp;dn=Gay+-+SaggerzSkaterz-Skater+Beatdowns-Boys+Spanking+Boys+Vol.+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"hyaa","files":1,"time":1228317246,"description":"Preview:\n &lt;a href=&quot;\nhttp://www.imagebam.com/gallery/39f32db09b537753b448e9cba2f439cb&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagebam.com/gallery/39f32db09b537753b448e9cba2f439cb&lt;/a&gt;\n\nStarring: Jeremiah Johnson, Brent Lakewood, Philip Ashton, and Ian Madrox.\n\nIan finds out that some of his friends are interested in his little brother since they have found out he was gay. On two separate occasions Ian has to protect his little brother by beating two of his friends ass raw! \n\nIn the first scene Philip is interested in seeing what the Madrox family is packin. Philip knows that Ian's bro has done some nude modeling and wants to sneak a peek. Ian explains that it is uncomfortable for him to allow Philip to see his little bro. Once Philip tries to take the computer from Ian, that's the point breaking point. Philip has crossed the line and Ian decides its time for an ass beating. \n\nThe second scene, Ian has to defend his little bro's honor is when he found out that his brother has taken his viginity. When Ian confronts Brent about the situation, he immediatly denied the whole thing. Wth the help of Jeremiah, Ian settles on whipping his ass red until he admits what he did. Needless to say, Brent finally fesses up. With a quivering ass, he knows never to fuck with a Madrox. \n\nThe final scene has Jeremiah packing his things to get to the airport when Ian comes in to help him and say his goodbyes. Ian notices that Jeremiah has packed his Favorite Playboy Magazine - the one signed by Tiffany! Ian is pissed! Jeremiah tries to apologize, but sorry wont cut it this time. This bitch needs to get his ass beat to learn never to steal again! \n\nAs a bonus scene, check out Ian Madrox's Strip Twister. With three homos and one straight boy following Ian's improved rules for Twister you will just have to see who turns out to be the winner. \n","torrent":{"xt":"urn:btih:e25d77a5dae2e9529e8d5b9cada5fd1c035a6b98","amp;dn":"Gay+-+SaggerzSkaterz-Skater+Beatdowns-Boys+Spanking+Boys+Vol.+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e25d77a5dae2e9529e8d5b9cada5fd1c035a6b98","infoHashBuffer":{"type":"Buffer","data":[226,93,119,165,218,226,233,82,158,141,91,156,173,165,253,28,3,90,107,152]},"announce":[],"urlList":[]}}