{"title":"ROTAX 912 Engine Introduction - DVD","uid":4930069,"size":4468975723,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e2e79c1dfaaf670bdbc24613962681bc1b177149&amp;dn=ROTAX+912+Engine+Introduction+-+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"calvinkleist","files":-1,"time":1244006554,"description":"DVD provides tips and techniques for trouble-free operation of a ROTAX 912 engine on an LSA, as an introduction to its maintenance and upkeep.\n\nThis DVD by Paul Hamilton introduces the use and maintenance on Light-Sport Aircraft (LSA) of the ROTAX 912 engine. Many engine problems seen in the field are preventable with proper operation and maintenance and the 912 is no exception. This DVD is particularly useful to maintenance professionals, pilots and flight instructors operating ROTAX-powered Light Sport Aircraft. Answers frequently asked questions based on years of operational and maintenance experience and outlines typical procedures every owner, operator and mechanic should know. This DVD is the only one of its kind in the rapidly growing LSA market, and it caters to the do-it-yourself experience of flying this category of aircraft.\n\nIncludes:\n\n    * An overview of the basic 912 components\n    * Vital engine fluids\n    * Practical tips for selecting fuel\n    * How to check and change the oil\n    * Selecting the proper filters\n    * Appropriate operating temperatures\n    * Approved coolant options\n    * The unique electrical system in the ROTAX\n    * Cold weather operations\n    * Dual carburetor synchronization and idle\n    * And much more \n\nLSA expert Paul Hamilton produces this DVD that features presenters Phil Lockwood of Lockwood Aviation (www.lockwood-aviation.com, the largest ROTAX service center in the country), and Dean Vogel from Aero Technical Institute. Phil and Dean provide seminars regularly for owners, operators, and mechanics. They are the industry-recognized experts on this engine.\n\nApprox. 68 minutes with 17 additional minutes of extras that cover the carburetor, electric, crankshaft, and cylinder walls. Includes booklet with quick reference checklists.","torrent":{"xt":"urn:btih:e2e79c1dfaaf670bdbc24613962681bc1b177149","amp;dn":"ROTAX+912+Engine+Introduction+-+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2e79c1dfaaf670bdbc24613962681bc1b177149","infoHashBuffer":{"type":"Buffer","data":[226,231,156,29,250,175,103,11,219,194,70,19,150,38,129,188,27,23,113,73]},"announce":[],"urlList":[]}}