{"title":"Sim Tower [Addictive Little PC Game]","uid":4069915,"size":36573473,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e3f4632dc24311b479580700fd2b3225cb775f4e&amp;dn=Sim+Tower+%5BAddictive+Little+PC+Game%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eyezin","files":-1,"time":1204998437,"description":"Sim Tower\n \nAs the name suggests, the objective is to construct and manage a towering skyscraper and keep its occupants happy. Offices hotels, and condominiums give tenants places to live and work, while shops and restaurants provide commercial balance. Utilities such as hospitals and recycling centers become necessary as the tower grows in size. The player's progress is based on a stars system, similar to how hotels are ranked, with new stars awarded for meeting population milestones and other conditions. Population is measured by the number of individuals currently in the tower; many hotel rooms will cause population to soar during the night. As the tower's rating improves, more facilities can be built by the player, such as a cinema. Like other Maxis games, gameplay is not designed linearly, and SimTower does not have a specific end point; however, the primary goal is a population of 15,000, which rewards the player with 'Tower' status. Another goal is to build a cathedral at the top of the tower and have a marriage ceremony take place there. The game itself has 5 levels, which you complete by reaching a certain population level. New levels unlock new options to build such as security stations, but also create more hazards. How you handle these can change your tower drastically. For example, a fire can be dealt with using only security, which is free, but does not always work. On the other hand, a player can call the fire department and have the fire dealt with for a hefty sum.\nOne of the key activities of the game is effectively managing and building elevators in order to allow occupants to move between floors efficiently. Each elevator featured different modes, such as Express, Up, or Down, at different times, to account for the flow of traffic in and out of your building. In fact, the original game was a program to test effective elevator layouts (Bentley, 1994). Waiting for an elevator for too long would cause the residents stress (indicated by a black, pink or red colour as they become more stressed). Too much stress would cause them to permanently leave the tower. Another major issue with elevators was the fact that residential elevators could only go up a maximum of 30 stories, to minimize wait time. As such, lobbies can be placed every 15 floors for transfer. While these facilitate elevator transfers, they take up plenty of space in your building.\nFires, bomb threats/bombings and cockroach infestations in uncleaned hotel rooms were the main challenges besides the financial aspect. When a bomb threat occurs, the player can choose either to pay a hefty ransom or hope that the security officers can find the bomb before it goes off\nMin System Requirements:\n\nMin System Requirements:\nProcessor Speed: 80386 or faster processor\nOS: Windows 3.1 95 98 XP \nRAM: 4 MB\nCD Drive Speed: 2x CD-ROM drive\nScreen: VGA display\nMouse\n","torrent":{"xt":"urn:btih:e3f4632dc24311b479580700fd2b3225cb775f4e","amp;dn":"Sim+Tower+%5BAddictive+Little+PC+Game%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3f4632dc24311b479580700fd2b3225cb775f4e","infoHashBuffer":{"type":"Buffer","data":[227,244,99,45,194,67,17,180,121,88,7,0,253,43,50,37,203,119,95,78]},"announce":[],"urlList":[]}}