{"title":"Diamond Head - Canterbury [1983][EAC,log,cue. FLAC]","uid":8145427,"size":273050387,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e4b6d368cff59c07a6f895020d90b372fc0ead71&amp;dn=Diamond+Head+-+Canterbury+%5B1983%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":14,"time":1360906252,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\nArtist: Diamond Head\nRelease: Canterbury\nDiscogs: 4109088\nReleased: 1983 / 1992\nLabel: MCA Records\nCatalog#: 205 741-320 / MCD 30731\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: Germany\nStyle: Rock, Heavy Metal\n\nTracklisting:\n\n01. Makin' Music (3:51)\n02. Out Of Phase (3:32)\n03. The Kingmaker (4:12)\n04. One More Night (4:11)\n05. To The Devil His Due (6:01)\n06. Knight Of The Swords (6:50)\n07. Ishmael (4:00)\n08. I Need Your Love (3:02)\n09. Canterbury (4:56)\n\nDiamond Head's Lightning To The Nations is one of the best metal debuts of all time. It is stacked with NWOBHM gems, from the catchy &quot;It's Electric&quot; to the soaring opus &quot;Am I Evil?&quot; Like a majority of bands during that time, Diamond Head blew their creative load too soon. Unable to recreate the magic of their debut, Diamond Head would squander their opportunity with line-up changes and lackluster songwriting decisions. Their last album before the first break-up was 1983's Canterbury, a hard rock experiment that would alienate the band's core audience.\nIt seemed that every band that was involved in the NWOBHM scene was heading more towards commercialized rock to stay current. Many of those bands crashed and burned into obscurity due to their unfamiliarity in balancing out the pop and rock. Diamond Head was no different, with several bland single-friendly tunes on Canterbury. &quot;Makin' Music&quot; starts things off with an infectious sing-a-long that gets driven repeatedly into the ground. &quot;One More Night&quot; and &quot;I Need Your Love&quot; are simplistic rockers that fail to spark any momentum.\nThe impression one gets from this album is that it was meant to rejuvenate the band and get them to the top of the charts. The problem is that the fan base was expecting heavy songs, lengthy ventures that showed off the virtuosity of guitarist Brian Tatler and the pipes of Sean Harris. Canterbury only achieved the latter, as Harris puts in an inspired performance that shows passion lacking from the rest of the band. Tatler is restrained and held back from anything flashy, with the exception of the extended solo on the excellent &quot;Knight of the Swords.&quot;\nIn fact, this track is one of the few performed with any gusto. The medieval flavor of &quot;The Kingmaker&quot; blends with a rich tale and the title track is a piano ballad that turns into an anthem drenched in 80's cheese. &quot;To The Devil His Due&quot; precedes &quot;Knight of the Swords&quot; with acoustic splendor and sharp vocals. The rhythm work is adequate, considering the big line-up change, with original members Colin Kimberley and Duncan Scott leaving during the recording of the album.\nCanterbury was Diamond Head's answer to the success that Def Leppard and Saxon were having with their neutered rock albums. The album has some strong material, including the back-to-back epics planted in the middle of everything. The band deserves credit for trying to stay relevant, though it backfired in a huge way. For taking a big risk that was creative, but didn't pay off, Canterbury gets the nod for this week's Retro Recommendation.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:e4b6d368cff59c07a6f895020d90b372fc0ead71","amp;dn":"Diamond+Head+-+Canterbury+%5B1983%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4b6d368cff59c07a6f895020d90b372fc0ead71","infoHashBuffer":{"type":"Buffer","data":[228,182,211,104,207,245,156,7,166,248,149,2,13,144,179,114,252,14,173,113]},"announce":[],"urlList":[]}}