{"title":"Not Quite Hollywood (Australia 2008)","uid":4495129,"size":998060032,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e4b9257166e05abd04332de6747c0247a8e78d4e&amp;dn=Not+Quite+Hollywood+%28Australia+2008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"geminirumi","files":1,"time":1226162856,"description":"NOT QUITE HOLLYWOOD Synopsis\n\nThe much mythologized Australian film renaissance of the 1970s has been well documented. It was an era that produced such seminal films as Sunday Too Far Away, Picnic At Hanging Rock and My Brilliant Career.\n\nBut do we know the whole story?\n\nThis film looks at a period when a lifetime of savage-censorship suddenly ended. Australian cinema broke the shackles of a staid, highly conservative society and started producing films dedicated to entertaining a mass audience.\n\nAn abundance of free-wheelin sex romps, blood-soaked terror tales and high-octane action extravaganzas were released and found enthusiastic audiences around the World.\n\nIt was a time when Australias cinematic heroes were possessed with white-line fever, their heroines were well-stacked and sexually liberated, and the death-defying stuntwork was indeed truly death-defying!\n\nWelcome to NOT QUITE HOLLYWOOD&quot; - the wild, wonderful, untold story of OZPLOITATION cinema a time when Australian cinema got its gear off and showed the world a full-frontal explosion of sex, violence, horror and foot-to-the-floor, full bore action!\n\nThis is not your usual documentary full of boring anecdotes by dull historians, instead these are the real stories from the people who were there - wild, trail-blazing cinematic mavericks who snubbed their nose at authority, made their own rules and in the process introduced the car chase, karate kick, BMX bikes and water-bed to Oz cinema.\n\nJam packed full of outrageous anecdotes, lessons in guerrilla-style filmmaking, a smattering of International names (including Ozploitation devotee Quentin Tarantino) and a genuine, infectious love of Australian cinema, NOT QUITE HOLLYWOOD is a pacy, entertaining, journey through a forgotten cinematic era unashamedly packed full of boobs, pubes, tubes and a little kung fu.\n","torrent":{"xt":"urn:btih:e4b9257166e05abd04332de6747c0247a8e78d4e","amp;dn":"Not+Quite+Hollywood+%28Australia+2008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4b9257166e05abd04332de6747c0247a8e78d4e","infoHashBuffer":{"type":"Buffer","data":[228,185,37,113,102,224,90,189,4,51,45,230,116,124,2,71,168,231,141,78]},"announce":[],"urlList":[]}}