{"title":"Microsoft Office 2003 Professional SP3 (Updated Till 30.10.2013)","uid":11060507,"size":452473914,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e4cffd9e5445d4ac4c557299624c1acf650df466&amp;dn=Microsoft+Office+2003+Professional+SP3+%28Updated+Till+30.10.2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jizac2","files":-1,"time":1411164776,"description":"This is a custom build of Microsoft Office 2003 Professional. The tools used to generate this build are: Microsoft Office Configuration Analyzer Tool 1.1, Office Integrator 1.1.0.20, Microsoft Office 2003 Custom Installation Wizard, custom SETUP.INI tweaks.\n\nAs most of you know, Microsoft Office 2003 Professional is an x86 only release, but it will install on any newer version of Windows (tested on Windows 7 &amp; 8).\n\nWhat is omitted/added to the original installation:\n\n* Slipstreamed SP3 along with all other relevant hotfixes till 30.10.2013. Some hotfixes are superseded by newer ones, so there is no need to integrate them into the installation.\n\n* The Office File Validation Add-In is not installed. This add-in makes more problems than it resolves. There are numerous reports online by people having trouble opening large files from shared network drives. For example, Excel would just hang or crash when opening large xls files from a network drive. Besides, it's not even a hotfix, it's an add-in.\n\n* Slipstreamed Product ID. The installation doesn't require any serial and the Product ID prompt is skipped during the installation process.\n\n* By default, the installation installs all products and features (which is not the case with the original installation, for example, by default, the Microsoft Equation Editor 3.0 is not installed), except for the Handwriting and Speech tools in the Alternative User Input section. You can add them manually if you choose the Custom Installation method.\n\n* Silent install of the Microsoft Office 2007 File System Compatibility Pack (docx, pptx &amp; xlsx support).\n\n* SP3 registry fixes. If you manually install SP3 and try to save a docx, pptx or xlsx file in doc, ppt or xls format, Word, PowerPoint and Excel will nag and will not convert (save) the file. The same thing goes if you try and import older versions of CDR (vector graphics, CorelDRAW) files in your document. This installation adds registry tweaks that fix that problem.\n\n* The Macro Security Level and ActiveX Controls Security Level is automatically set to Low. You can manually change this if you like after the installation.\n\n* The MSO Cache is removed after the installation. This frees up HDD space, but the downside to this tweak is that you have to insert/mount the Microsoft Office 2003 CD if you wish to remove or repair the installation.\n\n* The &quot;Do you want to visit Microsoft homepage&quot; and &quot;Delete cache&quot; prompt at the end of the installation is removed. Instead, you get a nice clean prompt that says that Microsoft Office 2003 is installed, click OK, nothing more.\n\n* The &quot;Open New Office Document&quot; shortcut and the other one (can't remember the name of the other one :D), which by default are installed in the root of the Start menu (well, in XP anyway) are removed.","torrent":{"xt":"urn:btih:e4cffd9e5445d4ac4c557299624c1acf650df466","amp;dn":"Microsoft+Office+2003+Professional+SP3+%28Updated+Till+30.10.2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4cffd9e5445d4ac4c557299624c1acf650df466","infoHashBuffer":{"type":"Buffer","data":[228,207,253,158,84,69,212,172,76,85,114,153,98,76,26,207,101,13,244,102]},"announce":[],"urlList":[]}}