{"title":"King and Maxwell by David Baldacci (ePub Retail)","uid":9214743,"size":595696,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e551aca1edcd9e300b4643365aea841b13d9175f&amp;dn=King+and+Maxwell+by+David+Baldacci+%28ePub+Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TxJag","files":3,"time":1384844404,"description":"David Baldacci brings back Sean King and Michelle Maxwell--former Secret Service agents turned private investigators--in their most surprising, personal, and dangerous case ever . . .\n\nKING AND MAXWELL\n\nIt seems at first like a simple, tragic story. Tyler Wingo, a teenage boy, learns the awful news that his father, a soldier, was killed in action in Afghanistan. Then the extraordinary happens: Tyler receives a communication from his father . . . after his supposed death.\n\nTyler hires Sean and Michelle to solve the mystery surrounding his father. But their investigation quickly leads to deeper, more troubling questions. Could Tyler's father really still be alive? What was his true mission? Could Tyler be the next target?\n\nSean and Michelle soon realize that they've stumbled on to something bigger and more treacherous than anyone could have imagined. And as their hunt for the truth leads them relentlessly to the highest levels of power and to uncovering the most clandestine of secrets, Sean and Michelle are determined to help and protect Tyler--though they may pay for it with their lives.\n\nFull Retail. ePub and Calibre Reader ready. Metadata is complete and up to date.","torrent":{"xt":"urn:btih:e551aca1edcd9e300b4643365aea841b13d9175f","amp;dn":"King+and+Maxwell+by+David+Baldacci+%28ePub+Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e551aca1edcd9e300b4643365aea841b13d9175f","infoHashBuffer":{"type":"Buffer","data":[229,81,172,161,237,205,158,48,11,70,67,54,90,234,132,27,19,217,23,95]},"announce":[],"urlList":[]}}