{"title":"June Tabor...Rosa Mundi(2001)[FLAC]","uid":6024983,"size":229264452,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e6110f99412a507da7ca09763457f99bca0fb9a7&amp;dn=June+Tabor...Rosa+Mundi%282001%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":20,"time":1291901380,"description":"2001 Rosa Mundi    CD  Topic TSCD532 \n\n1 Roses of Picardy   4:08 \n2 Belle Rose   2:47 \n3 Deep in Love   4:58 \n4 O My Luve's Like a Red Red Rose   3:18 \n5 Rose in June   4:42 \n6 Paint Me, RedoutÃƒÂ©   5:26 \n7 Rhosyn Wyn / Winterrose   4:24 \n8 The Rose Is White, the Rose Is Red / Dargason   2:26 \n9 The Crown of Roses (Tchaikowsky's Legend)   3:59 \n10 Barbry Ellen   5:37 \n11 Maybe Then I'll Be a Rose   4:21 \n\nA new Tabor album was always an event and this one--a thematic collection involving 11 songs based around the rose--offers intriguing possibilities. The rose as a symbol of love, of beauty, of devotion, of religion, of blossom, of faded glory. Songs from the 15th Century to the modern day, sparsely presented, built largely around the piano and violin arrangements of Huw Warren and Mark Emerson. Tabor herself performs with by now familiar gravitas. Nowt wrong with that. Devotees are familiar with the incessant demands for patience and commitment she makes of her audience and they in turn have generally been rewarded with an emotional experience all the more intense for its absence of artifice or extraneous diversion. Pure, intimate and stripped here to its core, her voice remains a remarkably potent weapon and she obviously feels deeply the various reflections of the heart in the likes of &quot;Rose In June&quot;, &quot;Crown Of Roses&quot; and &quot;Maybe Then I'll Be A Rose&quot;. Yet listening to it over and over, the expected sledgehammer into the soul doesn't materialise and you begin to notice the shortcomings. The unremitting melancholia, the lack of variety, the one-paced mood, the lack of light and shade, the sheer solemnity of it all. The arrangements start sounding predictable and you even begin to question her selection of material and whether the songs actually merit the reverential investment of faith and passion they clearly inspire in her. In recent times as she has drifted into new territory as a chansonier; she has become increasingly broad and even eccentric with her song selection, which has ranged from jazz standards to hoary old favourites like &quot;First Time Ever I Saw Your Face&quot; and &quot;Somewhere Over The Rainbow&quot;. Usually she has found a new angle or a hidden meaning and revitalised them, particularly in those remarkable collaborations with the Creative Jazz Orchestra. This time I'm not so sure. Maybe I'm soured by the opening track &quot;Roses Of Picardy&quot;, a love song associated with wartime, but which leaves me with images of Vince Hill and cheesy schmaltz which even June's reverential performance doesn't entirely bury. And there's Rabbie Burns's &quot;My Love Is Like A Red Red Rose&quot;, delivered with icy grandeur like a family heirloom and images of parlour rooms and professional Scotsmen swim across the horizon. The heaviest material of all comes from the pen of Les Barker, underlined by the brooding accompaniments of Huw Warren, Mark Emerson and Richard Bolton. At such times you'd give a lot to hear June getting her teeth into a song of less oblique emotional depth, like Tommy Sands's more contemporary song about another war entirely, &quot;There Were Roses&quot;. As it is, the most telling track is perhaps the compelling version of &quot;Barbry Ellen&quot;, given a formidably forboding yet simple arrangement to remind us exactly how devastating she can be delivering even a ballad that has been round the houses as many times as this one. It makes you pine for a return to an all-traditional album. --Colin Irwin \n\ncd ripped by dBpoweramp\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2010/10/30/june-tabor/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2010/10/30/june-tabor/&lt;/a&gt;","torrent":{"xt":"urn:btih:e6110f99412a507da7ca09763457f99bca0fb9a7","amp;dn":"June+Tabor...Rosa+Mundi%282001%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6110f99412a507da7ca09763457f99bca0fb9a7","infoHashBuffer":{"type":"Buffer","data":[230,17,15,153,65,42,80,125,167,202,9,118,52,87,249,155,202,15,185,167]},"announce":[],"urlList":[]}}