{"title":"Alluda Majaka (1995) - DVD - Rip - X264 - AAC - 1CD - Team RZ.mp","uid":6458137,"size":736249134,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e67b1afdc13ec788b6908806945d04b6e1a76a8d&amp;dn=Alluda+Majaka+%281995%29+-+DVD+-+Rip+-+X264+-+AAC+-+1CD+-+Team+RZ.mp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"zukke","files":1,"time":1307656166,"description":"&quot;Alluda Mazaka also known as Alluda Majaka and Alluda Mazaaka...! It would seem nobody knows exactly how to translate the title. It's an Indian gem from the mid 90s starring Chiranjeevi as Sitaramudu/Mr. Toyta. The movie is 161 minutes long! That's as long as Avatar. This is not a bad thing because the whole movie is awesome. It's like Michigan's Adventure it's twice the fun!\n\nI've seen MANY movies in my day but never have I seen a movie that is so much fun to watch. There are literally too many good scenes to mention. I like the whole thing. Part of the reason why there are too many scenes to mention is the fact that this movie is LONG. And by long I mean longer than the run time of any of the original Star Wars movies. Normally a movie this long becomes oppressively boring after 10 minutes. That is not case with Alluda Mazaka. It starts you off with plenty of action and a few musical numbers. Then there is the infamous tractor fight scene which is too glorious for words. It is available on YouTube but I strongly recommend that you wait and watch the whole movie instead. In total there is something like 7-8 full scale musical numbers. All of which have hilarious choreography and unique locations. I'll summarize what this movie is like in one sentence. Picture the funniest action movie, the most overdone musical, and the silliest drama you've ever seen. Now combine the three into one film. That is Alluda Mazaka!&quot;\n\n\nCult indian movie with indian language, enjoy!\n/Zukke","torrent":{"xt":"urn:btih:e67b1afdc13ec788b6908806945d04b6e1a76a8d","amp;dn":"Alluda+Majaka+%281995%29+-+DVD+-+Rip+-+X264+-+AAC+-+1CD+-+Team+RZ.mp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e67b1afdc13ec788b6908806945d04b6e1a76a8d","infoHashBuffer":{"type":"Buffer","data":[230,123,26,253,193,62,199,136,182,144,136,6,148,93,4,182,225,167,106,141]},"announce":[],"urlList":[]}}