{"title":"John Mayall Plays John Mayall [ mp3@320 ] - CAPTAiN_24","uid":8130324,"size":100178224,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e709e099345d71b5ebc8bf86093d3f89eee94e02&amp;dn=John+Mayall+Plays+John+Mayall+%5B+mp3%40320+%5D+-+CAPTAiN_24&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CAPTAiN_24","files":-1,"time":1360542298,"description":"=====================================================================================\n\n*** John Mayall ( 1965 ) - John Mayall Plays John Mayall [ mp3@320 ] - CAPTAiN_24 ***\n\n\n### Recorded live at Klooks Kleek, Hampstead, London on Monday 7th December 1964 ###\n\n\n                           ### 1988 CD VERSiON ###\n\n                          === Includes  ArtWork ===\n\n=====================================================================================\nENJOY.\n\nJohn Mayall's debut album, recorded live in December 1964, is a little unjustly overlooked, as it was recorded shortly before the first of the famous guitarists schooled in the Bluesbreakers (Eric Clapton) joined the band. With Roger Dean on guitar (and the rhythm section who'd play on the Bluesbreakers with Eric Clapton album, bassist John McVie and drummer Hughie Flint), it has more of a rock/R&amp;B feel, rather like the early Rolling Stones, than the purer bluesier material Mayall would usually stick to in his subsequent recordings. The record doesn't suffer for this, however, moving along quite powerfully, and -- unusually for a British R&amp;B/blues band of the time -- featuring almost nothing but original material, all penned by Mayall. Nigel Stanger's saxophone adds interesting touches to a few tracks, the songs are quite good, and while Dean's guitar and Mayall's vocals aren't on the same level as the best instrumentalists and singers in the British blues-rock movement, they're satisfactory. [The 2006 U.K. expanded CD edition added five enjoyable cuts that round up everything else recorded by the pre-Eric Clapton version of the Bluesbreakers, including the 1964 single &quot;Crawling Up a Hill&quot;/&quot;Mr. James&quot;; the early 1965 single &quot;Crocodile Walk&quot;/&quot;Blues City Shakedown&quot;; and the February 1965 outtake &quot;My Baby Is Sweeter,&quot; which first showed up on the early-'70s British compilation Thru the Years. &quot;Crawling Up a Hill&quot; and &quot;Crocodile Walk&quot; also appear on the original John Mayall Plays John Mayall album in live performances, but the bonus track versions are entirely different studio recordings done for those non-LP singles, and are pretty good as well.]","torrent":{"xt":"urn:btih:e709e099345d71b5ebc8bf86093d3f89eee94e02","amp;dn":"John+Mayall+Plays+John+Mayall+%5B+mp3%40320+%5D+-+CAPTAiN_24","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e709e099345d71b5ebc8bf86093d3f89eee94e02","infoHashBuffer":{"type":"Buffer","data":[231,9,224,153,52,93,113,181,235,200,191,134,9,61,63,137,238,233,78,2]},"announce":[],"urlList":[]}}