{"title":"The Great Stone of Sardis by Frank R. Stockton","uid":8299802,"size":829061,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e74fbfe2d2883824c220bf38427adfaffb4be375&amp;dn=The+Great+Stone+of+Sardis+by+Frank+R.+Stockton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"imarion","files":-1,"time":1364241504,"description":"A double adventure written at the end of the 19th century, somewhat in the theme of Jules Verne's Twenty Thousand Leagues Under the Sea and Journey to the Center of the Earth, telling of a submarine trip in the year 1947 to reach the North Pole and a project to examine the center of the Earth by boring a deep shaft. What they find at the core of the planet surprises the enterprising explorers.\n\nSince the book was set about 50 years into the future from when it was written, it includes some speculations on the advancement of science and technology, as the author explains in his introduction.\n\nA literary reviewer has said about this novel: &quot;The conception was bizarre and grotesque enough, but the author developed it into a fascinating tale, incidentally injecting into it a good deal of drollery and fun. The tale shows that aspect of Stockton's genius that is inclined to the whimsical and chimerical, as well as the mechanical turn of his invention.&quot;\n\n(&quot;The Fiction of Frank R. Stockton&quot; by Edwin W. Bowen in The Sewanee Review, Vol. 28, No. 3, July 1920, pp. 452-462) ","torrent":{"xt":"urn:btih:e74fbfe2d2883824c220bf38427adfaffb4be375","amp;dn":"The+Great+Stone+of+Sardis+by+Frank+R.+Stockton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e74fbfe2d2883824c220bf38427adfaffb4be375","infoHashBuffer":{"type":"Buffer","data":[231,79,191,226,210,136,56,36,194,32,191,56,66,122,223,175,251,75,227,117]},"announce":[],"urlList":[]}}