{"title":"WinX DVD Ripper Platinum 6.9.3","uid":7742747,"size":19520930,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e7687d42013bc98a6fdb3b07b8447e3532093f53&amp;dn=WinX+DVD+Ripper+Platinum+6.9.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wallpwallpapers","files":-1,"time":1350670933,"description":"WinX DVD Ripper Platinum can rip the content of DVDs to all popular video formats such as AVI, MOV, FLV, WMV, MPEG, MP4, 3GP, etc. What's more, it also owns the ability of ripping different DVDs (including encrypted DVDs) to Sony PSP, Apple iPhone, iPod, iPad, iTouch, Apple TV, Zune, Mobile phone, etc.\n\nThis DVD ripper software supports multi-core CPU and is fully compatible with Windows 7. We promise WinX DVD Ripper Platinum is the fastest DVD ripping solution in the market. Besides converting DVD to regular video formats, 1:1 DVD copy enables you to backup your DVD with original video, audio and subtitles within only 5 minutes (the processing time also depends on your CPU and DVD driver speed).\n\nWinX DVD Ripper Platinum fully supports normal DVDs, CSS protected DVDs, Sony ArccOS DVDs and all region 1-6 DVDs. Moreover, we are so proud to tell you that WinX DVD Ripper Platinum is the unique DVD ripping program which supports decrypting DVDs with the latest copy protection technology such as Transformers 2, Star Trek 2009, The Dark Knight, UP, WALL-E, The Proposal, District 9 etc.\n\nPowerful Functions\nSupport ripping DVD video, extracting audio, grabbing screenshot and enable users to fully control output video quality or size by freely adjusting parameters.\n\nAdvanced Technology\nBuild in powerful and high speed encoding engine, support multi-core CPU, automatically detect and connect converted videos to portable devices and fully compatible with Windows 7.\n\nEasy and Fast\nWinX DVD Ripper Platinum is a one-click solution for DVD ripping. It is suitable for all levels of experienced users or even novices. And we promise it owns the fastest ripping speed.\n\nInstall:\n\n- run application\n- insert serial","torrent":{"xt":"urn:btih:e7687d42013bc98a6fdb3b07b8447e3532093f53","amp;dn":"WinX+DVD+Ripper+Platinum+6.9.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7687d42013bc98a6fdb3b07b8447e3532093f53","infoHashBuffer":{"type":"Buffer","data":[231,104,125,66,1,59,201,138,111,219,59,7,184,68,126,53,50,9,63,83]},"announce":[],"urlList":[]}}