{"title":"Railworks TS2014 RailTraction TaD - LV Freightpack","uid":9952539,"size":18178223,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e817646bfea05c96661e439320cbd9f0f070769c&amp;dn=Railworks+TS2014+RailTraction+TaD+-+LV+Freightpack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tygn547","files":-1,"time":1397421079,"description":"The Lehigh Valley Railroad (reporting mark LV) was one of a number of railroads built in the northeastern United States primarily to haul anthracite coal. It was authorized April 21, 1846 in the U.S. state of Pennsylvania and incorporated September 20, 1847 as the Delaware, Lehigh, Schuylkill and Susquehanna Railroad Company. On January 7, 1853, the name was changed to Lehigh Valley Railroad.It was sometimes known as the Route of the Black Diamond, named after the anthracite it transported.\nThis package of freight cars brings accurate modelled versions of typical 1950s and 1960s freightcars into your simulator. These wagons are included:\n \n40&quot; Boxcars in three different paintschemes\nFlatcar in different versions and with different loadings\nLowboard Car in different versions\nHopper in different versions with coal load (interactive loading at loading points included)\nClosed/covered hoppers\n \nAll models where built with most possible accuracy, they offer enhanced physics with more realistic braketiming and brake efficiency.All waggons have dynamic numbering. This pack is a great addition to the vR ALCO RS-11.\n \n System Requirements: \n\nTrainsimulator 2013\n \nYou can use the cars in any custom build scenarios. Please check Trainsimulator 2013Â´s manual for details on scenario creation.\nThis product is in combination with the vR_ALCO Rs-11 fully QuickDrive compatible! You may choose one out of nine different train consists to drive!\nTo play the three included scenarios, you must have the Portland Terminal Route (available from STEAM) installed. Owners of the ALCO RS-11 can play these scenarios using the ALCO Rs-11, otherwise the default GP40 (incl. in the Portland Terminal Addon) is used.\n \n \nScenario 1: Cement Load\n\nYou will be swapping out rolling stock at Bernard Distribution as well as filling some hoppers with cement at Dragon Cement.\n \nScenario 2: Beans for Chowdah?\n\nYou will be taking some beans from B&amp;M Baked Beans to Snows Chowder but first you will need to drop some coal hoppers onto the Old GT Yard. Scenario\n \n3: Outbound Gravel\n\nYou will be taking a small freight as far as PTC Passing where the next crew will take over for further movement. Each scenario can be driven with the default GP40 or the ALCO-RS 11.\n\nEnjoy and seedd pls!!!!","torrent":{"xt":"urn:btih:e817646bfea05c96661e439320cbd9f0f070769c","amp;dn":"Railworks+TS2014+RailTraction+TaD+-+LV+Freightpack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e817646bfea05c96661e439320cbd9f0f070769c","infoHashBuffer":{"type":"Buffer","data":[232,23,100,107,254,160,92,150,102,30,67,147,32,203,217,240,240,112,118,156]},"announce":[],"urlList":[]}}