{"title":"Small-Space Container Gardens (gnv64)","uid":8242457,"size":38194985,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e8e4096eab417267912f00ad1aa77c4a2e81f7ee&amp;dn=Small-Space+Container+Gardens+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1362989996,"description":"Small-Space Container Gardens: Transform Your Balcony, Porch, or Patio with Fruits, Flowers, Foliage, and Herbs... \nby Fern Richardson\nTimber Press | March 2012  | ISBN-10: 1604692413 | ePUB/PDF | 25.3/11 mb &lt;a href=&quot;\nhttp://www.amazon.com/Small-Space-Container-Gardens-Transform-Balcony/dp/1604692413&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Small-Space-Container-Gardens-Transform-Balcony/dp/1604692413&lt;/a&gt;\n\nA concrete slab populated solely with plastic chairs and an abandoned grill? Not anymore. Chances are your balcony, porch, or patio could use a major makeover. Fern Richardson, charismatic creator of the Life on the Balcony blog, is here to walk you through the process of beautifying a small space--even when you have a similarly small budget.\nThis exciting guide layers practical gardening fundamentals with creative solutions that encourage thinking outside the pot. Maybe this means repurposing a shipping pallet to create a colorful vertical garden of nasturtiums and lobelia. Or simply seeing walls, rafters, railings, and everything in-between as fair game. It's in these containers--traditional or not--that you'll cultivate your own food, attract beneficial insects, grow flowering vine privacy screens, and so much more. You'll also learn how to tackle unique challenges, like windy conditions when gardening several stories above street level, and how to care for plants and troubleshoot with the best of them.\nFrom design basics to essential plant picks, Small-Space Container Gardens proves you don't need a yard to have a garden. For anyone who wants more green in their life, it's time to get out there and start growing.\n\nAbout the Author &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/01/a6/97d4601d909d0ad8976f53.L._V153704461_SX200_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/01/a6/97d4601d909d0ad8976f53.L._V153704461_SX200_.jpg&lt;/a&gt;\nFern Richardson is the creator of the container gardening blog Life on the Balcony. She is also a master gardener, amateur photographer, and container garden designer.Fern Richardson was born in Long Beach, CA and has been gardening in small spaces all around Southern California since childhood. In 2008 she created the popular container gardening blog, Life on the Balcony. Through her blog--and now in her book, Small-Space Container Gardens--Fern shares her experience designing and tending to gardens on balconies, patios, porches, and rooftops. Fern is an equal opportunity gardener; no flower, succulent, vegetable, herb, or fruit tree has escaped her enthusiasm for bringing life to small, urban spaces.\n\nContents\nForeword by Debra Lee Baldwin\nPreface\n1 Small and Sassy Choosing Colors, Containers, Furniture, and Lighting\n2 The Elements Working with Weather and Climate\n3 The Birds and the Bees Attracting Wildlife to Your Garden\n4 Potager with a Twist Growing Gorgeous Food\n5 Succulents and Scents Path Loving a Long and Narrow Space\n6 The Secret Garden Planning and Planting for Privacy\n7 Verdant and Vertical Creating an Upward, Tropical Oasis\n8 Green Thumb Crash Course Learning the Essentials for Success\n9 The Uninvited Guests Troubleshooting Pests and Diseases\nConversion Tables and Plant Hardiness Zones\nResources and References\nAcknowledgments\nPhotography Credits\nIndex","torrent":{"xt":"urn:btih:e8e4096eab417267912f00ad1aa77c4a2e81f7ee","amp;dn":"Small-Space+Container+Gardens+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8e4096eab417267912f00ad1aa77c4a2e81f7ee","infoHashBuffer":{"type":"Buffer","data":[232,228,9,110,171,65,114,103,145,47,0,173,26,167,124,74,46,129,247,238]},"announce":[],"urlList":[]}}