{"title":"Lee ScratchbPerry &amp; The Upssetters Super Ape","uid":6427932,"size":235824725,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e8fdd2e8978e1186a2c5f7942594849be4164397&amp;dn=Lee+ScratchbPerry+%26+The+Upssetters+Super+Ape&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ocnrf","files":16,"time":1306548573,"description":"By 1976, Lee &quot;Scratch&quot; Perry was well established at his Black Ark studio, a fact proven by the quality of the creations emerging from its walls. The success of Max Romeo's &quot;War in a Babylon&quot; brought a deal with Island Records and the possibility of greater financial rewards. The single was followed by a full-length album of the same name as well as deejay Jah Lion's Columbia Colly LP. Riding this crest of productivity, Scratch then turned to a creation of his own. Super Ape offered a series of the producer's finest 1976 rhythms, from Devon Irons' &quot;When Jah Come&quot; and the Blue Bells' &quot;Come Along&quot; to Romeo's &quot;War in a Babylon&quot; and &quot;Chase the Devil.&quot; All are bathed in the distinct, murky atmosphere that was becoming a Black Ark trademark, then served up in the form of dub-like de-constructions. Island's U.K./U.S. sequencing of Super Ape places &quot;Dread Lion&quot; at the album's heart. If any track fulfills the cover's promise to &quot;Dub it up, blacker than dread&quot;, this is it. Vocals from numerous cuts seem to compete for their spot on the rhythm, while a dizzying mix of horns, flute and melodica swirl around them. Punctuating the song's rock-solid underbelly, Perry conjures startling thunderclaps from his mixing board. Other Super Ape heavyweights include &quot;Croaking Lizard&quot; and &quot;Zion's Blood&quot;: thick muscular constructs from the Upsetter session team. The former features an excellent Prince Jazzbo toast over the &quot;Chase the Devil&quot; rhythm, while the latter, a cut of &quot;When Jah Come,&quot; draws its elusive meaning from vocal phrases courtesy of Heptones Earl Morgan and Barry Llewellyn. Super Ape is a dubwise, alternate universe to Perry's Black Ark vocal hits. It awaits anyone willing to heed it's closing call: &quot;This is the ape-man, trodding through creation, are you ready to step with I man?&quot;. \n\n*****\n\nAMG\n\n","torrent":{"xt":"urn:btih:e8fdd2e8978e1186a2c5f7942594849be4164397","amp;dn":"Lee+ScratchbPerry+%26+The+Upssetters+Super+Ape","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8fdd2e8978e1186a2c5f7942594849be4164397","infoHashBuffer":{"type":"Buffer","data":[232,253,210,232,151,142,17,134,162,197,247,148,37,148,132,155,228,22,67,151]},"announce":[],"urlList":[]}}