{"title":"Encyclopedia of Invasions and Conquests - From Ancient Times to ","uid":12042267,"size":32487696,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e99eb19b25f327fe23c1b854f7ebd3f7faad98a4&amp;dn=Encyclopedia+of+Invasions+and+Conquests+-+From+Ancient+Times+to+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1434807725,"description":"Pages: 602 \nPublisher: Grey House Publishing; 2 edition (April 1, 2006)\nLanguage: English\nISBN-10: 1592371140\nISBN-13: 978-1592371143\n\nAn authoritative and thoroughly readable volume that will prove invaluable for everyone from military historians to history buffs to those wanting to know the impact of war on the borders and cultures of countries around the world. The Encyclopedia of Invasions and Conquests, a comprehensive guide to 192 invasions, conquests, battles, occupations, and military leaders from ancient times to the present, takes readers on a journey that includes the Roman conquest of Britain, the Portuguese colonization of Brazil, and the Iraqi invasion of Kuwait. This engaging, lucid, carefully researched volume provides a thorough review of each battle while examining the repercussions on infrastructure, tradition, language, and more. Some entries cover civilizations and cultures (Han Dynasty, the Huns, the Uzbeks), while others are devoted to selected historical figures (Julius Caesar, Napoleon Buonaparte, Douglas MacArthur). Each chapter provides a map to help readers locate key areas and geographical features. Other features include cross-references, a cumulative bibliography, and a comprehensive subject index.\n\nAbout the Author\n\nPaul K. Davis received a Ph.D. in war studies from King's College, University of London. He currently teaches history at the University of Texas at San Antonio and St. Mary's University","torrent":{"xt":"urn:btih:e99eb19b25f327fe23c1b854f7ebd3f7faad98a4","amp;dn":"Encyclopedia+of+Invasions+and+Conquests+-+From+Ancient+Times+to+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e99eb19b25f327fe23c1b854f7ebd3f7faad98a4","infoHashBuffer":{"type":"Buffer","data":[233,158,177,155,37,243,39,254,35,193,184,84,247,235,211,247,250,173,152,164]},"announce":[],"urlList":[]}}