{"title":"The King James Bible and the Modern Versions - Vance Ferrell","uid":11773468,"size":4533787,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e9d53d9620d39d423ad7957026159f5ffd437b44&amp;dn=+The+King+James+Bible+and+the+Modern+Versions+-+Vance+Ferrell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427168937,"description":"\n\nThe King James Bible and the Modern Versions - One of the biggest religious frauds which occurred in church history. The most complete explanation of how it was done. The largest in-depth defense of the King James Bible.\n\nIn this book, you are going to witness centuries of conflict as humble souls, with the help of God, preserved the Inspired Word while men who were moved by a power from beneath sought to burn it, hide it, or corrupt it.\n\nGet all the facts about the newer modern translations of the Bible that have come out within the last century and see how it compares to the old King James Version.\n\n\nAbout the author:\nVance Ferrell was raised in San Francisco, Calif. He has been a very studious man who had 22 yrs of formal education. He received a BA in 1955 from Pacific Union College (Angwin, Calif.). 1965 he received a MA from the Potomac University in (Washington DC). In 1958 he received a BD from Andrews University (Berrien Springs, Mich.). Throughout the years Vance Ferrell has been in love with his Creator and compelled to defend a loving Heavenly Father. Vance Ferrell has spent much time doing extensive research in the fields of botany, biology, geology and other sciences","torrent":{"xt":"urn:btih:e9d53d9620d39d423ad7957026159f5ffd437b44","amp;dn":"+The+King+James+Bible+and+the+Modern+Versions+-+Vance+Ferrell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9d53d9620d39d423ad7957026159f5ffd437b44","infoHashBuffer":{"type":"Buffer","data":[233,213,61,150,32,211,157,66,58,215,149,112,38,21,159,95,253,67,123,68]},"announce":[],"urlList":[]}}