{"title":"Keith Urban - Til Summer Comes Around  (2nafish)","uid":5296406,"size":196280324,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ea631ce3b485ada9e900d43d5c25ac7687d5b41d&amp;dn=Keith+Urban+-+Til+Summer+Comes+Around++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1264033753,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logo.\n\n\n&quot;'Til Summer Comes Around&quot; is the title of a song recorded by Australian country music singer Keith Urban, co-written by him and Monty Powell. It is the fourth single release from his 2009 studio album Defying Gravity. The song debuted at #41 on the Billboard Hot Country Songs charts in November 2009.\n\nThe narrator compares a quiet boardwalk in the wintertime to his &quot;empty broken heart,&quot; remembering the times that they had at the carnival rides there while the boardwalk was open in the summertime. It is accompanied mostly by electric guitar and organ. Urban's original idea was to write a song about longing telling the story of a guy who meets a girl at an amusement park. He falls in love with her and longs to see the girl again. She says she will be back, and every year he is still there waiting. \n\nThom Jurek of Allmusic referred to the song as &quot;haunting, nocturnal, and dreamily textured&quot; in his review of the album. Bobby Peacock of Roughstock said that it was &quot;more substantial&quot; than the album's other three singles and &quot;a standout even among his many great ballads.&quot; Chris Neal, reviewing the single for Country Weekly, gave it four-and-a-half stars out of five, saying, &quot;The words paint a vivid picture of a setting that perfectly mirrors the narrator's emotional state&quot; and calling it &quot;one of his best [singles] to date.&quot;\n\n&quot;'Til Summer Comes Around&quot; debuted at #41 on the Billboard Hot Country Songs charts dated November 28, 2009. Before the song's release, a Keith Urban fan blog called Urban Country Blog had started a petition to release the song as a single.\n\nDefying Gravity is the title of the fifth studio album by Australian country music artist Keith Urban. It was released on March 31, 2009 on Capitol Records. The album's lead-off single is &quot;Sweet Thing&quot;, which topped the Billboard Hot Country Songs charts in March 2009. &quot;Kiss a Girl&quot; was released on March 7, 2009 as the second single. The album became Urban's first number-one album on the Billboard 200, selling 171,000 copies in its first week of release. On December 2, 2009, the album was nominated for the Grammy Award for Best Country Album.\n\nKeith Lionel Urban (born 26 October 1967) is a New Zealand-born Australian country music singer, songwriter and guitarist whose commercial success has been mainly in the United States and Australia. Urban began his career in Brisbane having moved to Caboolture, Australia at an early age. In 1991, he released a self-titled debut album, and charted four singles in Australia before moving to the United States in 1992. Eventually, Urban found work as a session guitarist before starting a band known as The Ranch, which recorded one studio album on Capitol Records and charted two singles on the Billboard country charts.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:ea631ce3b485ada9e900d43d5c25ac7687d5b41d","amp;dn":"Keith+Urban+-+Til+Summer+Comes+Around++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea631ce3b485ada9e900d43d5c25ac7687d5b41d","infoHashBuffer":{"type":"Buffer","data":[234,99,28,227,180,133,173,169,233,0,212,61,92,37,172,118,135,213,180,29]},"announce":[],"urlList":[]}}