{"title":"Red River - Lauraine Snelling","uid":10082841,"size":1798783,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eab1a33d0c1ae1cc066d97a48544f1b689f868b0&amp;dn=+Red+River+-+Lauraine+Snelling&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1399042235,"description":"[b][i][color=darkviolet]Return To Red River[/color][/i][/b]\n \n[img]http://s20.postimg.org/rnril41gd/Return_To_Red_River_1.jpg[/img]\n \n[b][i][color=red]A Dream To Follow[/color][/i][/b]\n \n[i][color=green]It is 1893 and the first generation of immigrants who came to America for the promise of free land and a good life for their children have finally achieved their dreams. They labored hard on the land and now have a bountiful heritage to pass on to the next generation. However, many of the young people aren't interested in becoming farmersthey have aspirations of their own. Thorliff Bjorklund has been writing stories and plays since he was a young boy and longs to attend college to study journalism. But his father has other plans for him and refuses to agree. Thorliff is torn between love for his father and the pull of his dream. Must he choose between the two?[/color][/i]\n \n[b][i][color=red]Believing The Dream[/color][/i][/b]\n \n[i][color=green]It's 1893 and the dream of becoming a writer still burns brightly in Thorliff Bjorklund's heart. But when he arrives at college in Northfield, Minnesota, things are not as he had imagined, and he finds himself longing for things familiar back home in North Dakota. Time and distance have created a rift between him and his childhood sweetheart. The only bright spot in his life is his job at the town newspaper. Will he be forced to leave one dream behind to pursue the other?[/color][/i]\n \n[b][i][color=red]More Than A Dream[/color][/i][/b]\n \n[i][color=green]Book 3 of RETURN TO RED RIVER by bestselling author Lauraine Snelling. Thorliff's goal of becoming a writer is within reach. Working for a newspaper in Northfield, Minnesota, he is busy writing articles and stories for the Minneapolis Tribune and Harper's Magazine. But his idyllic world comes to a sudden halt when an epidemic hits the town of Blessing, North Dakota, following the Red River flood of 1897. Thorliff returns home to help family and friends recover from the aftermath of the disasters and rebuild their town. A captivating and heartwarming tale of aspiration, struggle, love, and triumph.[/color][/i]","torrent":{"xt":"urn:btih:eab1a33d0c1ae1cc066d97a48544f1b689f868b0","amp;dn":"+Red+River+-+Lauraine+Snelling","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eab1a33d0c1ae1cc066d97a48544f1b689f868b0","infoHashBuffer":{"type":"Buffer","data":[234,177,163,61,12,26,225,204,6,109,151,164,133,68,241,182,137,248,104,176]},"announce":[],"urlList":[]}}