{"title":"The Felice Brothers-3 album","uid":4903448,"size":214815848,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eb1f3c7ba078bc7e5590a874a7a1ef8b1918ed7e&amp;dn=The+Felice+Brothers-3+album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SecondOpinion","files":-1,"time":1242768511,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\n\nThe Felice Brothers are a folk rock/country rock band from Upstate New York founded in 2006.\n The Felice Brothers got their start as a band playing in the New York City subway, but their musical experience started much earlier. The sons of a carpenter, they would play together on Sundays at their father's afternoon barbecues. They stayed in a little apartment in Brooklyn and would play at the subway stations near 42nd Street and Union Square in Greenwich Village. The three brothers originally hail from Palenville, NY in the Catskill Mountains.\nNow they tour the country, traveling in their &quot;Short Bus&quot;. They went to England in the summer of 2007 to play a handful of shows. Through the guidance and efforts of manager Paul Schiavo, the band toured in support of many bigger artists winning crowds over. Manager and band worked hard to release their debut album Through These Reins and Gone in 2006 which started the rumblings around the music world. In 2007 Schiavo negotiated and landed the band's first record deal with Loose Music in Europe. The momentum was now strong and the band had paved the way for a solid touring schedule and a growing fan base. Through These Reins and Gone made it onto Radio Woodstock WDST's top 25 albums of 2006, and is available on payplay.fm. Their most recent Album is Adventures of the Felice Brothers Vol. 1. &quot;We put one record out on an English label, and we've released all the other stuff ourselves&quot; as James Felice said it. Their music is almost impossible to get your hands on unless you find yourself at one of their shows. The Felice Brothers have played at Levon Helm's Midnight Ramble in Woodstock, NY and also toured with Conor Oberst and the Mystic Valley Band last fall. \nOn January 7, it was announced The Felice Brothers had signed a record deal with Team Love Records. They toured the United States extensively during the spring (February through mid-April), to promote their new album. The Brothers played at Mountain Jam at Hunter Mountain again this year. They also played at the 2008 Clearwater Festival, Bonnaroo in Manchester, TN, the Philadelphia Folk Festival in Schwenksville, Pennsylvania, All Points West Music and Arts Festival at Liberty State Park in Jersey City, NJ, and Outside lands music and arts festival in San Francisco, California, the latter two festivals being inaugural events.\nIn August, the band performed at the legendary Newport Folk Festival. Due to torrential rains, high winds, and lightning storms, power was cut to the entire Newport, RI area. As the stage the band was performing on had no generators, the band played unplugged. They performed for over an hour with such songs as Frankie's Gun and a sing-a-long to This Land is Your Land.\nThe band has five main members: Ian, Simone and James Felice, their friend Christmas, previously a traveling dice player, and, most recently, Farley, a washboard player and fiddler. At other times, they have featured a horn section in the band, composed of local Hudson Valley musicians. Ian is the main vocalist and plays the guitar and piano. James contributes vocals and plays the accordion, organ, and piano. Simone is the drummer as well as a vocalist and a guitarist. Simone is also an author, recently releasing a book entitled Goodbye Amelia. Christmas plays the bass guitar.\n\n","torrent":{"xt":"urn:btih:eb1f3c7ba078bc7e5590a874a7a1ef8b1918ed7e","amp;dn":"The+Felice+Brothers-3+album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb1f3c7ba078bc7e5590a874a7a1ef8b1918ed7e","infoHashBuffer":{"type":"Buffer","data":[235,31,60,123,160,120,188,126,85,144,168,116,167,161,239,139,25,24,237,126]},"announce":[],"urlList":[]}}