{"title":"Yazoo - You And Me Both - (1983)[EAC-MP3@320KBPS]","uid":4284188,"size":97875357,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ec9d21a85fc77e48682fa38b389b46381ab49b9b&amp;dn=Yazoo+-+You+And+Me+Both+-+%281983%29%5BEAC-MP3%40320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"seanprince","files":21,"time":1215586058,"description":"Yazoo - You And Me Both - (1983)[EAC-MP3@320KBPS]\n\nTrack list\n\nYazoo - You And Me Both\n\n01.\tNobody&amp;#039;s Diary\t\t04:32\n02.\tSoftly Over\t\t04:00\n03.\tSweet Thing\t\t03:43\n04.\tMr Blue\t\t\t03:27\n05.\tGood Times\t\t04:29\n06.\tWalk Away From Love\t03:20\n07.\tOde To Boy\t\t03:37\n08.\tUnmarked\t\t03:36\n09.\tAnyone\t\t\t03:26\n10.\tHappy People\t\t02:59\n11.\tAnd On\t\t\t03:13\n\nBiography\nYazoo (known as Yaz in the U.S.) was a short-lived but highly successful English synthpop duo from Basildon, Essex that had a number of top ten hits in the British charts in the early 1980s.\nHeavily influenced by earlier bands like Kraftwerk, Yazoo expanded upon the synthpop formula by juxtaposing Alison Moyet&amp;#039;s bluesy and emotional vocals with Vince Clarke&amp;#039;s clinical electronic hooks. Its sound referenced disco but added a more disaffected attitude that disco lacked. Their second album saw greater songwriting input from Moyet, adding a rather more mature and soulful flavour, particularly on the hit single &quot;Nobody&amp;#039;s Diary.&quot;\nThe group was formed in 1981, using a moniker that Alison Moyet, veteran of a number of southeast Essex based punk and rock bands, had seen on the labels of old blues albums: Yazoo, although Clarke would later confess that this came from mis-hearing the name of the mouth instrument Kazoo which was popular in the late 1970s. Clarke had been the main songwriter in Depeche Mode, who at that point had recorded one album and three singles for Mute Records, including the hits &quot;New Life&quot; and &quot;Just Can&amp;#039;t Get Enough&quot;. Clarke surprised many by quitting Depeche Mode just as they were beginning to reap success, claiming that they &quot;just weren&amp;#039;t getting on, really&quot;, forming Yazoo with the then relatively unknown Moyet. Mute Records continued to release the output of this new Clarke project. The band was licensed to Sire Records in the United States.\nIts debut single &quot;Only You&quot; backed with &quot;Situation,&quot; was released in April 1982 and rose to number two in the UK. Clarke had offered the song as a parting gift to his former bandmates in Depeche Mode, but they declined. Yazoo quickly scored another hit with the next single, &quot;Don&amp;#039;t Go,&quot; which hit number three, and became popular on MTV in the United States thanks to a Frankenstein-themed video. They continued their successful streak with their first album, Upstairs at Eric&amp;#039;s, which went platinum in Britain. The band received favourable reviews for their pioneering sound. Clarke and Moyet toured briefly, while releasing a stopgap single, &quot;The Other Side of Love.&quot;\nThe duo&amp;#039;s second and last album, You and Me Both, yielded more success, hitting the top of the UK charts, and spinning off one single. The album&amp;#039;s success was tainted by Clarke and Moyet announcing they were to go their separate ways shortly before its release.\nMoyet decided to venture off on a solo career, signing to Columbia Records, where she would enjoy a great deal of early success. Vince Clarke recorded a single with producer Eric Radcliffe (the same &quot;Eric&quot; from the title of Yazoo&amp;#039;s debut album) and Undertones singer Feargal Sharkey as The Assembly, and another with vocalist Paul Quinn. Clarke then founded the highly successful pop group Erasure with vocalist Andy Bell.\nMute Records released a remixed version of &quot;Situation&quot; as a single in 1990 to moderate success. In 1999, a compilation was released, entitled Only Yazoo - The Best of and was preceded by a re-release of Yazoo&amp;#039;s debut single, &quot;Only You&quot;, featuring a new remix of the title track and several more of &quot;Don&amp;#039;t Go&quot;. The band&amp;#039;s output was bookended with yet another release of &quot;Situation&quot;, accompanied by many remixes.\nClarke was tapped to remix Moyet&amp;#039;s 1994 single, &quot;Whispering Your Name&quot; and with Erasure, Clarke and Moyet tried to record her single &quot;This House&quot; as a duet. This project never came to surface, because Sony Music Entertainment would not permit it.\nThe band&amp;#039;s songs have appeared in a number of films and television shows. &quot;Only You&quot; was used in the Napoleon Dynamite, the BBC television series The Office, and the film Can&amp;#039;t Hardly Wait; a cover version of &quot;Only You&quot; by Joshua Radin was used in 2007 in a JC Penney commercial; &quot;Don&amp;#039;t Go&quot; appeared in the BBC series I&amp;#039;m Alan Partridge, was used in the movie Tango and Cash, and can be heard in the video game Grand Theft Auto: Vice City Stories; the song &quot;Situation&quot; was used in the 1990 tv movie &quot;Exile&quot; and was also used in a Nintendo commercial highlighting the classic edition of the Game Boy Advance SP and the classic NES games ported to it. In 1997, &quot;Bring Your Love Down (Didn&amp;#039;t I)&quot; was used in the Sarah Silverman Program episode, &quot;Not Without My Daughter&quot;.\n\nReview\nYou and Me Both is the second, and final, album released by British synthpop duo Yazoo in 1983. As was their debut, the record was produced by Yazoo members Vince Clarke and Alison Moyet along with E.C. Radcliffe. Upon its release You and Me Both received positive reviews from music critics who noted that the album showed strong progression in songwriting and production from both Moyet and Clarke from their debut. The album peaked at #1 in the UK and #193 in the US.\nThe duo, however, announced their split on the eve of the album&amp;#039;s UK release. Moyet would soon begin a successful solo career and Clarke eventually formed the synthpop duo Erasure.\nMoyet would later re-record &quot;Ode to Boy&quot; for her 1994 album Essex in a more acoustic style, which she explained was more consistent with how she envisioned the song should have sounded when she originally wrote it.\n\nEnjoy.","torrent":{"xt":"urn:btih:ec9d21a85fc77e48682fa38b389b46381ab49b9b","amp;dn":"Yazoo+-+You+And+Me+Both+-+%281983%29%5BEAC-MP3%40320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec9d21a85fc77e48682fa38b389b46381ab49b9b","infoHashBuffer":{"type":"Buffer","data":[236,157,33,168,95,199,126,72,104,47,163,139,56,155,70,56,26,180,155,155]},"announce":[],"urlList":[]}}