{"title":"Tromeo &amp; Juliet (eng sub ita).avi","uid":15395608,"size":715591680,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ecc0299b2eeb6028aa198bdf439b414123f6135d&amp;dn=Tromeo+%26amp%3B+Juliet+%28eng+sub+ita%29.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"l.diliberto","files":1,"time":1469391375,"description":"Tromeo and Juliet [VHSrip DivX Eng SubIta] TNT Village\r\n\r\n.: Release Originale :.\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=95486\r\n\r\n.: Trama :.\r\n\r\nNormalmente i cult annunciati finiscono per essere una grossa delusione. Ispirazione forzata, aria di sufficienza e autoindulgenza quando non vuota e noiosa megalomania autocelebrativa. Ma non per la Troma. La Troma ha un codice etico da rispettare, valori che non possono essere scavalcati da alcun vago prurito di ambizione.\r\nLa regola d'oro è: o scrivi e giri tutto in due settimane con due lire o vai a farti produrre da qualcun altro. E divertiti. E chiama gli amici.\r\nChe di solito rispondono, e per fortuna, perchè per una storia del genere non esiste sulla Terra miglior narratore di Lemmy dei Motorhead.\r\nDicevamo, la storia: Monty Que e Cappy Capulet fanno affari insieme nel cinema porno, ma va tutto in malora quando Cappy soffia moglie e azienda al socio: ne nasce la nota rivalità molto sentita da tutti i discendenti. I quali sono giovani sfigati violenti e depravati costantemente impegnati a trombare, cercare di trombare, insultarsi a vicenda e farsi nuovi piercing. Nella prima scena Sammy Capulet tenta di intortare addirittura la sorella (&quot;incest is the best!&quot;), ma non è convincente quanto il padre. E lo sapevate che Giulietta aveva una relazione lesbo con la sua sexy cuoca (birichino di un Shakespeare...)?\r\nNel frattempo Monty Que è diventato un grasso scoreggione perennemente steso dall'alcool, mentre il figlio Tromeo si ammazza di seghe davanti al PC. Ma a una festa di carnevale, dove si sprecano le citazioni dai Troma-classics, scatta la scintilla tra i due giovani protagonisti.\r\nQuello che sorprende della pellicola è la freschezza che trasuda nonostante le premesse permettessero in tutta tranquillità di riposarsi tra gli allori (quanti di voi lo avrebbero guardato comunque soltanto per il titolo?) e, ben oltre questo, le fulminee intuizioni e visioni che lo attraversano, come i sogni freudiani di Giulietta degni di un Ken Russell (la donna incinta ripiena di popcorn) o la stanza stellata con la teca di vetro che non è venuta in mente nemmeno a Baz Luhrman. Senza dimenticare ovviamente i marchi di fabbrica: personaggi fuori di testa, demenzialità imperante, splatter cartoonistico e straeconomico, volgarità senza vergogna di dialoghi e situazioni. In più, il gusto di un unico momento big budget (spettacolare quanto non necessaria carambola in macchina) e quello di indovinare sempre i momenti migliori in cui infilare estemporanee citazioni letterali dall'originale.\r\nSe non conoscete la Troma... beh, innanzitutto avete sbagliato blog, dopodichè questo è un ottimo titolo per farsi un'idea di cosa sono capaci.\r\n\r\n\r\n.: Crediti :.\r\n\r\nCast: Will Keenan: Tromeo Que\r\nJane Jensen: Juliet Capulet\r\nValentine Miele: Murray Martini\r\nWilliam Beckwith: Cappy Capulet\r\nSteve Gibbons: London Arbuckle\r\nSean Gunn: Sammy Capulet\r\nDebbie Rochon: Ness\r\nLemmy Kilmister: narratore\r\nStephen Blackehart: Benny Que\r\nFlip Brown: padre Lawrence\r\nPatrick Connor: Tyrone Capulet\r\nEarl McKoy: Monty Que\r\nGene Terinoni: detective Ernie Scalus\r\nWendy Adams: Ingrid Capulet\r\nTamara Craig Thomas: George Capulet\r\nLloyd Kaufman:\r\nBrian Fox: William Shakespeare\r\n\r\n========================================\r\n\r\n.: Dati tecnici del file :.\r\n\r\nVideo Codec: DivX 5.0.3\r\nVideo Bitrate: 816\r\nRisoluzione: 384 x 288\r\nFPS (Frames/sec):25.000\r\nQF (Frame quality): 0.295\r\n\r\nAudio Codec: 0x0055 MPEG-1 Layer 3\r\nAudio Bitrate: 112 kb/s tot , Joint Stereo\r\nFreq Audio: 44100Hz","torrent":{"xt":"urn:btih:ecc0299b2eeb6028aa198bdf439b414123f6135d","amp;dn":"Tromeo+%26amp%3B+Juliet+%28eng+sub+ita%29.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecc0299b2eeb6028aa198bdf439b414123f6135d","infoHashBuffer":{"type":"Buffer","data":[236,192,41,155,46,235,96,40,170,25,139,223,67,155,65,65,35,246,19,93]},"announce":[],"urlList":[]}}