{"title":"Questions for Jehovah's Witnesses (version with images)..docx","uid":8352026,"size":3238107,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eed6055c0c042d188ecbf83f66ea0c17507be09c&amp;dn=Questions+for+Jehovah%27s+Witnesses+%28version+with+images%29..docx&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aekarajonny","files":1,"time":1365368692,"description":"Questions for Jehovah's Witnesses (version with images).\n\nplease,share:\nWorship of Jesus is OK?\n\n1879 &quot;His position is contrasted with men and angels, as he is Lord of both, having 'all power in heaven and earth'. Hence it is said, 'Let all of the angels of God worship him' [that must included Michael, the chief angel, hence Michael is not the Son of God] and the reason is, because he has 'by inheritance obtained a more excellent name than they.'&quot; (C.T. Russell, Watchtower Nov. 1879, bracketed comment in the original)\n\n1880 &quot;He was the object of unreproved worship even when a babe, by the wise men who came to see the new-born king... He never reproved any for acts of worship offered to Himself... Had Christ not been more than man the same reason would have prevented Him from receiving worship.&quot; (Watchtower Reprints, 1, Oct., 1880, p. 144).\n\n1898 &quot;Question... Was he really worshipped, or is the translation faulty? Answer. Yes, we believe our Lord while on earth was really worshipped, and properly so... It was proper for our Lord to receive worship...&quot; (Watchtower Reprints, 111, July 15, 1898, p. 2337).\n\n1915 &quot;As the special messenger of the Covenant, whom the Father had sanctified and sent into the world to redeem the world, and whom the Father honored in every manner, testifying, 'This is my beloved son, in whom I am well pleased' - it was eminently proper that all who beheld his glory, as the glory of an Only Begotten of the Father, full of grace and truth, should reverence him, hear him, obey him, and worship him - do him homage - as the representative of the Father.&quot; (At-One-Ment Between God And Man, 1899; 1915 ed.; p. 134)\n\n1945 &quot;Since Jehovah God now reigns as King by means of his capital organization Zion, then whosoever would worship him must also bow down to Jehovah's Chief One in that organization, namely Christ Jesus, his co-regent on the throne of The Theocracy.&quot; (Watchtower, Oct 15, 1945)\n\n1945 &quot;The purposes of this Society are: ... public Christian worship of Almighty God and Jesus Christ; to arrange for and hold local and world-wide assemblies for such worship...&quot; (Charter of the Watchtower Society of Pennsylvania, Article II, Feb 27, 1945 [the 1969 Yearbook quotes Article II of the Charter, &quot;and for public Christian worship of Almighty God....&quot; leaving off the original requirement to worship Jesus])\n\n1970 &quot;But when He again brings his First-born into the inhabited earth, he says: 'And let all God's angels worship him' Hebrews 1:6.&quot; (New World Translation, 1950, 1961, 1970 editions, [The NWT revised 1971 edition was changed to read, &quot;do obeisance to&quot; rather than &quot;worship&quot;])...\n\n","torrent":{"xt":"urn:btih:eed6055c0c042d188ecbf83f66ea0c17507be09c","amp;dn":"Questions+for+Jehovah%27s+Witnesses+%28version+with+images%29..docx","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eed6055c0c042d188ecbf83f66ea0c17507be09c","infoHashBuffer":{"type":"Buffer","data":[238,214,5,92,12,4,45,24,142,203,248,63,102,234,12,23,80,123,224,156]},"announce":[],"urlList":[]}}