{"title":"Social Media Security Leveraging Social Networking While Mitigat","uid":9395996,"size":11090025,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef040a93b750530d9adb975d706a690493a64c35&amp;dn=Social+Media+Security+Leveraging+Social+Networking+While+Mitigat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"swatiate","files":1,"time":1387982902,"description":"Publication Date: November 29, 2013 | ISBN-10: 1597499862 | ISBN-13: 978-1597499866 | Edition: 1\nSocial networks, particularly public ones, have become part of the fabric of how we communicate and collaborate as a society. With value from micro-level personal networking to macro-level outreach, social networking has become pervasive in people's lives and is now becoming a significant driving force in business. These new platforms have provided new approaches to many critical enterprise functions, including identifying, communicating, and gathering feedback with customers (e.g., Facebook, Ning); locating expertise (e.g., LinkedIn); providing new communication platforms (e.g., Twitter); and collaborating with a community, small or large (e.g., wikis). However, many organizations have stayed away from potential benefits of social networks because of the significant risks associated with them. This book will help an organization understand the risks present in social networks and provide a framework covering policy, training and technology to address those concerns and mitigate the risks presented to leverage social media in their organization. The book also acknowledges that many organizations have already exposed themselves to more risk than they think from social networking and offers strategies for &quot;dialing it back&quot; to retake control.\n\nDefines an organization's goals for social networking\nPresents the risks present in social networking and how to mitigate them\nExplains how to maintain continuous social networking security","torrent":{"xt":"urn:btih:ef040a93b750530d9adb975d706a690493a64c35","amp;dn":"Social+Media+Security+Leveraging+Social+Networking+While+Mitigat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef040a93b750530d9adb975d706a690493a64c35","infoHashBuffer":{"type":"Buffer","data":[239,4,10,147,183,80,83,13,154,219,151,93,112,106,105,4,147,166,76,53]},"announce":[],"urlList":[]}}