{"title":"Infernal Restraints--Purple Rain  Rain DeGrey MP4","uid":9374487,"size":1874449772,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:ef102d6232623c5bbebc5f5333f0be9769c86cf6&amp;dn=Infernal+Restraints--Purple+Rain++Rain+DeGrey+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1387596276,"description":"Purple Rain | Rain DeGrey\n\nDecember 20, 2013\n\n\nMP4 only.\n\n\nToday we have the beautiful Rain DeGrey on hand for a bit of rough play. She is one of our favorite models because in addition to being so hot she absolutely loves bondage and discipline. That is why she keeps coming back to us for more. The second the bruises fade she is looking for another chance to suffer, cry and cum.\n\nThe scene opens on a helpless Rain DeGrey in a slinky purple dress. Her hands are bound behind her with leather straps, her arms are wound around wooden pegs to keep them in place. She tries to wriggle, but her ankles are held together, too and the high heels on her feet make balancing a tricky situation. One false step her shoulders will be bearing her full weight. \n\nIn this position she can't offer any resistance as Cyd Black cuts away her dress with scissors. A small scrap of cloth and a pair of stockings are the only things left covering her and they leave absolutely nothing to the imagination. If she was planning on protesting her defrocking the rag-gag in her mouth has eliminated that option. Held in place with tape and a face mask it is an effective means of muffling her. \n\nCut clear of her clothing, Rain's magnificent tits are exposed. Firm and round they make a tempting target for the whip. As it crisscrosses her body the mixed moans of pain and pleasure escape her throat but are stifled by the gag. The tears, however, flow freely, making her make up start to run. \n\nHer pussy is going to get some, too. Every slap of the whip across her lips will make them more sensitive for the next one. It is only a few hits before they start to turn pink. We meant it when we said she loved bondage and discipline. Her arousal is apparent from the way her body flushes with anticipation. \n\nSuffering sweetly earns her a brief reward. The Hitachi is the most powerful hand held vibrator in the world. For most women a few seconds on high is enough to bring them to the edge or orgasm or even push them over the edge. Cyd is going to play a sadistic game with Rain. She will get just a taste of the pleasure that the high speed toy and bring her but it won't be enough to get her off. \n\nShe jerks against her bondage in frustration. All she wants to do is feel the release of a powerful orgasm, but Cyd has other ideas. Rain can moan, buck and beg all she wants, she isn't getting off until he decides that it is what he wants to see. He is probably doing her a favor, actually, considering how powerfully Rain cums. She has the kind of orgasms that make her weak in the knees and may make it hard for her to stand up on those heels. \n\nEventually she does get her wish, although she soon regrets it. As Cyd pushes the vibrator against her clit she sinks down to meet it and feel the waves of pleasure wash over her. It isn't until she has had her first orgasm that she realizes he has just found another way to torture her. The sensations between her legs won't stop now, as the ecstasy turns to the agony of over-stimulation. \n\nWhen she has been rebound into her new position Rain may think that things are getting better. First off, the rag in her mouth has been replaced by a ring, meaning that if she screams the sound will be heard loud and clear. Second, this time she is bound on her back, with her legs straight up into the air. It means no more fretting over whether or not her knees are starting to feel weak. \n\nThen again, it means a few things to Cyd, too. Her ass and pussy are completely exposed now. Her hands and ankles are shackled into place so there is no reason to worry about how much she may buck. Even her head is mostly immobilized, this time by a set of hooks in her nostrils that pull her nose up into a humiliating pig snout. The only think she can do freely is flex her fingers. Her toes have been tied to a pair of intense nipple clamps so that if Rain arches her feet the lines will pull taut and tug at her tits. It's an awful predicament she finds herself in, and that is before the torments start.\n\nRain's pussy has barely had a chance to recover. It's still sensitive from the last round of orgasms when Cyd puts a very precise little instrument right against her clit. The celebrator doesn't have the raw power of a hitachi but it is entirely focused into a much smaller area. While the larger vibrator feels like it is shaking her whole body, this tiny terror puts all of the emphasis right onto her most sensitive spot. \n\nShe struggles as much as the iron around her limbs will let her but there is no getting away from it. This time Cyd isn't even worried about taking it away before she cums. Instead he has decided to inflict a few painful distractions on her, to see if she can manage to get off through the combination of sensations. She is freely allowed to orgasm as many times as she wants to if she can manage it. \n\nBy the end she is just a shell. Rain has cum so many times that she isn't sure if she can anymore. She has stripes from whips and canes all over her body. Her tits, ass and pussy are aching and inside she feels dirty and used. It is exactly the Gold Experience that she came here looking for. And it isn't over yet... \n \nScreens  &lt;a href=&quot;\nhttp://infernalrestraints.com/device/bondage/2013/12_20rdegrey14/InfernalRestraints-Rain-DeGrey-Purple-Rain.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://infernalrestraints.com/device/bondage/2013/12_20rdegrey14/InfernalRestraints-Rain-DeGrey-Purple-Rain.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:ef102d6232623c5bbebc5f5333f0be9769c86cf6","amp;dn":"Infernal+Restraints--Purple+Rain++Rain+DeGrey+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef102d6232623c5bbebc5f5333f0be9769c86cf6","infoHashBuffer":{"type":"Buffer","data":[239,16,45,98,50,98,60,91,190,188,95,83,51,240,190,151,105,200,108,246]},"announce":[],"urlList":[]}}