{"title":"Aventurile Tigrisorului [dublat romana]","uid":5931799,"size":731641856,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ef25e8d79229f08ec9eaf302a25224cb8217a323&amp;dn=Aventurile+Tigrisorului+%5Bdublat+romana%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1288805256,"description":"DVDRIp dublat romana [romanian audio]\n\n\ncautati &quot;dublat&quot; pe thepiratebay si veti gasi si alte animatii\n\n\n\n\n\n\n     Dupa cum bine stim, Tigrisorul este bun prieten cu Ursuletul Plus, Iepurila, purcelusul Grohi, magarusul Eeyore si cangurul Roo. De obicei, se inteleg de minune, dar, ca toti prietenii, se intampla sa se mai certe din cand in cand. \n\n   De pilda, Tigrisorul se stie singur pe lume si duce mai mereu dorul unui prieten de joaca. Asa se face ca, in timp ce zburda prin padure iar prietenii sai isi fac pregatirile pentru iarna, neastamparatul Tigrisor darama un ditamai bolovanul pe casa prietenului sau Eeyore.  \n\n   Desi se straduieste sa-si indrepte greseala, prietenii lui sunt suparati pe el si astfel Tigrila pleaca dezamagit, simtindu-se singur si respins de toti.\n  \n   Cand Bufnita ii recomanda sa-si caute arborele genealogic ca sa-si regaseasca familia, Tigrisorul o ia de buna si incepe sa colinde toata Padurea Celor O suta de Stejari in cautarea copacului in care se asteapta sa-si gaseasca parintii si fratii. Dar, pentru ca nu afla, desigur, niciun astfel de arbore, scrie o scrisoare familiei lui si e si mai dezamagit cand nu primeste raspuns. \n\n    Insa prietenii la nevoie se cunosc: miscati de singuratatea Tigrisorului, se hotarasc sa-i transmita ca ei insisi sunt familia pe care o cauta. Totusi, el vrea cu tot dinadinsul sa-si cunoasca fratii de sange. Va intelege oare adevaratul inteles al familiei? Vom vedea in &quot;Aventurile Tigrisorului&quot;, o sarbatoare a prieteniei pe placul intregii familii.","torrent":{"xt":"urn:btih:ef25e8d79229f08ec9eaf302a25224cb8217a323","amp;dn":"Aventurile+Tigrisorului+%5Bdublat+romana%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef25e8d79229f08ec9eaf302a25224cb8217a323","infoHashBuffer":{"type":"Buffer","data":[239,37,232,215,146,41,240,142,201,234,243,2,162,82,36,203,130,23,163,35]},"announce":[],"urlList":[]}}