{"title":"[Blacks On Blondes] Cuckold Sessions 22 (2016)","uid":13897498,"size":1930398136,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:efaf32eae179d6a2679008bd036579ba2b2ee7c7&amp;dn=%5BBlacks+On+Blondes%5D+Cuckold+Sessions+22+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"distinc","files":12,"time":1458253600,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=2866660622\r\n \nhttp://imagedisco.net/?g=2851757286\r\n\r\n\r\n\r\nDescription:\r\n\r\nAlena Croft and her Hubby, Bob, have an interesting relationship. Bob is in his mid-fifties, and honestly, he can no longer keep up with his hot, horny wife. He quit trying years ago. Now he's accepted other men will enjoy her, so why not enjoy himself as Alena enjoys herself? Here's their trick: they call repairmen and have them come check whatever it is they say is &quot;broken&quot;: the refrigerator, the AC, the pool pump...whatever. As Bob's showing the workmen around, they'll always catch Alena doing inappropriate things. Then they size up the workmen's reaction, and if Alena and Bob get a &quot;good feeling&quot;, Alena makes the next move. Just watch and see Alena and Bob work their magic on today's plumbing crew!\r\n\r\nLet's face it, you've been on the road too much lately, but your work demands it. You know your wife, Anikka, has been a little dissatisfied lately...but you haven't had much time to even think much about it. And the times you do manage to pay attention to her while you're home, well...the sex is getting a little mundane. What you didn't expect is Anikka's next move. Let's call is &quot;Anikka's Surprise&quot;. While you're far away on another business trip making money for your family, your wife took the family camcorder and placed it on a tripod. Then, she pressed record. What starts out as a teaser video for you as a gift when you return quickly turns into something you're not sure you can handle...but you watch anyway. Anikka's invited a black man into your bedroom, and she's going to fuck him on your marital bed. She'll even do things with him she'd never do with you. For example, she takes him in her ass then swallows his cum. After it's all said and done, your head is spinning. Time for a divorce? Or have her invite more men in next time you leave town?\r\n\r\nWe're all a little &quot;off&quot;, especially if we're here, watching cuckold porn. This is absolutely OK, too, as one of our frequent cucks -- Ciccle Cixx -- is about to discover. He started seeing a therapist, Dr. Dava Foxx, to see if this whole cuckolding fetish he has is &quot;normal&quot;. He's explained to Dr. Foxx about his obsession with interracial porn, as well as his constant worrisome behavior about things like his girlfriend cheating on him and his small penis. Dr. Foxx agrees with him that it's not normal...and all those behaviors are OK. Let's face it, the world needs cuckolds, so after Dr. Foxx drills that into Ciccle's brain, she calls in her assistant, Dr. Moe &quot;The Monster&quot; Johnson, and just like that, a typical therapy session turns into a not-so-typical cuckold session!\r\n\r\nSwingers. They're everywhere. Just ask Isiah Maxwell. He's just wrapped his first day on the job, and his new boss, Dominik, is going over how to close up shop when he drops the question: &quot;hey, want to come over for dinner and drinks and you can meet my girl?&quot; Isiah's new in town, so why not? What Isiah doesn't know is he's part of a set-up. Dominik and Jasmine have been searching for a new play partner, and specifically a black play partner. Before Isiah can shut off the lights and lock up the place, Domink's already instructed Jasmine to get on the tight, slinky dress, the hot, black lingerie, and get ready! There's a dinner guest tonight, and it's about to be one dinner date Isiah's never going to forget!\r\n\r\nRyan has been at a crossroad in his life:his love life with Jay Taylor is seriously lacking in the heat department. Moe is his best friend who's the willing ear in Ryan's frustration. The only solution to remedy Ryan and Jay Taylor's problem seems to be if Moe came in and spiced things up for them a bit. Jay's initial reluctance is met with Ryan cheering her on to take his friend's big black dick. Jay, not liking this situation one bit, finally agrees to satisfy her man's kinky desires. The slutty white girl with glasses gets down to suck on Moe's black monster. Jay Taylor continues to go along with her boyfriend's wishes as she sucks down all of Moe's black salami. The generous girlfriend is coached by her guy to accept the power of big,black dick.....right in her cunt. Jay's man/cuckold has a grin that can't be wiped off his face as his woman is succumbing to his darkest-no pun intended- fantasy of fucking a black guy in front of him. The only thing left to do is for Ryan to watch his woman gladly accept Moe's cumshot. And she does it so well, too","torrent":{"xt":"urn:btih:efaf32eae179d6a2679008bd036579ba2b2ee7c7","amp;dn":"%5BBlacks+On+Blondes%5D+Cuckold+Sessions+22+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efaf32eae179d6a2679008bd036579ba2b2ee7c7","infoHashBuffer":{"type":"Buffer","data":[239,175,50,234,225,121,214,162,103,144,8,189,3,101,121,186,43,46,231,199]},"announce":[],"urlList":[]}}