{"title":"Family Tracker android","uid":6742549,"size":535874,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:f0101a46fc4f3c1230399a9f4554e04d62698872&amp;dn=Family+Tracker+android&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".BONE.","files":1,"time":1318566836,"description":"FamilyTracker allows you to track Android or Apple iOS devices.WORKS WITH ALL DEVICES (Android v.2.2 and up).\nFamily Tracker allows you to track Android or Apple iOS devices and send free text messages between the users.\n* Android users can track iPhone users and vice versa\n* No monthly or any other periodic fees\n* You can force updates remotely at any time without the user having to take any actions and it does not matter if the application is running or not\n* The ability to send a &quot;Stealthy Ping&quot;, which will force an automatic location update of the remote device without the person being notified. This feature is only available if the device bing tracked is Android and has Family Tracker ver. 2.4.4 or above installed.\n* Even if the phone is rebooted, Family Tracker will automatically resume tracking and updating its position!\n* Free texts between phones\n* Find your phone when lost or stolen\n* Force a sound even if the phone is on vibrate or silent\n* Track phones via the web\n* There are no limits to the number of users to track\n* Uses the latest C2DM technology\n* Tablet compatible - including Motorola Xoom\nFamilyTracker allows you to track your children, wife, husband and fiancÃƒÂ©e. You can now find out where they are, at anytime, as long as they have their Android phones or iPhones with them.\nSo how does this work?\nSimple. Install Family Tracker on the Android/iPhone/iPad you want to track. From then on, you can use either a web browser or via the Family Tracker app itself installed on your own device to locate your family member.\nEach device with FamilyTracker installed has the option to automatically update its location at regular intervals (from every 1 min. to every 1 hour). You can adjust the frequency of the updates on the &quot;Settings&quot; tab. The automatic feature can be turned on/off by the user by going to the &quot;Settings&quot; tab as well.\nWhether the user has their automatic tracking service disabled or not you can always force an update of their location at any time.\nAny time you would like to see the current location of a device you can &quot;ping&quot; it, which will send a tracking notification to the user. The &quot;Stealthy Ping&quot; feature works only if the targeted device has Family Tracker ver. 2.4.4 or above.\nThere are 2 ways to set up tracking a phone with our application:\n1. Having the application installed on both phones- yours and the person you want to track. Once it is installed on both phones, you can send a request to track them from your phone and they have to approve your request. Then you can track them from your phone.\n2. Install the Family Tracker application only on the phone you want to track and then use our website to track it, force location updates and send free messages. To do this, your email address needs to be added under the &quot;Locate Me&quot;\ntab of the Family Tracker application on the phone you want to track. Then you will automatically get an email with instructions how to track the phone via the web.\nFamily Tracker does not need to know your phone's cell number to function, as it does not send SMS messages for notifications. Your email address is instead used to send free Push Notifications to the device being tracked. These notifications are free, specific to our Family Tracker application, and work anywhere in the world as long as the device being tracked has internet access via the cellular network or WiFi.\n*** Requires Android OS version 2.2 and up ***\nTrack your kids, family, wife, husband, fiancÃƒÂ©e, friends, employees and coworkers. Be able to find their location in real time.","torrent":{"xt":"urn:btih:f0101a46fc4f3c1230399a9f4554e04d62698872","amp;dn":"Family+Tracker+android","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0101a46fc4f3c1230399a9f4554e04d62698872","infoHashBuffer":{"type":"Buffer","data":[240,16,26,70,252,79,60,18,48,57,154,159,69,84,224,77,98,105,136,114]},"announce":[],"urlList":[]}}