{"title":"JavaFX in Action 2012","uid":7634969,"size":12395097,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f09c35b08d25c79bbf85ae6446cc7cda6b8c486f&amp;dn=JavaFX+in+Action+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"renatosistema","files":-1,"time":1347619096,"description":"Book Description\n\nJavaFX is a Java-based rich user interface technology that sits atop the existing Java Standard and Micro Editions. Using it, developers can build rich user interfaces with access to all Java components already installed on their systems. At its heart is the easy to learn JavaFX Script language that lets developers describe what they want to accomplish in clear, declarative terms rather than abstract code. JavaFX also provides numerous libraries to make development extremely fast and efficient.\n\nJavaFX in Action is a hands-on tutorial that introduces and explores JavaFX through numerous bite-sized projects. The book provides a solid grounding in the JavaFX syntax and related APIs by showing web developers how to apply the key features of the JavaFX platform. Readers quickly absorb the fundamentals of the technology while exploring the possibilities JavaFX provides for creative, rich designs.\n\nReaders learn to transform variables and operators into bouncing raindrops, brilliant colors, and dancing interface components. They also learn how to interact with existing Java code to give old apps some new JavaFX sparkle.","torrent":{"xt":"urn:btih:f09c35b08d25c79bbf85ae6446cc7cda6b8c486f","amp;dn":"JavaFX+in+Action+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f09c35b08d25c79bbf85ae6446cc7cda6b8c486f","infoHashBuffer":{"type":"Buffer","data":[240,156,53,176,141,37,199,155,191,133,174,100,70,204,124,218,107,140,72,111]},"announce":[],"urlList":[]}}