{"title":"Das Dschungelbuch 2 German uncutt","uid":5143831,"size":696581574,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f165d2779e713f61521aea2e94cfc6fe0ea53235&amp;dn=Das+Dschungelbuch+2+German+uncutt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BenHardn","files":-1,"time":1257103405,"description":"Das Dschungelbuch 2\n\nFilmdaten:\nDeutscher Titel: \tDas Dschungelbuch 2\nOriginaltitel: \tThe Jungle Book 2\nProduktionsland: \tUSA\nErscheinungsjahr: \t2003\nLÃƒÂ¤nge: \t72 Minuten\nOriginalsprache: \tEnglisch\nAltersfreigabe: \tFSK o. A.\nStab\nRegie: \tSteve Trenbirth\nDrehbuch: \tKarl Geurs\nProduktion: \tChristopher Chase,\nMary Thorne\nMusik: \tGeorge Bruns\nSchnitt: \tChristopher Gee, Peter Lonsdale\nBesetzung\n\nSprecher leider nur englisch:\n    * Balu\n      John Goodman\n    * Mogli\n      Haley Joel Osment\n    * Shanti\n      Mae Whitman\n    * Rajan\n      Connor Funk\n    * Baghira\n      Bob Joles\n    * Shir Khan\n      Tony Jay\n    * Kaa\n      Jim Cummings\n    * Colonel Hathi\n      Jim Cummings\n\nDas Dschungelbuch 2 ist ein US-amerikanischer Zeichentrickfilm aus dem Jahr 2003. Es ist die Fortsetzung des Filmes Das Dschungelbuch. Der Film basiert jedoch nicht auf der Geschichtensammlung Das zweite Dschungelbuch von Rudyard Kipling. Die Geschichte handelt von Mogli, der sich auf den Weg in den Dschungel macht, um seine alten Freunde wiederzutreffen. Obwohl der Film ursprÃƒÂ¼nglich direkt auf VHS/DVD erscheinen sollte, kam er trotzdem in die Kinos.\n\nMogli, das Findelkind, lebt in der Siedlung der Menschen zusammen mit seinen Adoptiveltern und seinem neuen kleinen Bruder Ranjan. Er hat in ihnen eine richtige Familie gefunden. Auch mit dem bezaubernden MÃƒÂ¤dchen Shanti, dass ihn in die Menschensiedlung gelockt hat, hat er Freundschaft geschlossen. Andererseits gibt es aber in dem Dorf auch eine Menge Regeln und Verbote. Die wichtigste Regel besagt, dass sich Kinder nie in die NÃƒÂ¤he des Dschungels begeben dÃƒÂ¼rfen. Nach einiger Zeit beginnt Mogli jedoch den Dschungel und besonders seinen Freund, den BÃƒÂ¤ren Balu zu vermissen.\n\nBalu geht es ÃƒÂ¤hnlich, denn auch er vermisst seinen Freund Mogli. Obwohl ihn der weise Panther Baghira warnt, schleicht sich Balu, gegen die vereinten KrÃƒÂ¤fte von Colonel Hathi und seiner Elefanten eines Nachts unbemerkt in die Menschensiedlung und nimmt Mogli wieder mit in den Dschungel.\n\nShanti glaubt an eine EntfÃƒÂ¼hrung Moglis durch einen wilden BÃƒÂ¤ren und macht sich mit Ranjan auf die Suche nach Mogli. Auch Moglis Erzfeind Shir Khan schleicht im Dschungel umher und will sich an dem Menschenkind (Mogli) rÃƒÂ¤chen. AuÃƒÅ¸erdem ist da noch die Schlange Kaa, die Mogli und Balu entdeckt und Mogli fressen will, was aber glÃƒÂ¼cklicherweise misslingt.\n\nShanti und Ranjan verlaufen sich auf der Suche nach Mogli im Dschungel, finden ihn aber schlieÃƒÅ¸lich traurig an einem Baum sitzend. Als kurze Zeit danach Balu dazustÃƒÂ¶ÃƒÅ¸t, erschrickt dieser Shanti zunÃƒÂ¤chst, die ihn noch fÃƒÂ¼r einen Feind hÃƒÂ¤lt, so dass Shanti und Ranjan wieder weglaufen. Mogli ist wÃƒÂ¼tend auf Balu und verfolgt Shanti. Dabei begibt er sich immer tiefer in den Wald hinein und trifft dort schlieÃƒÅ¸lich auf Shir Khan, aber auch Shanti, Ranjan und Balu stoÃƒÅ¸en wieder dazu. Durch ein Verwirrspiel in einem Tempel gelingt es ihnen Shir Khan zu ÃƒÂ¼berlisten und einzusperren. SchlieÃƒÅ¸lich kehren sie in die Menschensiedlung zurÃƒÂ¼ck, kehren aber immer wieder fÃƒÂ¼r kurze Besuche in den Dschungel zurÃƒÂ¼ck.\n\nProduziert wurde der Film von den DisneyToon Studios, Walt Disney Animation Australia, Walt Disney Pictures und Walt Disney Television Animation, Regie fÃƒÂ¼hrte Steve Trenbirth. Das Drehbuch schrieb Karl Geurs, die Musik komponierte Patrick Griffin und fÃƒÂ¼r den Schnitt waren Christopher Gee und Peter Lonsdale verantwortlich.\n\nDer Film kam erstmals am 5. Februar 2003 in Frankreich in die Kinos, es folgten Premieren in DÃƒÂ¤nemark, Norwegen, Schweden und am 9. Februar 2003 in den USA. In Deutschland kam der Film am 27. MÃƒÂ¤rz 2003 in die Kinos. Buena Vista vertreibt den Film international, auch auf VHS und DVD.\n","torrent":{"xt":"urn:btih:f165d2779e713f61521aea2e94cfc6fe0ea53235","amp;dn":"Das+Dschungelbuch+2+German+uncutt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f165d2779e713f61521aea2e94cfc6fe0ea53235","infoHashBuffer":{"type":"Buffer","data":[241,101,210,119,158,113,63,97,82,26,234,46,148,207,198,254,14,165,50,53]},"announce":[],"urlList":[]}}