{"title":"I Am Legend - Radio Drama","uid":4676379,"size":241877335,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f1c67c73ec803765850a39e95c904b2803dc652e&amp;dn=I+Am+Legend+-+Radio+Drama&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Welshguy","files":-1,"time":1232912589,"description":"BBC Radio 2007 - I Am Legend - Richard Matheson's 1954 cult vampire classic - podded by cheops\n----------------------------------------------------------------------------------------------\nRichard Matheson's 1954 cult classic pits the last living man on Earth against hordes of plague-infected vampires...\n\nA BBC Radio Audiobook by of the novel by Richard Matheson - nine episodes of approx 30 minutes each in high quality MP3.\n\nThis story has so far twice been adapted onto film - In 1964 Vincent Price starred as Dr. Robert Morgan in 'The Last Man on Earth' and in 1971 Charlton Heston appeared in a far different version as 'The Omega Man'\n\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\nTHIS CLASSIC HORROR/SCIFI STORY IS SCHEDULED FOR RELEASE\n    AS A MOVIE STARRING WILL SMITH IN NOVEMBER 2007\n\n    !!PLEASE READ OR HEAR THE ORIGINAL BEFORE SEEING\n       THE MANGLED AND BUTCHERED HOLLYWOOD VERSION!!\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\nEpisode 1:\n----------\nIn the then-future of 1976-1979 Robert Neville is apparently the only survivor of an apocalypse caused by a pandemic of a bacterium the symptoms of which are very similar to vampirism.\n\nEpisode 2:\n----------\nOn a pilgrimage to his wife's tomb, Robert Neville discovers that vampires have been using it as a lair.\n\nEpisode 3:\n----------\nDriven to distraction by memories, Neville has decided that scientific investigation is his only weapon against the plague.\n\nEpisode 4:\n----------\nAfter several false starts, Neville resolves to take a more rigorous approach to his search for the plague's origins.\n\nEpisode 5:\n----------\nBuoyed by his success in isolating the germ, Neville believes he must be close to a cure - but he's about to be distracted.\n\nEpisode 6:\n----------\nCrushed by the death of the dog and no closer to a scientific breakthrough, Neville decides to look for answers in the past.\n\nEpisode 7:\n----------\nThe discovery of another living human leaves Neville shocked and deeply suspicious. Is Ruth all that she seems?\n\nEpisode 8:\n----------\nNeville harbours doubts that Ruth is free from the plague and begins to regret the information he has shared with her.\n\nEpisode 9:\n----------\nDespite learning that the new society is preparing to attack him, Neville refuses to leave the sanctuary of his house.\n\n[apologies - the usual cast and credits information has proved hard to find...]\n-----------------------\nType : mpeg 1 layer III\nBitrate : 128\nMode : joint stereo\nFrequency : 44100 Hz\nEncoder : Lame 3.95\n-----------------------\n\n\nCovers included with this! I downloaded this from cheops and enjoyes it so much I wanted to share it with others.  \n\nWith that in mind please share this to other by seeding this as much as you can!\n\nEnjoy!","torrent":{"xt":"urn:btih:f1c67c73ec803765850a39e95c904b2803dc652e","amp;dn":"I+Am+Legend+-+Radio+Drama","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1c67c73ec803765850a39e95c904b2803dc652e","infoHashBuffer":{"type":"Buffer","data":[241,198,124,115,236,128,55,101,133,10,57,233,92,144,75,40,3,220,101,46]},"announce":[],"urlList":[]}}