{"title":"EnigmaT Set Rips { Cuts } - April 10th, 2014","uid":9932564,"size":1208151359,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f1d778d44916cd1b435e59012d7fd62e490c6681&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+April+10th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":137,"time":1397120377,"description":"3Lau - Bang (Tiesto Bootleg) (Cut From W&amp;W Set)-enTc\n4Strings - Chemistry (Cut From W&amp;W Set)-enTc\nA &amp; Z - Redemption (Original Mix) (Cut From Tangle Set)-enTc\nAbandoned Rainbow - La Flamme Noire (Craft Integrated Remix) (Cut From Tucandeo Set)-enTc\nAdam Navel &amp; Saint Sinners - Chimera (Store N Forward Remix) (Cut From Feel Set)-enTc\nAddictive Glance - Undine (Original Mix) (Cut From Tucandeo Set)-enTc\nAeron Aether feat. Catherine - Twilight (Clandestine Remix) (Cut From Young Free Set)-enTc\nAirwave - Tigris and Euphrates (Cut From J00F Set)-enTc\nAirwave - Triangle (Cut From J00F Set)-enTc\nAlive - Up (Original Mix) (Cut From Oakenfold Set)-enTc\nAllan Morrow - F You (Cut From Photographer Set)-enTc\nAlvaro - Shades (twoloud Private Drop Edit) (-SHORT- Cut From Xabi Set)-enTc\nAly &amp; Fila - First Sun (Dan Stone Remix) (Cut From A&amp;F Set)-enTc\nAly &amp; Fila Feat. Sue McLaren - Where To Now (Ferry Tayle Remix) (Cut From A&amp;F Set)-enTc\nAly &amp; Fila Feat. Tricia McTeague - Speed of Sound (Sneijder Remix) (Cut From A&amp;F Set)-enTc\nAmygdala - Catabolismic (Cut From J00F Set)-enTc\nAndski - ID (Cut From Andski Set)-enTc\nAndy Elliass - The Specialist (Original Mix) (Cut From Saux Set)-enTc\nARCZI - Natural Harmony (Original Emotional Mix) (Cut From All Stars Set)-enTc\nARCZI - Natural Harmony (Original Emotional Mix) (Cut From tranzLift Set)-enTc\nAshai - Interstellar Spacecraft (Rich Triphonic Remix) (Cut From Romel Set)-enTc\nAugust Rush - Booster (Cut From Proff Set)-enTc\nBT feat. Jan Johnston - Communicate (Slighter Unreleased Remix) (Cut From Young Free Set)-enTc\nCBM - Voltaic (Cut From J00F Set)-enTc\nChardy &amp; Steve Mink - Yoo (Cut From First State Set)-enTc\nChris Schweizer - Skyscraper (Cut From Andski Set)-enTc\nChuckie x Dzeko &amp; Torres - Dirty Funkin Beats (Diamond Pistols Remix) (Cut From Page Set)-enTc\nCiro Visone - I Will Never Leave You (C-Project Remix) (Cut From Angel Ace Set)-enTc\nCiro Visone - I Will Never Leave You (Steve Morley Remix) (Cut From ReOrder Set)-enTc\nCosmonaut Satellites - I Dont Know (Matan Caspi Remix) (Cut From Solarstone Set)-enTc\nDave Correa feat. Amber Traill - Gravity (Cut From Photographer Set)-enTc\nDavid Surok - Galaxy (Blue Silence Remix) (Cut From All Stars Set)-enTc\nDavid Surok - Galaxy (Michele Cecchi Remix) (Cut From Romel Set)-enTc\nDavid Surok - Galaxy (Michele Cecchi Remix) (Cut From tranzLift Set)-enTc\nDedRekoning feat Sophie Ellis - Become One (Zero Gravity Edit) (Cut From Oakenfold Set)-enTc\nDeorro &amp; Zoofunktion - Hype (Hunter Siegel Remix) (Cut From Page Set)-enTc\nDiamans - Voice (Marcel Kenenberg Remix) (Cut From Tyas Set)-enTc\nDJ Borra - Cosmo (Alex Vilanueva &amp; Kaban Remix) (Cut From J00F Set)-enTc\nDj Grent Dj Dimka - Ultimatum (Cut From Feel Set)-enTc\nDNS Project - Latitude (Cut From Bobina Set)-enTc\nDreamy &amp; Ikerya Project - Bahamut (Outer Space Remix) (Cut From All Stars Set)-enTc\nDriftmoon - Luminance (Uplifting Mix Edit) (Cut From Solarstone Set)-enTc\nDVBBS &amp; MoTi - This Is Dirty (Cut From W&amp;W Set)-enTc\nEast Freaks - Leave It (Original Mix) (Cut From Oakenfold Set)-enTc\nEd Brumwell - Eclipse (Original Mix) (Cut From Eteson Set)-enTc\nEfedry - Colours (Original Mix) (Cut From All Stars Set)-enTc\nElectric Bastards - Intuition (Cut From Graham Set)-enTc\nEmanuele Congeddu &amp; KeyPlayer - Alyssa (Original Mix) (Cut From tranzLift Set)-enTc\nEnyo &amp; Mario Ayuda, Levito - Home (Cut From W&amp;W Set)-enTc\nErick Strong &amp; Hydrogenio - Juggernaut (Cut From Photographer Set)-enTc\nErnesto vs. Bastian - Interface (MaRLo Remix) (Cut From Robbie4Ever Set)-enTc\nEthereal Mist - Strange Life Form (Cut From Solarstone Set)-enTc\nEx-Plosion - Originada (Lewis Dodkins Remix) (Cut From Tasev Set)-enTc\nFabio XB &amp; Liuck feat. Christina Novelli - Back To You (Fabio XB &amp; Yves De Lacroix Remix) (Cut From Feel Set)-enTc\nFeel &amp; Aelyn - If You Feel Love (Roman Messer Remix) (Cut From Feel Set)-enTc\nFeenixpawl &amp; Trevor Simpson - I Won't Break (Will K. Remix] (Cut From Claessen Set)-enTc\nFlame - Another Day In Paradise (Tensile Force Remix) (Cut From Magikgate Set)-enTc\nFlash Sphere - Heavens Horizon (Ico Remix) (Cut From Space Garden Set)-enTc\nFloE - Another Day In Paradise (Andruss Remix) (Cut From Andski Set)-enTc\nFloE - Atlantis (Alternative Mix) (Cut From tranzLift Set)-enTc\nGlynn Alan &amp; Dave Wright - Duality (Set Rip)-enTc\nGlynn Alan - Secrets (2014 Rework) (Set Rip)-enTc\nGR8 Brothers - After The End (Cut From Bjorn Set)-enTc\nGR8 Brothers - After The End (Original Mix) (Cut From tranzLift Set)-enTc\nGreg Wonders &amp; Arnaud S - Ushuaia (Original Mix) (Cut From Tucandeo Set)-enTc\nHector V - Check Your Mind Discover Your Life (Cut From Graham Set)-enTc\nHelena feat. Shawnee Taylor - Levity (Cut From Page Set)-enTc\nHigh Above &amp; Blue Wings - Above The Blue (Original Mix) (Cut From Jerom Set)-enTc\nIan Solano - Dirty Lies (Cut From Andski Set)-enTc\nID - ID (Anna Lee Remix) (Cut From Anna Lee Set)-enTc\nID - ID (Jan Oostdyk Remix) (Cut From Bjorn Set)-enTc\nIra feat. Sarah Russell - Constant Invasions (Sound Freedom Remix) (Cut From Young Free Set)-enTc\nJacob Plant - Louder (Cut From Page Set)-enTc\nJETFIRE &amp; Happy Enemies - International (Cut From W&amp;W Set)-enTc\nJohan Ekman - Rocking (Cut From Menno Set)-enTc\nJohn 00 Fleming - Healing (Cut From J00F Set)-enTc\nJohn Askew - Z List Uber Star (Amir Hussain Remix) (Set Rip)-enTc\nJordi Roure - Kobenhavn (BluSkay Remix) (Cut From Angel Ace Set)-enTc\nJuicy Crew - Along The Street (Ali Wilson TEKELEC Remix) (Cut From Saint-Jules Set)-enTc\nKajis - 60 Million Years (Original Mix) (Cut From Tucandeo Set)-enTc\nKeyPlayer - Electric Sky (Original Mix) (Cut From All Stars Set)-enTc\nLank - Parameters (Cut From Solarstone Set)-enTc\nLas Salinas &amp; Sue McLaren - Break The Spell (Bryan Kearney Remix) (Cut From Sied Set)-enTc\nLush &amp; Simon Feat. XOV - Ctiy Lights (Cut From First State Set)-enTc\nMark Dior - Immension (Original Mix) (Cut From Del Mar Set)-enTc\nMarkson - Give Your Love To Me (Original Mix) (Cut From Eteson Set)-enTc\nMatt Skyer - Reflections Of Love (Cut From Tyas Set)-enTc\nMercer &amp; Bare - Bangla (Cut From W&amp;W Set)-enTc\nMonoverse - Glide (Cut From Palagano Set)-enTc\nMorvan feat. Sopheary - Won't Be Broken (Original Mix) (Cut From Del Mar Set)-enTc\nNeptune Project - Lost All My Tears (The Noble Six Remix) (Cut From A&amp;F Set)-enTc\nNicola Maddaloni - Limbus (Original Mix) (Cut From All Stars Set)-enTc\nPatrick Kay - Summer Sun (Original Mix) (Cut From ReOrder Set)-enTc\nPaul Di White &amp; Alex Blest - Beautiful World (Original Mix) (Cut From All Stars Set)-enTc\nPaul Di White - Night Life (Original Mix) (Cut From ReOrder Set)-enTc\nPaul Miller - I Haven't Forgotten (Cut From Tyas Set)-enTc\nPaul Pele - Your Horizon (Andy Elliass &amp; ARCZI Remix) (Cut From Saux Set)-enTc\nPaul Pele - Your Horizon (Andy Elliass &amp; ARCZI Remix) (Set Rip)-enTc\nPaul Rigel - Glide Above (Cut From A&amp;F Set)-enTc\nPaul van Dyk Feat. Second Sun - Crush (Las Salinas Remix) (Set Rip)-enTc\nPete Silver - Behind The Horizon (Original Mix) (Cut From tranzLift Set)-enTc\nPoshout - Technodrome (Cut From Bjorn Set)-enTc\nPromise Land Feat. Alicia Madison - Sun Shine Down (Flatdisk Remix) (Cut From Eteson Set)-enTc\nProtoculture and Max Graham - AXIOM (Cut From Graham Set)-enTc\nRake feat. Anki - It's Not Easy (Mateusz Remix) (Cut From Suzy Set)-enTc\nRaneem - Katana (Cut From Andski Set)-enTc\nReiklavik - Synergy (Astuni &amp; Manuel Le Saux Re-Lift) (Cut From Saux Set)-enTc\nRishabh joshi - Paramount (Original Mix) (-SHORT- Cut From Tritonal Set)-enTc\nRyan Blair - Tek Drum (Amir Hussain Remix) (Cut From A&amp;F Set)-enTc\nRyan Blair - Tek Drum (Amir Hussain Remix) (Cut From ReOrder Set)-enTc\nS.H.O.K.K - Triple 7 (Ahmed Romel Remix) (Cut From tranzLift Set)-enTc\nSound Quelle &amp; Max Meyer - Volga (Original Mix) (Cut From Eteson Set)-enTc\nSoundprank - Flare (Original Mix) (Cut From Tritonal Set)-enTc\nSpace Raven - This Is Poetry (Original Mix) (Cut From Romel Set)-enTc\nSpace Rockerz &amp; Clybourne - Alive (Original Mix) (Set Rip)-enTc\nSpace Rockerz &amp; Tania Zygar - Puzzle Piece 2014 (Original Mix) (Set Rip)-enTc\nStadiux &amp; Taylr Renee - Howl At The Moon (Frontload Remix) (Cut From Xabi Set)-enTc\nSteve Brian - Brooklyn Bazar (Original Mix) (Cut From Tritonal Set)-enTc\nStyller - Perun (Original Mix) (Cut From Styller Set)-enTc\nStyller - Vesna (Cut From J00F Set)-enTc\nStyller - Vesna (Original Mix) (Cut From Styller Set)-enTc\nSwanky Tunes &amp; Vigel - Get Down (Cut From Bobina Set)-enTc\nSwanky Tunes &amp; Vigel - Get Down (Cut From First State Set)-enTc\nTeam Bastian &amp; Baggi Begovic - Jump (Cut From Ferry Set)-enTc\nThe Chainsmokers - #SELFIE (twoloud Edit) (Cut From Xabi Set)-enTc\nThomas Datt - 1983 (Astuni &amp; Manuel Le Saux Re-Lift) (Cut From Saux Set)-enTc\nTom &amp; Jame &amp; Jaggs - Blazin (Cut From W&amp;W Set)-enTc\nTritonal &amp; Paris Blohm feat. Sterling Fox - Colors (Wellblack Remix) (Cut From Xabi Set)-enTc\nTST &amp; Dani L Mebius - No Regular (-SAMPLE- Cut From W&amp;W Set)-enTc\nTwoB project - Snowy Mountains (Original Mix) (Cut From Anna Lee Set)-enTc\nType 41 - Mythology (Cut From Photographer Set)-enTc\nU2 - Ordinary Love (Paul Oakenfold Remix) (Cut From Oakenfold Set)-enTc\nWasteland feat. Astrid Repepi - City of Angels (Cut From Page Set)-enTc\nWitness45 - Weekend (EDU Remix) (Cut From Bjorn Set)-enTc\nWitness45 - Weekend (EDU Remix) (Cut From Eteson Set)-enTc\nYodis - Runway Clear (Original Mix) (-SHORT- Cut From Feel Set)-enTc\nZedd - Find You feat. Matthew Koma &amp; Miriam Bryant (Syn Cole Remix) (Cut From Eteson Set)-enTc\n","torrent":{"xt":"urn:btih:f1d778d44916cd1b435e59012d7fd62e490c6681","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+April+10th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1d778d44916cd1b435e59012d7fd62e490c6681","infoHashBuffer":{"type":"Buffer","data":[241,215,120,212,73,22,205,27,67,94,89,1,45,127,214,46,73,12,102,129]},"announce":[],"urlList":[]}}