{"title":"Giulio Meotti - A New Shoah: Israel's Victims of Terrorism","uid":6955289,"size":1367846,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f229b026ac2dc176ce60838c784f8eb09b8b0770&amp;dn=Giulio+Meotti+-+A+New+Shoah%3A+Israel%5C%27s+Victims+of+Terrorism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"yamilak45","files":2,"time":1326555892,"description":"A New Shoah: The Untold Story of Israel's Victims of Terrorism\n\nEvery day in Israel, memorials are held for people killed simply because they were Jews--condemned by the fury of Islamic fundamentalism. A New Shoah is the first book devoted to telling the story of these Israeli terror victims. It centers on a previously unheard oral history of the Middle Eastern conflict from the viewpoint of the Jewish victims and their families.\n\nTen years ago, Palestinian terrorist groups launched their Second Intifada, resulting in an Israeli &quot;Ground Zero&quot; with 1,500 civilian victims. Israel is a tiny country, and this number would be proportionally equivalent to about 54,000 terror victims in the United States. The hundreds of attacks in Israel, day after day, amount to a sort of &quot;new Shoah,&quot; as Roger Scruton explains in his foreword. Giulio Meotti spoke to many of the Israeli families that have been destroyed by terror attacks on all the ordinary places of everyday life: on buses, kibbutzim, religious places, cafÃƒÂ©s and restaurants. Many of the survivors told their heartbreaking stories of loss for the first time. In these human fragments lie the raison d'ÃƒÂªtre for the State of Israel, the first country in the world to experience suicide bombings on a massive scale, the fruit of jihadi nihilism.\n\nAuthor: Giulio Meotti\nPublisher: Encounter Books\nPublication Date: October 12, 2010\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f229b026ac2dc176ce60838c784f8eb09b8b0770","amp;dn":"Giulio+Meotti+-+A+New+Shoah%3A+Israel%5C%27s+Victims+of+Terrorism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f229b026ac2dc176ce60838c784f8eb09b8b0770","infoHashBuffer":{"type":"Buffer","data":[242,41,176,38,172,45,193,118,206,96,131,140,120,79,142,176,155,139,7,112]},"announce":[],"urlList":[]}}