{"title":"How to Homeschool by Steven Veach","uid":5371674,"size":549479,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2340e85c82b45b10be1acf30a7ac3b198a0e7db&amp;dn=How+to+Homeschool+by+Steven+Veach&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"why1942","files":1,"time":1266443407,"description":"How to Homechool: A Self-Teaching Approach by Steven Veach \n\nIf you are interested in homeschooling your children, you need to read this first hand account of how a father of 3 pulled his children out of the public school system and educated them on his own.  It presents a different approach to education, one where children are the teachers and parents watch as their children grow and blossom into thriving, creative and critical thinking adults.  It is a must reference for any homeschooling family. \n\nYou can purchase this and other titles by Steven Veach at his online store http://stores.lulu.com/cabinhermit. Please support Steven's work by downloading, seeding and telling all your friends, family and co-workers about his latest books: \n\nTHE PREPARATION  (In Print April 2010)\n\nIt has come time for the Preparation. The beginning of the end is at hand. Seven churches stand at the cusp of the greatest revival known to man in God's last attempt to save humankind from itself. Some will lose their faith. Many will lose everything they have. A few will lose even their very lives. Each must ready his heart for the severity of the task that lay before them in the final battle between good and evil. It is time to prepare for what has yet to come in these last days. They say it is time to pray....\n\nIN THE MEADOW  (In Print August 2010)\n\nDawn McKensie, who is living a dead end existence in Oregon, meets the man of her dreams and is whisked off to Skagit River, Washington where she falls in love with Paul Tanner.  Unfortunately, her new fairytale life is interrupted as she begins to see ghastly images of young girls wherever she goes.  Dawn discovers the girls all have something terrible in common - they were all murdered by the same man and buried near the river.   Her whole world starts to unravel as she discovers her own life is in jeopardy and has to fight for her life and not end up another body in the meadow.  \n\nFollow Steven as he writes: \n  &lt;a href=&quot;\nhttp://www.stevenveach.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.stevenveach.net&lt;/a&gt; \n\n\nEnjoy! ;-)\n\t\t","torrent":{"xt":"urn:btih:f2340e85c82b45b10be1acf30a7ac3b198a0e7db","amp;dn":"How+to+Homeschool+by+Steven+Veach","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2340e85c82b45b10be1acf30a7ac3b198a0e7db","infoHashBuffer":{"type":"Buffer","data":[242,52,14,133,200,43,69,177,11,225,172,243,10,122,195,177,152,160,231,219]},"announce":[],"urlList":[]}}