{"title":"A Poetics for Screenwriters - Lance Lee.pdf","uid":9482776,"size":716666,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2bfeef442b245f1c9c566578d4b43f52c146572&amp;dn=A+Poetics+for+Screenwriters+-+Lance+Lee.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1389829058,"description":"Writing successful screenplays that capture the public imagination and richly reward the screenwriter requires more than simply following the formulas prescribed by the dozens of screenwriting manuals currently in print. Learning the &quot;how-tos&quot; is important, but understanding the dramatic elements that make up a good screenplay is equally crucial for writing a memorable movie. In A Poetics for Screenwriters, veteran writer and teacher Lance Lee offers aspiring and professional screenwriters a thorough overview of all the dramatic elements of screenplays, unbiased toward any particular screenwriting method.\n\nLee explores each aspect of screenwriting in detail. He covers primary plot elements, dramatic reality, storytelling stance and plot types, character, mind in drama, spectacle and other elements, and developing and filming the story. Relevant examples from dozens of American and foreign films, including Rear Window, Blue, Witness, The Usual Suspects, Virgin Spring, Fanny and Alexander, The Godfather, and On the Waterfront, as well as from dramas ranging from the Greek tragedies to the plays of Shakespeare and Ibsen, illustrate all of his points.\n\nThis new overview of the dramatic art provides a highly useful update for all students and professionals who have tried to adapt the principles of Aristotle's Poetics to the needs of modern screenwriting. By explaining &quot;why&quot; good screenplays work, this book is the indispensable companion for all the &quot;how-to&quot; guides.","torrent":{"xt":"urn:btih:f2bfeef442b245f1c9c566578d4b43f52c146572","amp;dn":"A+Poetics+for+Screenwriters+-+Lance+Lee.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2bfeef442b245f1c9c566578d4b43f52c146572","infoHashBuffer":{"type":"Buffer","data":[242,191,238,244,66,178,69,241,201,197,102,87,141,75,67,245,44,20,101,114]},"announce":[],"urlList":[]}}