{"title":"[SoM]Il giro di boa[DvdRip-DivX-Ita-Mp3]","uid":4686103,"size":733736960,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f2da5b534eeeaf327b924baa8b9217eaec697f82&amp;dn=%5BSoM%5DIl+giro+di+boa%5BDvdRip-DivX-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1233238029,"description":"L'inchiesta piÃƒÂ¹ dura del commissario Montalbano comincia con un cadavere galleggiante nel quale il commissario si imbatte nel corso della sua consueta nuotata mattutina. E' il corpo di un uomo in stato di decomposizione avanzata, con polsi e caviglie profondamente incisi. Montalbano giunge alla conclusione che l'uomo ÃƒÂ¨ stato assassinato un paio di mesi prima; le correnti hanno trascinato il corpo sulla spiaggia di Marinella, ma il luogo del delitto non ÃƒÂ¨ quello. Mentre parla con Ciccio Albanese al porto di Vigata, Montalbano assiste allo sbarco di clandestini da una motovedetta appena attraccata al molo. Ne scendono uomini, donne, bambini. Uno di questi ultimi, otto anni circa, appena messo piede sulla banchina cerca di fuggire; sembra impaurito. Montalbano lo raggiunge, lo prende per mano e lo riaccompagna dalla madre, che nella foga di corrergli incontro cade e si sloga una caviglia. \nViene allora chiamata un'autoambulanza; la donna e i suoi bambini vengono accompagnati all'ospedale. Ma il piccolo clandestino non sembra contento di essere riportato dalla madre: attraverso il finestrino dell'autoambulanza, lancia a Montalbano uno sguardo carico di apprensione. Il commissario non riesce a dimenticare quegli occhi carichi di tristezza e di paura. \nMentre al commissariato Catarella riconosce nell'identikit dell'uomo assassinato il volto di un latitante calabrese, tale Ernesto Errera, Montalbano apprende dal telegiornale che il bambino extracomunitario che aveva incontrato al porto di Vigata ÃƒÂ¨ stato investito da un'automobile ed ÃƒÂ¨ morto. Montalbano ÃƒÂ¨ sconvolto, oppresso dai sensi di colpa: vuole sapere cosa ÃƒÂ¨ successo a quel bambino. Aiutato da Fazio, scopre che l'uomo che aveva accompagnato la donna sull'ambulanza e poi al pronto soccorso si chiama Gaetano Marzilla, ed ÃƒÂ¨ proprietario di un negozio che anni prima era stato incendiato perchÃƒÂ© l'uomo non si era piegato al racket del pizzo; in seguito, tuttavia, per rimettere in piedi l'attivitÃƒÂ  era stato costretto a ricorrere agli usurai. \nLe indagini del commissario proseguono con l'obiettivo di collegare gli avvenimenti e gli omicidi accaduti. Montalbano scopre un commercio clandestino di bambini extracomunitari, del quale il piccolo incontrato al porto era stato vittima, con la complicitÃƒÂ  della finta madre. Il commissario scopre che il latitante Errera era stato a capo di questo business finchÃƒÂ© un arabo di nome Gafsa lo aveva ucciso per prenderne il posto.\nLo sdegno che gli suscita la scoperta di quella realtÃƒÂ  cosÃƒÂ¬ orribile e vicina provoca in Montalbano una reazione feroce, che lo porta a rischiare persino la propria vita per riuscire a smantellarla. Con un'ardita e rischiosa incursione nella tana del nemico, Montalbano e i suoi riusciranno ad arrestare i colpevoli e a mettere fine all'infame traffico.\n","torrent":{"xt":"urn:btih:f2da5b534eeeaf327b924baa8b9217eaec697f82","amp;dn":"%5BSoM%5DIl+giro+di+boa%5BDvdRip-DivX-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2da5b534eeeaf327b924baa8b9217eaec697f82","infoHashBuffer":{"type":"Buffer","data":[242,218,91,83,78,238,175,50,123,146,75,170,139,146,23,234,236,105,127,130]},"announce":[],"urlList":[]}}