{"title":"My Year of Running Dangerously - Tom Foreman","uid":12953107,"size":7351161,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f35b39752e852b329f86dcaa86fa9721d3ef0b1a&amp;dn=My+Year+of+Running+Dangerously+-+Tom+Foreman&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1449756069,"description":"CNN correspondent Tom Foreman's remarkable journey from half-hearted couch potato to ultra-marathon runner, with four half-marathons, three marathons, and 2,000 miles of training in between; a poignant and warm-hearted tale of parenting, overcoming the challenges of age, and quiet triumph.\r\n\r\nAs a journalist whose career spans three decades, CNN correspondent Tom Foreman has reported from the heart of war zones, riots, and natural disasters. He has interviewed serial killers and been in the line of fire. But the most terrifying moment of his life didn't occur on the job--it occurred at home, when his 18-year old daughter asked, &quot;How would you feel about running a marathon with me?&quot; \r\n\r\nAt the time, Foreman was approaching 51 years old, and his last marathon was almost 30 years behind him. The race was just sixteen weeks away, but Foreman reluctantly agreed. Training with his daughter, who had just started college, would be a great bonding experience, albeit a long and painful one. \r\n\r\nMy Year of Running Dangerously is Foreman's journey through four half-marathons, three marathons, and one 55-mile race. What started as an innocent request from his daughter quickly turned into a rekindled passion for long-distance running--for the training, the camaraderie, the defeats, and the victories. Told with honesty and humor, Foreman's account captures the universal fears of aging and failure alongside the hard-won moments of triumph, tenacity, and going further than you ever thought possible","torrent":{"xt":"urn:btih:f35b39752e852b329f86dcaa86fa9721d3ef0b1a","amp;dn":"My+Year+of+Running+Dangerously+-+Tom+Foreman","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f35b39752e852b329f86dcaa86fa9721d3ef0b1a","infoHashBuffer":{"type":"Buffer","data":[243,91,57,117,46,133,43,50,159,134,220,170,134,250,151,33,211,239,11,26]},"announce":[],"urlList":[]}}