{"title":"Naruto Episode 6 (480p)","uid":10732827,"size":40953017,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f41cad41d6045135e0ea6c65d8f49463302b1c33&amp;dn=Naruto+Episode+6+%28480p%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shareregi","files":2,"time":1407646555,"description":"After Team 7 completes a few miscellaneous D-ranked missions, Naruto relentlessly asking Hiruzen for a higher level mission, they are assigned to escort a bridge builder named Tazuna back to the Land of Waves. But on their way, Team 7 is ambushed by the Demon Brothers, two chunin from the Hidden Mist Village in the Land of Water. Though it appeared they killed him as they go after Team 7 and Tazuna, the Demon Brothers learned that Kakashi was aware of their presence and faked his death to catch them off guard while seeing his students in action. While applauding Sasuke for holding off the Demon Brothers and Sakura for guarding Tazuna, Kakashi expresses disappointment in how Naruto poorly handled the situation and got himself poisoned. But refusing to quit the mission, with Sasuke's taunting getting to him, Naruto uses a kunai to stabs his hand to bleed out the poison while making a promise to never back down. Though Kakashi decides to have Naruto's self-inflicted wound dealt with, he is amazed by the boy's rapid healing while wondering if it is the Nine Tails's doing. Elsewhere, a man named Gato confronts Demon Brothers' boss for his subordinates' failure to assassinate Tazuna. Threatening Gato with his large sword, the figure decides to handle the job personally. ","torrent":{"xt":"urn:btih:f41cad41d6045135e0ea6c65d8f49463302b1c33","amp;dn":"Naruto+Episode+6+%28480p%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f41cad41d6045135e0ea6c65d8f49463302b1c33","infoHashBuffer":{"type":"Buffer","data":[244,28,173,65,214,4,81,53,224,234,108,101,216,244,148,99,48,43,28,51]},"announce":[],"urlList":[]}}