{"title":"Culture and Cognition: Implications for Theory and Method","uid":7316243,"size":3709853,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f4a8fdabf10a8db1d72561f3283ca7c501a60525&amp;dn=Culture+and+Cognition%3A+Implications+for+Theory+and+Method&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"nickmarsh","files":-1,"time":1338491530,"description":"Culture plays an important role in our everyday lives, yet the study of cultural processes and their impact on thinking and behavior is still in its infancy. Research in anthropology generally lacks the clarity and specificity of cognitive processes and is therefore usually ignored by most psychologists. On the other hand, most cognitive research in psychology either ignores culture as an important factor to be taken into account or treats culture as yet another independent variable.\n\nRecent trends indicate an increasing interest in &quot;culture&quot; as a topic of psychological inquiry. Culture and Cognition: Implications for Theory and Methods combines the study of culture with an understanding of relevant cognitive processes and the challenge of studying high-level cognition as embedded into culture. Author Norbert Ross engages both anthropology and psychology, with the belief that any successful research in culture and cognition must embrace insights from both fields.\n","torrent":{"xt":"urn:btih:f4a8fdabf10a8db1d72561f3283ca7c501a60525","amp;dn":"Culture+and+Cognition%3A+Implications+for+Theory+and+Method","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4a8fdabf10a8db1d72561f3283ca7c501a60525","infoHashBuffer":{"type":"Buffer","data":[244,168,253,171,241,10,141,177,215,37,97,243,40,60,167,197,1,166,5,37]},"announce":[],"urlList":[]}}