{"title":"EnigmaT Set Rips { Cuts } - March 12th, 2014","uid":9747987,"size":1204100119,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f51ce954a102dffb23963450ed73136559224bac&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+March+12th%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":123,"time":1394615815,"description":"A.L.A.M.I - Lucky Way (Aicos Remix) (Cut From Sty Set)-enTc\nAd Brown - Template Essesntials 3 (Cut From Magikgate Set)-enTc\nAdam Seller - K1 (Original Mix) (Cut From Seller Set)-enTc\nAeden - In The Universe (Cut From Spy Set)-enTc\nAicos - Red Moon (Hypaethrame Remix) (Cut From Del Mar Set)-enTc\nAicos - Red Moon (OBM Notion Remix) (Cut From Burrows Set)-enTc\nAizen - Addicted (Original Mix) (Cut From Burrows Set)-enTc\nAkihiro Ohtani - Biotope (D05 Remix) (Cut From EDU Set)-enTc\nAlistair Albrecht &amp; Steven Cole Feat. Matt Heanes - Reaching The Headlights (Bellatrax Dub Mix) (Cut From Shah Set)-enTc\nAly &amp; Fila - City Of Angels (ReOrder &amp; Ian Standerwick pres. Skypatrol Remix) (Set Rip)-enTc\nAly &amp; Fila - Tula (A &amp; Z Remix) (Cut From A&amp;F Set)-enTc\nAmersy - New Era (Original Mix) (Cut From D&amp;E Set)-enTc\nAndrew Lang - The Sands Of Time (Original Mix) (Cut From EDU Set)-enTc\nAnother World Feat. Stephanie Kay - The Last Call (Ahmed Romel Remix) (Cut From OzzyXPM Set)-enTc\nAraya &amp; Mark Dreamer - Salthar (Original Mix) (Cut From Del Mar Set)-enTc\nArmando Biz - Hello I'm William Wind (Original Mix) (Cut From Palmaxs Set)-enTc\nAudile - Shine (Nick Rockwood &amp; Pitch Remix) (Cut From Xijaro Set)-enTc\nAwake featuring Carly Dickenson - Zoe (Fery Jasefoss Instrumental Remix) (Cut From Defcon Set)-enTc\nAxwell &amp; Dirty South feat. Rudy - Open Your Heart (Ivan Gough &amp; Jebu Vicious21 Remix) (Cut From D&amp;E Set)-enTc\nBeckwith - Clarion (Cut From EDU Set)-enTc\nBluEye - Rainbow (Vince Aoun Spring Mix) (Cut From Pledger Set)-enTc\nBluSkay &amp; KeyPlayer - Cassiopeia (Renato Dinis Remix) (Cut From Tangle Set)-enTc\nBluSkay - Lost Words (Original Mix) (Cut From Sty Set)-enTc\nBluSkay - Return To The Classic (Ronny K Remix) (Cut From A&amp;F Set)-enTc\nBluskay - The Calling (Original Mix) (Cut From Del Mar Set)-enTc\nBorgore &amp; Sikdope - Unicorn Zombie Apocalypse (Cut From W&amp;W Set)-enTc\nBrandon Flowers - Crossfire (ID Remix) (Cut From Cosmic Gate Set)-enTc\nChris Avantgarde feat. Joel Edwards - Rise Up (Original Mix) (Cut From D&amp;E Set)-enTc\nCiro Visone - Back To Shoot (Cut From Defcon Set)-enTc\nClay C - Illusion (Ikerya Project Remix) (Cut From OzzyXPM Set)-enTc\nColdplay - Midnight (JPL Edit) (Cut From Config Set)-enTc\nColdplay - Midnight (Maor Levi, Norin &amp; Rad &amp; Kevin Wild Remix) (Cut From W&amp;W Set)-enTc\nColdplay - Midnight (Victor Dinaire &amp; Bissen Remix) (Set Rip)-enTc\nCon Philips - Bogota (Steve Morley Remix) (Cut From Lazarus Set)-enTc\nCorbossy - Going Home (Original Mix) (Cut From Gomrass Set)-enTc\nDan Chase feat. Laura Aqui - Little Pieces (Original Mix) (Cut From Del Mar Set)-enTc\nDark Matters - The Quest Of A Dream (D&amp;K Remix) (Cut From Criado Set)-enTc\nDavid Vrong - Anima (Original Mix) (Cut From W&amp;W Set)-enTc\nDB Boulevard - Point Of View (Arthur Galestian 'New Perspective' Bootleg) (Cut From Jordy Set)-enTc\nDigital Affliction - Valkyrie (Witness45 Remix) (Cut From ReOrder Set)-enTc\nDJ Geri Feat. Veela - Costa Daurada (Lirrik Remix) (Cut From Pledger Set)-enTc\nDuher - Rattle'N'Roll (Original Mix) (Cut From D&amp;E Set)-enTc\nEddie Lung - In The Rain (Original Mix) (Cut From Angel Set)-enTc\nEddie Lung - In The Rain (Original Mix) (Cut From Sty Set)-enTc\nEvave - Personal Sky (Zuubi Remix) (Cut From EDU Set)-enTc\nEx-Driver &amp; Satelite - Flashback (Original Mix) (Cut From Del Mar Set)-enTc\nExarum - Shine (Original Mix) (Cut From D&amp;E Set)-enTc\nFoo Fighters - Best Of You (Der Wanderer Remix) (Cut From Shah Set)-enTc\nFrank Datillo - Heart Scream (Cut From Silver Set)-enTc\nGabriel &amp; Dresden feat. Molly Bancroft - Tracking Treasure Down (Somna Bootleg) (Cut From Beat Service Set)-enTc\nGareth Emery feat. Krewella - Lights &amp; Thunder (Club Mix) (Cut From W&amp;W Set)-enTc\nHazem Beltagui - Lost Again (Mohamed Ragab Remix) (Cut From A&amp;F Set)-enTc\nHazem Beltagui feat. Rebecca Louise Burch - Lost Again (Mohamed Ragab Remix) (Cut From Del Mar Set)-enTc\nHristian Hristov - Purity (Original Mix) (Cut From Angel Set)-enTc\nHughes &amp; Ballantine vs. Con Phillips - Solus (Original Mix) (Cut From TranceEye Set)-enTc\nilan Bluestone - Elysian (Set Rip)-enTc\nInsert Name - Tektonic (Cut From J00F Set)-enTc\nIversoon &amp; Alex Daf - Broken Age (Cloudwalker Epic Remix) (Cut From Burrows Set)-enTc\nJames Kelly - My Boy (Cut From A&amp;F Set)-enTc\nJim Cerrano - Air Guitar (Original Mix) (Cut From Oakenfold Set)-enTc\nJoe Gaston - Bogus Journey (Cut From W&amp;W Set)-enTc\nJohn Dopping - Words In Colour (Cut From Brandt Set)-enTc\nJohnny Yono &amp; Carol Lee - We Will Live (Cut From Beat Service Set)-enTc\nJoonas Hahmo - Boeing (Cut From W&amp;W Set)-enTc\nJuan Sando - Chronosphere (CJ Art's Unexpected Acid-on-135 Remix) (Cut From Katadunkass Set)-enTc\nKalden Bess - Unstopable (Cut From J00F Set)-enTc\nKill FM vs The Police - Connect In A Bottle (Cut From Juventa Set)-enTc\nKris Maydak &amp; Aneym - Cross The Line (Denis Sender Remix) (Cut From Beat Service Set)-enTc\nKult Of Krameria - Coming Over (Jaimy Remix) (Cut From Katadunkass Set)-enTc\nLekSin - A Way Between Two Worlds (Eddie Lung Remix) (Cut From Silver Set)-enTc\nLekSin - A Way Between Two Worlds (Eddie Lung Remix) (Cut From Sty Set)-enTc\nLence &amp; Pluton - Faster Than Light (Original Mix) (Cut From Burrows Set)-enTc\nLiam Wilson &amp; Phil Taylor - Tressilate (Cut From Angry Set)-enTc\nLiam Wilson &amp; Phil Taylor - Tressilate (Sebastian Brandt Remix) (Cut From Brandt Set)-enTc\nLiquid Soul - Plasma (Cut From Brandt Set)-enTc\nLiquid Vision - Flare (Cut From Defcon Set)-enTc\nLucia - Silence (Pingpong Tanzt Mix) (Cut From Shah Set)-enTc\nLuke Terry feat. Silksin - I Will Rise (Original Mix) (Cut From Del Mar Set)-enTc\nMagnessi Askari feat. Aundrea - Feel The Sound (Original Mix) (Cut From D&amp;E Set)-enTc\nMarco Petralia &amp; Rubin feat. Ilan Green - Coming Home (Stereojackers vs. Mark Loverush Extended Remix) (Cut From Del Mar Set)-enTc\nMark Hyde - I'm Afraid Of 138 (Original Mix) (Cut From Jordy Set)-enTc\nMenno De Jong feat. Noire Lee - Creatures Of The Night (Somna Remix) (Cut From Somna Set)-enTc\nMerzo - Quartz (Cut From W&amp;W Set)-enTc\nMixail - Among Stars (Cut From Pledger Set)-enTc\nMixail and Zarex - Extraction (Cut From Beat Service Set)-enTc\nNew World - Hello Grasshopper (Club Hopping Mix) (Cut From Defcon Set)-enTc\nNico Schinco &amp; Alex H - The Draft (Original Mix) (Cut From EDU Set)-enTc\nO.B.M Notion - Walking In The Air (Original Mix) (Cut From Sty Set)-enTc\nOceanic - Skylift (Veselin Tasev Remix) (Cut From Tasev Set)-enTc\nOdonbat &amp; Luuya - Red Knight (Cut From Silver Set)-enTc\nOrgan Donors - Zombie Apocalypse (Cut From Pledger Set)-enTc\nOrjan Nilsen &amp; Cosmic Gate - ID (Set Rip)-enTc\nOrla Feeney &amp; Deirdre McLaughlin - This Moment (Set Rip)-enTc\nOrla Feeney - Comic Stripped 2014 (Set Rip)-enTc\nOrla Feeney - Lilyhammer (Set Rip)-enTc\nPaul Legvand and M Pravda feat Lokka - ID (Cut From M Pravada Set)-enTc\nPaul Oakenfold - Energy 52 (Cafe Del Mar) (ID Remix) (Set Rip)-enTc\nPedro Delgardo - Metropolis (Spiros Kaloumenos Remix) (Cut From Sherry Set)-enTc\nPete Silver Pres. Silverian - ID (Cut From Silver Set)-enTc\nRene Ablaze &amp; Jack Noise - The Moon (Artra &amp; Holland Remix) (Cut From Silver Set)-enTc\nReOrder feat. Stine Grove - Biscay Bay (Afternova Remix) (Cut From ReOrder Set)-enTc\nSander van Doorn - Right Here Right Now (Ummet Ozcan Vocal Mix) (Cut From Claessen Set)-enTc\nShowtek - We Like To Party (Twoloud Remix) (-Short- Cut From Oakenfold Set)-enTc\nSneijder &amp; Bryan Kearney - Next Level (Cut From A&amp;F Set)-enTc\nSonny Zamolo - Lion (Pete K Remix) (Cut From Config Set)-enTc\nStereotronique - London (Cut From Claessen Set)-enTc\nStereotronique - London (Original Mix) (Cut From D&amp;E Set)-enTc\nSunlounger Feat. Chase - Surrender (Brian Laruso Touching Soul Remix) (Cut From Shah Set)-enTc\nSunset - Seamless (Cut From A&amp;F Set)-enTc\nThe Cosmic Doors - Tribute To A Dream (Original Mix) (Cut From TranceEye Set)-enTc\nThe Digital Blonde - Wendigo (Cut From J00F Set)-enTc\nThe Neighbourhood - Sweater Weather (Moska Bootleg) (Cut From D&amp;E Set)-enTc\nThe Realm - This Is Not A Breakdown (David Forbes Remix) (Cut From Pledger Set)-enTc\nTiesto - Traffic (Fher Vizzuett Rework) (Cut From Spy Set)-enTc\nToe - Ships (Stefan Biniak Private Edit) (Cut From Shah Set)-enTc\nTom Cloud - Moments (Cut From Pledger Set)-enTc\nTonny Nesse &amp; Michael Maurice - RUSH (Original Mix) (Cut From OzzyXPM Set)-enTc\nTransport - From Here To Eternity (Ico Remix) (Cut From Sty Set)-enTc\nTripy - Contact (Cut From J00F Set)-enTc\nUmber - The Day We Left For Earth (Need A Name Remix) (Cut From Lazarus Set)-enTc\nVan Nilson meets Marcel Rosman - Free (New Epic) (TrancEye Remix) (Cut From Burrows Set)-enTc\nVersum - Pusher (Original Mix) (Cut From Katadunkass Set)-enTc\nYves V &amp; Freddy See - Karma (Cut From W&amp;W Set)-enTc\n","torrent":{"xt":"urn:btih:f51ce954a102dffb23963450ed73136559224bac","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+March+12th%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f51ce954a102dffb23963450ed73136559224bac","infoHashBuffer":{"type":"Buffer","data":[245,28,233,84,161,2,223,251,35,150,52,80,237,115,19,101,89,34,75,172]},"announce":[],"urlList":[]}}