{"title":"Antarctic Press's How to Draw Series","uid":7816726,"size":249398909,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f5b6e85df530094d984e0de75482166af9d3cfe8&amp;dn=Antarctic+Press%27s+How+to+Draw+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackcanary","files":-1,"time":1352680294,"description":"English | CBR | 6 Issues\n\nAntarctic Press's How to Draw Series\nPublisher:  Antarctic Press\n\nHow To Draw Ninjas &amp; Samurai\nGot a yen to create an action thriller surrounding your favorite armored fighters or black-clad spies, but you're stuck 'cause you don't know a kunai from a katana or whether to make your warrior wield a wakizashi? Then this is the book for you! Learn all about the costumes, weapons and accessories of samurai and ninja, from the traditional period drama types to the more modern versions seen in shows like Samurai 7 and Naruto! \n\nHow to Draw Pirates\nAvast, ye scurvy scribes! There be a new addition to Antarctic Press's best-selling how-to series spotted off the port bow! Antarctic Press's long-running and series of highly varied how-to art instructional guides adds to its arsenal of fun and useful lessons with How to Draw Pirates! This treasure chest of precious instructions will give artists their sea legs in no time for drawing swashbucklers, swabs, buccaneers, privateers, and even a pirate or two! Learn all the elements of the classic and modern pirate styles for the manly men AND comely lasses of the sea, from Treasure Island to Pirates of the Caribbean, from Sinbad to One Piece! \n\nHow To Draw Superpowered Heroes\nBitten by the radioactive drawing bug, giving you the insatiable desire to draw superpowered heroes? Terrified of tackling the task because you lack the mutant 'artist gene'? Fear not, citizen! Ben Dunn is here to save the day! You'll pick up the basics of sketching super do-gooders faster than a speeding bullet, and once you learn the lessons within these pages, you'll be the best there is at what you do! With great artistic power comes great artistic responsibility, so it's our responsibility to show you how it's done!\n\nHow To Draw Vampires\nAre you wracked by forbidden desire? Do you pine away out of love for the dark children of the night, ever yearning to capture their essence but denied by lack of proper knowledge? Fear not, intrepid one, for salvation is at hand! This essential instruction manual will tell you all you need to know to bring life to your depictions of the undead, from the creepiest nosferatu to the spookiest horror-film classics to the sparkliest of ravishing romancers. They may not reflect in a mirror, but Antarctic Press will show you how to capture them on paper!\n\nHow to Draw (and Fight) Zombies\nWhen the dead walk the Earth, will you survive? Not unless you have this essential zombie guide and How To Draw handbook! Not only will you learn how to draw all types of zombies, you'll get skills and tips on how to defeat them and survive the Apocalypse! Don't let your artistic talents go to waste just 'cause the world has ended - this essential guide is here to help! So get up, arm yourself to the teeth, and start drawing! Oh, and don't forget the flamethrower.\n\nYou Can Draw Monsters\n140 pages! This book will teach you all you need to know about drawing ghoulies, ghosties, long-legged beasties, and boogums.","torrent":{"xt":"urn:btih:f5b6e85df530094d984e0de75482166af9d3cfe8","amp;dn":"Antarctic+Press%27s+How+to+Draw+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5b6e85df530094d984e0de75482166af9d3cfe8","infoHashBuffer":{"type":"Buffer","data":[245,182,232,93,245,48,9,77,152,78,13,231,84,130,22,106,249,211,207,232]},"announce":[],"urlList":[]}}