{"title":"The Snowman","uid":6052122,"size":2927265465,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f67910e221423c62de77f776559945df896848ec&amp;dn=The+Snowman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ADHDerby","files":-1,"time":1292776003,"description":"The Snowman is a children's book by English author Raymond Briggs, published in 1978. In 1982, this book was turned into a 26-minute animated movie by Dianne Jackson for the fledgling Channel 4. It was first shown on Channel 4 late on Christmas Eve in 1982 and was an immediate success. The film was nominated for the Academy Award for Animated Short Film in 1982. It has been shown every year since and has become a part of British and international Christmas popular culture.\n\nThe book is wordless, as is the film except for the song &quot;Walking in the Air&quot;. The story is told through picture, action and music. The cartoon version was scored by Howard Blake who wrote both music and lyrics of the song and also composed and conducted the complete orchestral score for the film with his own orchestra, the Sinfonia of London. The film's one song, &quot;Walking in the Air&quot;, was written specially for it and performed by a St Paul's Cathedral choirboy, Peter Auty.\n\n\nProduct Description:\n\nWordless (excluding the song &quot;Walking in the Air&quot;) animated adventure about a young English boy who makes a snowman one Christmas Eve, only for it to come to life that night and take him on a magical adventure to the North Pole to meet Santa Claus.\n\nThis version has no menu, just the main movie introduced by David Bowie and the sketch version of the movie (both ripped from different versions).\n\n\nIf you love the song like me, then have a look at this torrent:\n\nWalking in the Air [the original + 50 covers] - http://thepiratebay.se/torrent/5228538\n\nThis collection contains the original song, performed by Peter Auty, and 50 covers in a very wide range of styles.\n\n\nMerry Christmas!\n\nADHDerby","torrent":{"xt":"urn:btih:f67910e221423c62de77f776559945df896848ec","amp;dn":"The+Snowman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f67910e221423c62de77f776559945df896848ec","infoHashBuffer":{"type":"Buffer","data":[246,121,16,226,33,66,60,98,222,119,247,118,85,153,69,223,137,104,72,236]},"announce":[],"urlList":[]}}