{"title":"Solo Avengers &amp; Avengers Spotlight","uid":4350748,"size":394986487,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f75cfb0d16f4bccd5fb2f5a54ae9f901796da1d5&amp;dn=Solo+Avengers+%26+Avengers+Spotlight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Rishab","files":41,"time":1219138168,"description":"Solo Avengers, later Avengers Spotlight, was an American comic book, published by Marvel Comics. \n\nA spin-off from the company&amp;#039;s popular team title Avengers, it began life in December 1987 under the title Solo Avengers. It changed title to Avengers Spotlight in August 1989, with issue 21. It was cancelled in January 1991 with issue 40. \n\nThe format of the title was usually two stories, one featuring the character Hawkeye (a sarcastic archer who had been first introduced to the Avengers title in 1964) and a back-up strip showcasing current or former Avengers who didn&amp;#039;t have their own title. Some issues featured one long story, and others dropped Hawkeye altogether. \n\nSolo Avengers was part of a then-current trend at Marvel to expand its various &quot;franchises&quot; such as Spider-Man and the X-Men into as many as a dozen titles, and the name change to Avengers Spotlight (together with the concurrent renaming of West Coast Avengers to Avengers West Coast), with a logo based heavily on that of the parent title was an attempt to force retailers, who usually sorted their comics in alphabetical order, to rack them beside the parent title in an attempt to increase sales. \n\nEnjoy and Seed. ","torrent":{"xt":"urn:btih:f75cfb0d16f4bccd5fb2f5a54ae9f901796da1d5","amp;dn":"Solo+Avengers+%26+Avengers+Spotlight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f75cfb0d16f4bccd5fb2f5a54ae9f901796da1d5","infoHashBuffer":{"type":"Buffer","data":[247,92,251,13,22,244,188,205,95,178,245,165,74,233,249,1,121,109,161,213]},"announce":[],"urlList":[]}}