{"title":"The Freaks Shall Inherit the Earth: Entrepreneurship for Weirdos","uid":12381466,"size":762253,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f820b952563cfd714552784900f176b1ee3e2544&amp;dn=The+Freaks+Shall+Inherit+the+Earth%3A+Entrepreneurship+for+Weirdos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":1,"time":1441766383,"description":"The Freaks Shall Inherit the Earth: Entrepreneurship for Weirdos, Misfits, and World Dominators by Chris Brogan\n\nOverview: Do you ever wonder where you fit in? Do you sometimes get that feeling that you have something much bigger to offer the universe, but then it fills you with fear and anxiety, so you think maybe I ll just pay it safe? But what is safe? The factory job? The cubicle job? Factories all over have been converted to open spaces for startups. Skyscrapers have entire floors open for lease because the same as everyone else class of jobs have dried up. Many of us were raised to seek out a job that required us to fit in, to conform, to adapt until we fit the mold. The Freaks Shall Inherit The Earth is a guide for the kind of person who wouldn t normally pick up a business book. The personal business revolution is upon us. Here s your recipe book for starting your revolutionary business, including some of what you will learn: * How to be as weird as you want while providing a viable business structure to support it * What most people are missing from the basic frameworks of doing business * How to turn passions into businesses * How to build out the Digital Channel * What Kickstarter and Square mean for the future of business)","torrent":{"xt":"urn:btih:f820b952563cfd714552784900f176b1ee3e2544","amp;dn":"The+Freaks+Shall+Inherit+the+Earth%3A+Entrepreneurship+for+Weirdos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f820b952563cfd714552784900f176b1ee3e2544","infoHashBuffer":{"type":"Buffer","data":[248,32,185,82,86,60,253,113,69,82,120,73,0,241,118,177,238,62,37,68]},"announce":[],"urlList":[]}}