{"title":"Sumangala Damodaran - Songs of Protest (2010)","uid":7226905,"size":122142564,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f89b61f82ce8c19a88d5375e6b9d118c6a8cd7b3&amp;dn=Sumangala+Damodaran+-+Songs+of+Protest+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hercu1984","files":12,"time":1335708324,"description":"Songs of Protest\nby Sumangala Damodaran\n\n&quot;A forgotten tradition from the 1940s and 50s&quot;\n\n'Songs of Protest' presents resistance songs in four languages (Hindustani, Malayalam, Bangla, Punjabi) from the 1940 and 1950s, from the Indian People's Theatre\nAssociation and other organisations. Sumangala Damodaran presents a glimpse of the marvellous musical and thematic diversity of this tradition.\n\nTrack Information:\n\n1. Jaane Waale Sipahi Se Poochho\nHindustani, written and composed by Makhdoom Mohiuddin. An evocative World War II song on the meaninglessness of war.\n\n2. Pachhapananthathe\nMalayalam, written by Ponkunnam Damodaran, composed by Baburaj. A love song to a green parakeet by a young peasant girl in Kerala.\n\n3. Aar Koto Kaal\nBangla, written by Benoy Roy. A song from the Tebhaga movement in Bengal in 1946, when peasants rose up against oppressive landlords.\n\n4. Din Khoon Ke Hamaare\nHindustani, anonymous. In memory of the hundreds gunned down at Jallianwala Bagh in Amritsar during the freedom struggle.\n\n5. Kinu Phol Dassan Dukh Dard Saiyon\nPunjabi, written by Sheila Bhatia. Ballad in the 'Heer' style tells the story of a poor Bengali peasant girl whose home and family have been wiped out in the Bengal famine.\n\n6. Suno Suno\nFirst part written by Benoy Roy when the Bengal Famine killed millions of people in Bengal, second part in the same tune by Prem Dhawan during India's Partition.\n\n7. Balikudeerangale\nMalayalam, written by Vayalar Rama Varma, composed by G. Devarajan. A 1950s song commemorating those who gave their lives in the Mutiny of 1857, India's first war\nof independence.\n\n8. Phiraiya De De\nBangla, written by Benoy Roy. Commemorates and laments the hangingn, by the British, of four peasant leaders in far-away Kayyur in Northern Kerala in 1943.\n\n9. Jhoom Jhoom Ke\nHindustani, written and composed by Prem Dhawan. A vibrant song of celebration written on 15 August 1947, the day India attained freedom.\n\nProduced by Susmit Sen\n\nSound Engineer: Leo Antony\n\nMusicians:\nSusmit Sen - Guitars\nTapan Mullick - Cello, double bass\nDeepak Castelino - Acoustic guitar for Song 2\nPritam Ghosal - Sarod\nChander Sekhar - Mridangam\nA. Muralikrishnan - Ghatam\nAbhishek Mangla - Bass guitar\nLeo Antony - Keyboards and sequencing for Song 6, drums sequencing for Song 5\nAnindo Bose - Drums sequencing for Songs 1 and 8\nGyan Singh - Tabla, jembe and other percussion including kitchen utensnils for Songs 3, 8 and 9\nBackup vocals - Sudhir Rikhari and Harpreet Singh\n\nEngineered at Studio Epiphany, A-112, Basement, Shivalik, New Delhi.\n\nThanks to Madan Gopal Singh for helping develop song 5 in the traditional Heer styles.\n\nCover and booklet design credits: Ashima Yadav, Sudhanva Deshpande, Susmit Sen. (Booklet not included in the upload)\nPhoto: Mimi Chakrabarti\n\nSupported by a grant from the National School of Drama, New Delhi.\n\nAudio CD Rip - CBR 320 kbps, Stereo.","torrent":{"xt":"urn:btih:f89b61f82ce8c19a88d5375e6b9d118c6a8cd7b3","amp;dn":"Sumangala+Damodaran+-+Songs+of+Protest+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f89b61f82ce8c19a88d5375e6b9d118c6a8cd7b3","infoHashBuffer":{"type":"Buffer","data":[248,155,97,248,44,232,193,154,136,213,55,94,107,157,17,140,106,140,215,179]},"announce":[],"urlList":[]}}