{"title":"Cisco Press CCNP Video Mentor","uid":4382482,"size":1923686400,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:f89f2497fbb373775ae2759f4ac325d2325ad5bc&amp;dn=Cisco+Press+CCNP+Video+Mentor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shemyaza","files":1,"time":1220730393,"description":"Cisco Press CCNP Video Mentor\n\nPrepare for all four CCNP Exams with more than 5 hours of personal, visual instruction on CCNP configuration tasks\n\n    * Presents over 5 hours of video mentoring\n    * Covers all four new CCNP exams in one package\n    * Teaches configuration concepts for the practical portion of the CCNP exams\n    * Provides multimedia tutorials that provide insider tips and tricks\n\nCCNP Video Mentor is a DVD-ROM software product. The enclosed DVD contain a series of succinct instructional videos that demonstrate how to accomplish various CCNP-level configuration tasks on Cisco routers and switches. The 16 videos contained in this product total over 5 hours of instruction. In each individual 10-15 minute video, senior instructor Kevin Wallace walks you through basic configuration tasks. The videos consist of audio instruction, animations, and router and switch CLI video screen-casts. Each video lab presents suggested reading lists, detailed objectives, lab diagrams, command tables, and video captures. Audio instruction throughout offers tips and shortcuts that truly make learning easy. Animated network diagrams show you lab setup, device addressing, and how traffic flows through the network. Video screen-casts of the router and switch CLI demonstrate command entry, configuration techniques, and device response. For several years now, Cisco has included simulation-based assessment into its CCNP exams. These simulation questions require you to perform basic configuration tasks, adding another level of complexity to the certification process. CCNP Video Mentor helps you be better prepared for this aspect of the exam.\n\nBSCI Lab 1 Configuring EIGRP\nBSCI Lab 2 Configuring OSPF for Multiple Areas and Frame Relay Nonbroadcast\nBSCI Lab 3 Configuring Multihome BGP\nBSCI Lab 4 Configuring Multicast\n\nBCMSN Lab 1 Configuring VLANs and VTP\nBCMSN Lab 2 Routing Between VLANs\nBCMSN Lab 3 Enabling and Optimizing HSRP\nBCMSN Lab 4 Configuring IP Telephony Support\n\nISCW Lab 1 Configuring Frame Mode MPLS\nISCW Lab 2 Configuring a Site-to-Site VPN\nISCW Lab 3 Securing Cisco Routers\nISCW Lab 4 Configuring an IOS Firewall\n\nONT Lab 1 Placing and Examining VoIP Calls\nONT Lab 2 Configuring CB-WFQ and LLQ Queuing Mechanisms\nONT Lab 3 Configuring Class-Based Header Compression\nONT Lab 4 Configuring LFI ","torrent":{"xt":"urn:btih:f89f2497fbb373775ae2759f4ac325d2325ad5bc","amp;dn":"Cisco+Press+CCNP+Video+Mentor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f89f2497fbb373775ae2759f4ac325d2325ad5bc","infoHashBuffer":{"type":"Buffer","data":[248,159,36,151,251,179,115,119,90,226,117,159,74,195,37,210,50,90,213,188]},"announce":[],"urlList":[]}}