{"title":"The Sookie Stackhouse Companion - Charlaine Harris.epub","uid":8871443,"size":866978,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f935e1ec45fd8a124024fb1f49c6570147bde03e&amp;dn=The+Sookie+Stackhouse+Companion+-+Charlaine+Harris.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1378075264,"description":"Charlaine Harris has topped the bestseller charts and become a nationwide phenomenon, thanks to the unconventional, and otherworldly, life of Sookie Stackhouse. Now take a closer look at Sookie and her family, friends, enemies, adventures, and-of course-the lovers who set her world on fire...\n\nVisit Bon Temps, the small Louisiana town that Sookie calls home, with a detailed map created by Charlaine herself, and learn the characteristics of the supernaturals who live there: vampires, two- natured, and fae. Examine all the branches of Sookie's family tree. And eavesdrop on the private conversations between rival vampires Eric and Bill.\n\nAlso, enjoy the compelling, never-before-published novella &quot;Small- Town Wedding,&quot; in which Sookie accompanies her shape-shifting boss, Sam, to his brother's wedding in Texas, where happily-ever-after seems very far away....\n\nExclusive interviews with True Blood creator Alan Ball and author Charlaine Harris-complied from fan questions-will satisfy your craving for all things Sookie, as will trivia questions, recipes (including Caroline Bellefluer's famous chocolate cake!), and a concordance to the Sookie Stackhouse novels.","torrent":{"xt":"urn:btih:f935e1ec45fd8a124024fb1f49c6570147bde03e","amp;dn":"The+Sookie+Stackhouse+Companion+-+Charlaine+Harris.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f935e1ec45fd8a124024fb1f49c6570147bde03e","infoHashBuffer":{"type":"Buffer","data":[249,53,225,236,69,253,138,18,64,36,251,31,73,198,87,1,71,189,224,62]},"announce":[],"urlList":[]}}