{"title":"Young Pretty And Nasty Jeune [Selection Dorcel] 2016","uid":14220823,"size":1302664671,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f9941588b0114c187a406379323e8d096c73aaf0&amp;dn=Young+Pretty+And+Nasty+Jeune+%5BSelection+Dorcel%5D+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":1,"time":1460040374,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=8926138240\r\n \nhttp://imagedisco.net/?g=3299286217\r\n\r\n\r\n\r\nPLOT:\r\n\r\nThese 3 young sluts have very different ways to reach cloud nine. oday, they'll show you how they do it. Every means to reach climax is good, event more if their husbands are ok with them fucking other men ... as long as they can watch. In a swingers sauna, Lusy fucks another man while her husband watches and gets off doing it. Lula, was just elected Miss Libertine Belgium and to celebrate, she takes on three dicks. Laure and her boyfriend love to go to sex shops when she can undress and fuck other customers. Ces trois jeunes salopes ont toutes une facon bien particuliere de prendre leur pied. Et aujourd'hui, elles vont vous la devoiler. Libertinage, echangisme, candaulisme, etc. A leurs yeux tous les moyens sont bons pour atteindre l'orgasme, surtout si leur compagnon est d'accord pour qu'elles aient plusieurs partenaires en meme temps. Car, comme le dit le vieil adage: &quot;! Plus on est de fous, plus on jouit&quot; Dans ce sauna echangiste, il est possible de tomber sur des couples assez speciaux, comme cet homme mur accompagne de sa jolie petite blonde. Rien ne l'excite plus que de se masturber en regardant sa jeune femme en train de sucer des inconnus et de se faire prendre dans toutes les positions. Lula Boobs vient d'etre elue Miss Libertine et, pour feter cette veritable consecration, elle a envie d'une vraie bonne baise! La rouquine a la superbe poitrine entraine donc son copain et un de ses amis dans un bois ou elle finira par se faire sodomiser par trois hommes a l'arriere d'un utilitaire. Le territoire de chasse de Laure et de son copain, ce sont les sex shops. En commencant a se caresser dans les rayons de ces magasins, ils tombent toujours sur un ou deux hommes bien membres. Il est tres rare que ces derniers refusent de monter chez eux afin de baiser Laure par tous les orifices et de recouvrir son visage de sperme ...\r\n\r\n\r\nName: Young, charming and Depraved\r\nOriginal: Young Pretty And Nasty / Jeune, Jolie and Perverse\r\nYear: 2016\r\nGenre: Anal, Oral, Threesomes, Foursome, Amateur, Teens\r\nDirected by: Philippe Soine / Selection Dorcel\r\nStarring: Lula Boobs, Laure Rosenoire, Lusy, Philippe Soine.\r\n\r\nCountry: France\r\nDuration: 1:09:36\r\nTranslation: No Translation\r\n\r\nTechnical data\r\nQuality: WEBRip-AVC\r\nFormat: MP4\r\nVideo codec: H264\r\nVideo: 1024x576, 2339kbps\r\nAudio codec: AAC\r\nAudio: 151kbps","torrent":{"xt":"urn:btih:f9941588b0114c187a406379323e8d096c73aaf0","amp;dn":"Young+Pretty+And+Nasty+Jeune+%5BSelection+Dorcel%5D+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9941588b0114c187a406379323e8d096c73aaf0","infoHashBuffer":{"type":"Buffer","data":[249,148,21,136,176,17,76,24,122,64,99,121,50,62,141,9,108,115,170,240]},"announce":[],"urlList":[]}}