{"title":"Occult - Scots Discovery of Witches, 1584 (pdf) EarthBow","uid":4660251,"size":178000137,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa5e032babeb5de091a7ed93b3e18c8fd5ca0ca0&amp;dn=Occult+-+Scots+Discovery+of+Witches%2C+1584+%28pdf%29+EarthBow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EarthBow","files":1,"time":1232360693,"description":"Scot, Reginald - Scot's Discovery of Witches, 1584, 458 pages\n\nIn this book's introduction, Scot says, &quot;The common opinions of witches contracting with devils, spirits, or familiars, and their power to kill, torment, and consume the bodies of men, women, and children by diseases or otherwise, their flying in the air, and etc to be but imaginary erroneous conceptions and novelties.&quot; He then goes on to judge witch hunters as unchristian in their actions, condemning torture and witch-hunting in general.\n\nThe first part of this book presents logical reasons why accused witches couldn't possibly be guilty of the charges... an unusual position to take in 1584, and one that was no doubt unpopular with the church. The author must have been a brave man to challenge the authorities of the church.\n\nThe latter part of the book is perhaps more interesting, containing &quot;A treatise upon the nature and substance of spirits, devils, etc.&quot; He goes on to name dozens of demons (and angels) and explains their role in things. He also gives detailed information about summoning these demons, astrological and alchemical information, and a lot of additional esoteric and occult information.\n\nThis is a fairly large file, but it's a &quot;must have&quot; for anyone interested in witchcraft or the occult. \n\n\nNote: I will be adding many more titles soon, bookmark my TPB page at...  &lt;a href=&quot;\nhttp://thepiratebay.se/user/EarthBow&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/EarthBow&lt;/a&gt;\n\nAs always, comments (good or bad) are appreciated\n\nKeywords: witchcraft, witch, grimoire, esoteric, occult, rituals, paganism","torrent":{"xt":"urn:btih:fa5e032babeb5de091a7ed93b3e18c8fd5ca0ca0","amp;dn":"Occult+-+Scots+Discovery+of+Witches%2C+1584+%28pdf%29+EarthBow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa5e032babeb5de091a7ed93b3e18c8fd5ca0ca0","infoHashBuffer":{"type":"Buffer","data":[250,94,3,43,171,235,93,224,145,167,237,147,179,225,140,143,213,202,12,160]},"announce":[],"urlList":[]}}