{"title":"A Common Hunger: Land Rights in Canada and South Africa [blackat","uid":8762132,"size":2513034,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fbcab655d2b1209bdbde8d0cbcd72b729e29a2c0&amp;dn=A+Common+Hunger%3A+Land+Rights+in+Canada+and+South+Africa+%5Bblackat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blackatk","files":-1,"time":1375264372,"description":"\n\nPublication Date: November 24, 2006 | ISBN-10: 1552381927 | ISBN-13: 978-1552381922 |   Give it up for wetworx12 a bitter, race-baiting troll who inspired this upload! | filetype: pdf |\n\n\nGeographically, demographically, and politically, South Africa and Canada are two countries that are very far apart. What they have in common are indigenous populations, which, because of their historical and ongoing experience of colonization and dispossession, share a hunger for land and human dignity. Based on extensive research carried out in both countries, A Common Hunger is a comparative work on the history of indigenous land rights in Canada and post-apartheid South Africa. Author Joan Fairweather has constructed a balanced examination of the impact of land dispossession on the lives of indigenous peoples in both countries and their response to centuries of European domination. By reclaiming rights to the land and an equitable share in the wealth-producing resources they contain, the first peoples of Canada and South Africa are taking important steps to confront the legacies of poverty that characterize many of their communities. A Common Hunger provides historical context to the current land claim process in these two former British colonies and examines the efforts of governments and the courts to ensure that justice is done. \n\n\n\nPaperback: 284 pages\nPublisher: University of Calgary Press (November 24, 2006)\nLanguage: English\nISBN-10: 1552381927\nISBN-13: 978-1552381922\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Common-Hunger-Rights-Canada-Missing/dp/1552381927/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Common-Hunger-Rights-Canada-Missing/dp/1552381927/&lt;/a&gt;\n\n\n\ntags: Canada, south africa, sa, great white north, discrimination, legalized racism, systemic racism, institutional racism, land, denied, poverty, pride, superiority, complex, boer, europe, european, eurocentric, euro-centric, post-apartheid, urocentric, eurocentricity, anglo, anglo-saxon bias, race, racism, oppression, nation, nationalist,self-reliance, self-determination, independence, colonialism, UK, GB, Great Britain, England, French, native american, inuit, Indian, first nation, inuit, meskis, algonquin, ","torrent":{"xt":"urn:btih:fbcab655d2b1209bdbde8d0cbcd72b729e29a2c0","amp;dn":"A+Common+Hunger%3A+Land+Rights+in+Canada+and+South+Africa+%5Bblackat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbcab655d2b1209bdbde8d0cbcd72b729e29a2c0","infoHashBuffer":{"type":"Buffer","data":[251,202,182,85,210,177,32,155,219,222,141,12,188,215,43,114,158,41,162,192]},"announce":[],"urlList":[]}}