{"title":"C4S-----Jodi West - My Son is Out of Control.wmv","uid":9486099,"size":465401202,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:fca4ad10f1d275e302ba115b70537cd9495cfcfe&amp;dn=C4S%5C-----Jodi+West+-+My+Son+is+Out+of+Control.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1389891555,"description":"REQUEST by @PACman863\n\n\nJodi West - My Son is Out of Control! \n\n Run Time 10 \n Size 443 MB \n Resolution 1280 x 720 px \n\n A TOP 3 SELLING C4S VIDEO!!! \n\n IF MOTHER THINKS SHE IS HOME ALONE, SHE IS VERY MISTAKEN! TYLER IS HOME ALSO, AND HE WANTS HIS MOTHER AND WON'T TAKE NO FOR AN ANSWER! \n\n Mother sips her tea quietly, enjoying the peace and quite of an empty house. \n\n There has been so much going on lately, Mother has had no chance to just enjoy some &quot;alone time&quot;. The tea soothes her body as she sips on it's warmth. \n\n Mother is surprised when she feels a hand from behind. She spins to find Tyler behind her, touching her very backside inappropriately. \n\n &quot;What are you doing here?&quot; Mother asks. She has had a couple of conflicts recently with the young man, and does not want him in the house when she is alone. They both let one night \n\n get away from them, and she has a feeling that the young man can't let it go! \n\n &quot;You need to leave now!&quot; Mother insists, but Tyler has something else in mind. Mother's will power seams strong, but once Tyler's hand start touching her private parts, the internal fire \n\n that she has been trying to keep down starts building. \n\n &quot;You know you want this&quot; Tyler forces himself on her, knowing she will reluctantly give in. \n\n In one quick move, Tyler rips open her blouse, pulling it down her arms so her hands can't fight him off. He then lifts her up onto the counter and pulls her already moist panties aside. \n\n For a young man, Tyler is very gifted with his mouth, and with his tongue on her pussy, soon Mother can't help but give into his advances. \n\n After Mother is forced orally to orgasm, she is let down, breathless, from the counter. She thinks it is over, but it is just starting!. \n\n Tyler spins her around and rips open her skirt. He pulls off his shorts, reveling his massive erection. He bends Mother over and slides his large cock deep into Mother's womb. The \n\n pleasure is so great, Mother stops trying to fight off the advances and gives into the long strokes of his hardness. \n\n As Mother is forced to orgasm again by his manhood, she is helpless to fight off the inappropriate advances. Mother drops helplessly to her knees and starts working Tyler's penis with \n\n her mouth. in just a few strokes, the worked up young man is exploding into her throat and onto her face. Stream after stream of pearly white semen splash onto her face, and right \n\n when Mother thinks it is over, he has even more cum in him! He milks every last drop out onto Mother's waiting lips. \n\n Tyler knows that Mother can't resist his advances, and this will not be the last time they get together! \n\n\n\nScreens \n                     &lt;a href=&quot;\nhttp://image.bayimg.com/73e4e737406015694454b9ddc0ccd1e211e38359.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/73e4e737406015694454b9ddc0ccd1e211e38359.jpg&lt;/a&gt;\n\n \n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment\nbelow ? :)  \n\n \n\nAny Questions ?? Read our FAQ!!\n\n \n                     &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:fca4ad10f1d275e302ba115b70537cd9495cfcfe","amp;dn":"C4S%5C-----Jodi+West+-+My+Son+is+Out+of+Control.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fca4ad10f1d275e302ba115b70537cd9495cfcfe","infoHashBuffer":{"type":"Buffer","data":[252,164,173,16,241,210,117,227,2,186,17,91,112,83,124,217,73,92,252,254]},"announce":[],"urlList":[]}}