{"title":"The First World War - Martin Gilbert","uid":12065559,"size":8015192,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff6ff5fe5e08a1e5e75af9e3b0b326addc2f96f8&amp;dn=The+First+World+War+-+Martin+Gilbert&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1435378300,"description":"The acclaimed British historian offers a majestic, single-volume work incorporating all major fronts-domestic, diplomatic, military-for &quot;a stunning achievement of research and storytelling&quot;\n\n(Publishers Weekly)\n\nIt was to be the war to end all wars, and it began at 11:15 on the morning of June 28, 1914, in an outpost of the Austro-Hungarian Empire called Sarajevo. It would end officially almost five years later. Unofficially, it has never ended: the horrors we live with today were born in the First World War.\n\nIt left millions-civilians and soldiers-maimed or dead. And it left us with new technologies of death: tanks, planes, and submarines; reliable rapid-fire machine guns and field artillery; poison gas and chemical warfare. It introduced us to U-boat packs and strategic bombing, to unrestricted war on civilians and mistreatment of prisoners. Most of all, it changed our world. In its wake, empires toppled, monarchies fell, whole populations lost their national identities as political systems, and geographic boundaries were realigned. Instabilities were institutionalized, enmities enshrined. And the social order shifted seismically. Manners, mores, codes of behavior; literature and the arts; education and class distinctions-all underwent a vast sea change. And in all these ways, the twentieth century can be said to have been born on the morning of June 28, 1914.\n\n&quot;One of the first books that anyone should read in beginning to try to understand this war and this century.&quot;\n\n-The New York Times Book Review (cover)","torrent":{"xt":"urn:btih:ff6ff5fe5e08a1e5e75af9e3b0b326addc2f96f8","amp;dn":"The+First+World+War+-+Martin+Gilbert","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff6ff5fe5e08a1e5e75af9e3b0b326addc2f96f8","infoHashBuffer":{"type":"Buffer","data":[255,111,245,254,94,8,161,229,231,90,249,227,176,179,38,173,220,47,150,248]},"announce":[],"urlList":[]}}