{"title":"The Boy Who Drew Monsters - Keith Donohue","uid":14372628,"size":703972,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ffc974f935fab034bfa7de518636f4d5c3a41da7&amp;dn=The+Boy+Who+Drew+Monsters+-+Keith+Donohue&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1461173866,"description":"From the New York Times bestselling author of The Stolen Child comes a hypnotic literary horror novel about a young boy trapped inside his own world, whose drawings blur the lines between fantasy and reality.\r\n\r\nEver since he nearly drowned in the ocean three years earlier, ten-year-old Jack Peter Keenan has been deathly afraid to venture outdoors. Refusing to leave his home in a small coastal town in Maine, Jack Peter spends his time drawing monsters. When those drawings take on a life of their own, no one is safe from the terror they inspire. His mother, Holly, begins to hear strange sounds in the night coming from the ocean, and she seeks answers from the local Catholic priest and his Japanese housekeeper, who fill her head with stories of shipwrecks and ghosts. His father, Tim, wanders the beach, frantically searching for a strange apparition running wild in the dunes. And the boy's only friend, Nick, becomes helplessly entangled in the eerie power of the drawings. While those around Jack Peter are haunted by what they think they see, only he knows the truth behind the frightful occurrences as the outside world encroaches upon them all.\r\n\r\nIn the tradition of The Turn of the Screw, Keith Donohue's The Boy Who Drew Monsters is a mesmerizing tale of psychological terror and imagination run wild, a perfectly creepy read for a dark night","torrent":{"xt":"urn:btih:ffc974f935fab034bfa7de518636f4d5c3a41da7","amp;dn":"The+Boy+Who+Drew+Monsters+-+Keith+Donohue","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffc974f935fab034bfa7de518636f4d5c3a41da7","infoHashBuffer":{"type":"Buffer","data":[255,201,116,249,53,250,176,52,191,167,222,81,134,54,244,213,195,164,29,167]},"announce":[],"urlList":[]}}